Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/**
 * \file IfxEvadc_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC39XA_ITS_V3.0.R0
 * Specification: TC39X_EVADC_its_MCSFR.xml
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Evadc_Cfg Evadc address
 * \ingroup IfxLld_Evadc
 * 
 * \defgroup IfxLld_Evadc_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Evadc_Cfg
 * 
 * \defgroup IfxLld_Evadc_Cfg_Evadc 2-EVADC
 * \ingroup IfxLld_Evadc_Cfg
 * 
 */
#ifndef IFXEVADC_REG_H
#define IFXEVADC_REG_H 1
/******************************************************************************/
#include "IfxEvadc_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Evadc_Cfg_BaseAddress
 * \{  */

/** \brief  EVADC object */
#define MODULE_EVADC /*lint --e(923)*/ (*(Ifx_EVADC*)0xF0020000u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Evadc_Cfg_Evadc
 * \{  */

/** \brief  3C, Access Enable Register 0 */
#define EVADC_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_ACCEN0*)0xF002003Cu)

/** \brief  38, Access Enable Register 1 */
#define EVADC_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_ACCEN1*)0xF0020038u)

/** \brief  88, Access Protection Register 0 */
#define EVADC_ACCPROT0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_ACCPROT0*)0xF0020088u)

/** \brief  8C, Access Protection Register 1 */
#define EVADC_ACCPROT1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_ACCPROT1*)0xF002008Cu)

/** \brief  90, Access Protection Register 2 */
#define EVADC_ACCPROT2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_ACCPROT2*)0xF0020090u)

/** \brief  0, Clock Control Register */
#define EVADC_CLC /*lint --e(923)*/ (*(volatile Ifx_EVADC_CLC*)0xF0020000u)

/** \brief  3F0, External Multiplexer Interface Select Register */
#define EVADC_EMUXSEL /*lint --e(923)*/ (*(volatile Ifx_EVADC_EMUXSEL*)0xF00203F0u)

/** \brief  3420, Boundary Flag Register, Group */
#define EVADC_FCG0_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023420u)

/** Alias (User Manual Name) for EVADC_FCG0_FCBFL.
* To use register names with standard convension, please use EVADC_FCG0_FCBFL.
*/
#define	EVADC_G12FCBFL	(EVADC_FCG0_FCBFL)

/** \brief  3400, Fast Compare Control Register, Group */
#define EVADC_FCG0_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023400u)

/** Alias (User Manual Name) for EVADC_FCG0_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG0_FCCTRL.
*/
#define	EVADC_G12FCCTRL	(EVADC_FCG0_FCCTRL)

/** \brief  3424, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG0_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023424u)

/** Alias (User Manual Name) for EVADC_FCG0_FCHYST.
* To use register names with standard convension, please use EVADC_FCG0_FCHYST.
*/
#define	EVADC_G12FCHYST	(EVADC_FCG0_FCHYST)

/** \brief  3404, Fast Compare Mode Register, Group */
#define EVADC_FCG0_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023404u)

/** Alias (User Manual Name) for EVADC_FCG0_FCM.
* To use register names with standard convension, please use EVADC_FCG0_FCM.
*/
#define	EVADC_G12FCM	(EVADC_FCG0_FCM)

/** \brief  3408, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG0_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023408u)

/** Alias (User Manual Name) for EVADC_FCG0_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG0_FCRAMP0.
*/
#define	EVADC_G12FCRAMP0	(EVADC_FCG0_FCRAMP0)

/** \brief  340C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG0_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF002340Cu)

/** Alias (User Manual Name) for EVADC_FCG0_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG0_FCRAMP1.
*/
#define	EVADC_G12FCRAMP1	(EVADC_FCG0_FCRAMP1)

/** \brief  3520, Boundary Flag Register, Group */
#define EVADC_FCG1_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023520u)

/** Alias (User Manual Name) for EVADC_FCG1_FCBFL.
* To use register names with standard convension, please use EVADC_FCG1_FCBFL.
*/
#define	EVADC_G13FCBFL	(EVADC_FCG1_FCBFL)

/** \brief  3500, Fast Compare Control Register, Group */
#define EVADC_FCG1_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023500u)

/** Alias (User Manual Name) for EVADC_FCG1_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG1_FCCTRL.
*/
#define	EVADC_G13FCCTRL	(EVADC_FCG1_FCCTRL)

/** \brief  3524, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG1_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023524u)

/** Alias (User Manual Name) for EVADC_FCG1_FCHYST.
* To use register names with standard convension, please use EVADC_FCG1_FCHYST.
*/
#define	EVADC_G13FCHYST	(EVADC_FCG1_FCHYST)

/** \brief  3504, Fast Compare Mode Register, Group */
#define EVADC_FCG1_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023504u)

/** Alias (User Manual Name) for EVADC_FCG1_FCM.
* To use register names with standard convension, please use EVADC_FCG1_FCM.
*/
#define	EVADC_G13FCM	(EVADC_FCG1_FCM)

/** \brief  3508, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG1_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023508u)

/** Alias (User Manual Name) for EVADC_FCG1_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG1_FCRAMP0.
*/
#define	EVADC_G13FCRAMP0	(EVADC_FCG1_FCRAMP0)

