Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  350C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG1_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF002350Cu)

/** Alias (User Manual Name) for EVADC_FCG1_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG1_FCRAMP1.
*/
#define	EVADC_G13FCRAMP1	(EVADC_FCG1_FCRAMP1)

/** \brief  3620, Boundary Flag Register, Group */
#define EVADC_FCG2_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023620u)

/** Alias (User Manual Name) for EVADC_FCG2_FCBFL.
* To use register names with standard convension, please use EVADC_FCG2_FCBFL.
*/
#define	EVADC_G14FCBFL	(EVADC_FCG2_FCBFL)

/** \brief  3600, Fast Compare Control Register, Group */
#define EVADC_FCG2_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023600u)

/** Alias (User Manual Name) for EVADC_FCG2_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG2_FCCTRL.
*/
#define	EVADC_G14FCCTRL	(EVADC_FCG2_FCCTRL)

/** \brief  3624, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG2_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023624u)

/** Alias (User Manual Name) for EVADC_FCG2_FCHYST.
* To use register names with standard convension, please use EVADC_FCG2_FCHYST.
*/
#define	EVADC_G14FCHYST	(EVADC_FCG2_FCHYST)

/** \brief  3604, Fast Compare Mode Register, Group */
#define EVADC_FCG2_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023604u)

/** Alias (User Manual Name) for EVADC_FCG2_FCM.
* To use register names with standard convension, please use EVADC_FCG2_FCM.
*/
#define	EVADC_G14FCM	(EVADC_FCG2_FCM)

/** \brief  3608, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG2_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023608u)

/** Alias (User Manual Name) for EVADC_FCG2_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG2_FCRAMP0.
*/
#define	EVADC_G14FCRAMP0	(EVADC_FCG2_FCRAMP0)

/** \brief  360C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG2_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF002360Cu)

/** Alias (User Manual Name) for EVADC_FCG2_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG2_FCRAMP1.
*/
#define	EVADC_G14FCRAMP1	(EVADC_FCG2_FCRAMP1)

/** \brief  3720, Boundary Flag Register, Group */
#define EVADC_FCG3_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023720u)

/** Alias (User Manual Name) for EVADC_FCG3_FCBFL.
* To use register names with standard convension, please use EVADC_FCG3_FCBFL.
*/
#define	EVADC_G15FCBFL	(EVADC_FCG3_FCBFL)

/** \brief  3700, Fast Compare Control Register, Group */
#define EVADC_FCG3_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023700u)

/** Alias (User Manual Name) for EVADC_FCG3_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG3_FCCTRL.
*/
#define	EVADC_G15FCCTRL	(EVADC_FCG3_FCCTRL)

/** \brief  3724, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG3_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023724u)

/** Alias (User Manual Name) for EVADC_FCG3_FCHYST.
* To use register names with standard convension, please use EVADC_FCG3_FCHYST.
*/
#define	EVADC_G15FCHYST	(EVADC_FCG3_FCHYST)

/** \brief  3704, Fast Compare Mode Register, Group */
#define EVADC_FCG3_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023704u)

/** Alias (User Manual Name) for EVADC_FCG3_FCM.
* To use register names with standard convension, please use EVADC_FCG3_FCM.
*/
#define	EVADC_G15FCM	(EVADC_FCG3_FCM)

/** \brief  3708, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG3_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023708u)

/** Alias (User Manual Name) for EVADC_FCG3_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG3_FCRAMP0.
*/
#define	EVADC_G15FCRAMP0	(EVADC_FCG3_FCRAMP0)

/** \brief  370C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG3_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF002370Cu)

/** Alias (User Manual Name) for EVADC_FCG3_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG3_FCRAMP1.
*/
#define	EVADC_G15FCRAMP1	(EVADC_FCG3_FCRAMP1)

/** \brief  3820, Boundary Flag Register, Group */
#define EVADC_FCG4_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023820u)

/** Alias (User Manual Name) for EVADC_FCG4_FCBFL.
* To use register names with standard convension, please use EVADC_FCG4_FCBFL.
*/
#define	EVADC_G16FCBFL	(EVADC_FCG4_FCBFL)

/** \brief  3800, Fast Compare Control Register, Group */
#define EVADC_FCG4_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023800u)

/** Alias (User Manual Name) for EVADC_FCG4_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG4_FCCTRL.
*/
#define	EVADC_G16FCCTRL	(EVADC_FCG4_FCCTRL)

/** \brief  3824, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG4_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023824u)

/** Alias (User Manual Name) for EVADC_FCG4_FCHYST.
* To use register names with standard convension, please use EVADC_FCG4_FCHYST.
*/
#define	EVADC_G16FCHYST	(EVADC_FCG4_FCHYST)

/** \brief  3804, Fast Compare Mode Register, Group */
#define EVADC_FCG4_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023804u)

/** Alias (User Manual Name) for EVADC_FCG4_FCM.
* To use register names with standard convension, please use EVADC_FCG4_FCM.
*/
#define	EVADC_G16FCM	(EVADC_FCG4_FCM)

/** \brief  3808, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG4_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023808u)

/** Alias (User Manual Name) for EVADC_FCG4_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG4_FCRAMP0.
*/
#define	EVADC_G16FCRAMP0	(EVADC_FCG4_FCRAMP0)

/** \brief  380C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG4_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF002380Cu)

/** Alias (User Manual Name) for EVADC_FCG4_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG4_FCRAMP1.
*/
#define	EVADC_G16FCRAMP1	(EVADC_FCG4_FCRAMP1)

/** \brief  3920, Boundary Flag Register, Group */
#define EVADC_FCG5_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023920u)

/** Alias (User Manual Name) for EVADC_FCG5_FCBFL.
* To use register names with standard convension, please use EVADC_FCG5_FCBFL.
*/
#define	EVADC_G17FCBFL	(EVADC_FCG5_FCBFL)

