Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  3900, Fast Compare Control Register, Group */
#define EVADC_FCG5_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023900u)

/** Alias (User Manual Name) for EVADC_FCG5_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG5_FCCTRL.
*/
#define	EVADC_G17FCCTRL	(EVADC_FCG5_FCCTRL)

/** \brief  3924, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG5_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023924u)

/** Alias (User Manual Name) for EVADC_FCG5_FCHYST.
* To use register names with standard convension, please use EVADC_FCG5_FCHYST.
*/
#define	EVADC_G17FCHYST	(EVADC_FCG5_FCHYST)

/** \brief  3904, Fast Compare Mode Register, Group */
#define EVADC_FCG5_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023904u)

/** Alias (User Manual Name) for EVADC_FCG5_FCM.
* To use register names with standard convension, please use EVADC_FCG5_FCM.
*/
#define	EVADC_G17FCM	(EVADC_FCG5_FCM)

/** \brief  3908, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG5_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023908u)

/** Alias (User Manual Name) for EVADC_FCG5_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG5_FCRAMP0.
*/
#define	EVADC_G17FCRAMP0	(EVADC_FCG5_FCRAMP0)

/** \brief  390C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG5_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF002390Cu)

/** Alias (User Manual Name) for EVADC_FCG5_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG5_FCRAMP1.
*/
#define	EVADC_G17FCRAMP1	(EVADC_FCG5_FCRAMP1)

/** \brief  3A20, Boundary Flag Register, Group */
#define EVADC_FCG6_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023A20u)

/** Alias (User Manual Name) for EVADC_FCG6_FCBFL.
* To use register names with standard convension, please use EVADC_FCG6_FCBFL.
*/
#define	EVADC_G18FCBFL	(EVADC_FCG6_FCBFL)

/** \brief  3A00, Fast Compare Control Register, Group */
#define EVADC_FCG6_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023A00u)

/** Alias (User Manual Name) for EVADC_FCG6_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG6_FCCTRL.
*/
#define	EVADC_G18FCCTRL	(EVADC_FCG6_FCCTRL)

/** \brief  3A24, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG6_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023A24u)

/** Alias (User Manual Name) for EVADC_FCG6_FCHYST.
* To use register names with standard convension, please use EVADC_FCG6_FCHYST.
*/
#define	EVADC_G18FCHYST	(EVADC_FCG6_FCHYST)

/** \brief  3A04, Fast Compare Mode Register, Group */
#define EVADC_FCG6_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023A04u)

/** Alias (User Manual Name) for EVADC_FCG6_FCM.
* To use register names with standard convension, please use EVADC_FCG6_FCM.
*/
#define	EVADC_G18FCM	(EVADC_FCG6_FCM)

/** \brief  3A08, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG6_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023A08u)

/** Alias (User Manual Name) for EVADC_FCG6_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG6_FCRAMP0.
*/
#define	EVADC_G18FCRAMP0	(EVADC_FCG6_FCRAMP0)

/** \brief  3A0C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG6_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF0023A0Cu)

/** Alias (User Manual Name) for EVADC_FCG6_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG6_FCRAMP1.
*/
#define	EVADC_G18FCRAMP1	(EVADC_FCG6_FCRAMP1)

/** \brief  3B20, Boundary Flag Register, Group */
#define EVADC_FCG7_FCBFL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCBFL*)0xF0023B20u)

/** Alias (User Manual Name) for EVADC_FCG7_FCBFL.
* To use register names with standard convension, please use EVADC_FCG7_FCBFL.
*/
#define	EVADC_G19FCBFL	(EVADC_FCG7_FCBFL)

/** \brief  3B00, Fast Compare Control Register, Group */
#define EVADC_FCG7_FCCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCCTRL*)0xF0023B00u)

/** Alias (User Manual Name) for EVADC_FCG7_FCCTRL.
* To use register names with standard convension, please use EVADC_FCG7_FCCTRL.
*/
#define	EVADC_G19FCCTRL	(EVADC_FCG7_FCCTRL)

/** \brief  3B24, Fast Comp. Hysteresis Register, Group */
#define EVADC_FCG7_FCHYST /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCHYST*)0xF0023B24u)

/** Alias (User Manual Name) for EVADC_FCG7_FCHYST.
* To use register names with standard convension, please use EVADC_FCG7_FCHYST.
*/
#define	EVADC_G19FCHYST	(EVADC_FCG7_FCHYST)

/** \brief  3B04, Fast Compare Mode Register, Group */
#define EVADC_FCG7_FCM /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCM*)0xF0023B04u)

/** Alias (User Manual Name) for EVADC_FCG7_FCM.
* To use register names with standard convension, please use EVADC_FCG7_FCM.
*/
#define	EVADC_G19FCM	(EVADC_FCG7_FCM)

/** \brief  3B08, Fast Compare Ramp Register 0, Group */
#define EVADC_FCG7_FCRAMP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP0*)0xF0023B08u)

/** Alias (User Manual Name) for EVADC_FCG7_FCRAMP0.
* To use register names with standard convension, please use EVADC_FCG7_FCRAMP0.
*/
#define	EVADC_G19FCRAMP0	(EVADC_FCG7_FCRAMP0)

/** \brief  3B0C, Fast Compare Ramp Register 1, Group */
#define EVADC_FCG7_FCRAMP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_FCG_FCRAMP1*)0xF0023B0Cu)

/** Alias (User Manual Name) for EVADC_FCG7_FCRAMP1.
* To use register names with standard convension, please use EVADC_FCG7_FCRAMP1.
*/
#define	EVADC_G19FCRAMP1	(EVADC_FCG7_FCRAMP1)

/** \brief  4B0, Alias Register, Group */
#define EVADC_G0_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00204B0u)

/** Alias (User Manual Name) for EVADC_G0_ALIAS.
* To use register names with standard convension, please use EVADC_G0_ALIAS.
*/
#define	EVADC_G0ALIAS	(EVADC_G0_ALIAS)

/** \brief  488, Analog Fct. Config. Register, Group */
#define EVADC_G0_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0020488u)

/** Alias (User Manual Name) for EVADC_G0_ANCFG.
* To use register names with standard convension, please use EVADC_G0_ANCFG.
*/
#define	EVADC_G0ANCFG	(EVADC_G0_ANCFG)

