Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  480, Arbitration Config. Register, Group */
#define EVADC_G0_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0020480u)

/** Alias (User Manual Name) for EVADC_G0_ARBCFG.
* To use register names with standard convension, please use EVADC_G0_ARBCFG.
*/
#define	EVADC_G0ARBCFG	(EVADC_G0_ARBCFG)

/** \brief  484, Arbitration Priority Register, Group */
#define EVADC_G0_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0020484u)

/** Alias (User Manual Name) for EVADC_G0_ARBPR.
* To use register names with standard convension, please use EVADC_G0_ARBPR.
*/
#define	EVADC_G0ARBPR	(EVADC_G0_ARBPR)

/** \brief  4B8, Boundary Select Register, Group */
#define EVADC_G0_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00204B8u)

/** Alias (User Manual Name) for EVADC_G0_BOUND.
* To use register names with standard convension, please use EVADC_G0_BOUND.
*/
#define	EVADC_G0BOUND	(EVADC_G0_BOUND)

/** \brief  590, Channel Event Flag Clear Register, Group */
#define EVADC_G0_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0020590u)

/** Alias (User Manual Name) for EVADC_G0_CEFCLR.
* To use register names with standard convension, please use EVADC_G0_CEFCLR.
*/
#define	EVADC_G0CEFCLR	(EVADC_G0_CEFCLR)

/** \brief  580, Channel Event Flag Register, Group */
#define EVADC_G0_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0020580u)

/** Alias (User Manual Name) for EVADC_G0_CEFLAG.
* To use register names with standard convension, please use EVADC_G0_CEFLAG.
*/
#define	EVADC_G0CEFLAG	(EVADC_G0_CEFLAG)

/** \brief  5A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G0_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00205A0u)

/** Alias (User Manual Name) for EVADC_G0_CEVNP0.
* To use register names with standard convension, please use EVADC_G0_CEVNP0.
*/
#define	EVADC_G0CEVNP0	(EVADC_G0_CEVNP0)

/** \brief  600, Group, Channel Control Register */
#define EVADC_G0_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020600u)

/** Alias (User Manual Name) for EVADC_G0_CHCTR0.
* To use register names with standard convension, please use EVADC_G0_CHCTR0.
*/
#define	EVADC_G0CHCTR0	(EVADC_G0_CHCTR0)

/** \brief  604, Group, Channel Control Register */
#define EVADC_G0_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020604u)

/** Alias (User Manual Name) for EVADC_G0_CHCTR1.
* To use register names with standard convension, please use EVADC_G0_CHCTR1.
*/
#define	EVADC_G0CHCTR1	(EVADC_G0_CHCTR1)

/** \brief  608, Group, Channel Control Register */
#define EVADC_G0_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020608u)

/** Alias (User Manual Name) for EVADC_G0_CHCTR2.
* To use register names with standard convension, please use EVADC_G0_CHCTR2.
*/
#define	EVADC_G0CHCTR2	(EVADC_G0_CHCTR2)

/** \brief  60C, Group, Channel Control Register */
#define EVADC_G0_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002060Cu)

/** Alias (User Manual Name) for EVADC_G0_CHCTR3.
* To use register names with standard convension, please use EVADC_G0_CHCTR3.
*/
#define	EVADC_G0CHCTR3	(EVADC_G0_CHCTR3)

/** \brief  610, Group, Channel Control Register */
#define EVADC_G0_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020610u)

/** Alias (User Manual Name) for EVADC_G0_CHCTR4.
* To use register names with standard convension, please use EVADC_G0_CHCTR4.
*/
#define	EVADC_G0CHCTR4	(EVADC_G0_CHCTR4)

/** \brief  614, Group, Channel Control Register */
#define EVADC_G0_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020614u)

/** Alias (User Manual Name) for EVADC_G0_CHCTR5.
* To use register names with standard convension, please use EVADC_G0_CHCTR5.
*/
#define	EVADC_G0CHCTR5	(EVADC_G0_CHCTR5)

/** \brief  618, Group, Channel Control Register */
#define EVADC_G0_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020618u)

/** Alias (User Manual Name) for EVADC_G0_CHCTR6.
* To use register names with standard convension, please use EVADC_G0_CHCTR6.
*/
#define	EVADC_G0CHCTR6	(EVADC_G0_CHCTR6)

/** \brief  61C, Group, Channel Control Register */
#define EVADC_G0_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002061Cu)

/** Alias (User Manual Name) for EVADC_G0_CHCTR7.
* To use register names with standard convension, please use EVADC_G0_CHCTR7.
*/
#define	EVADC_G0CHCTR7	(EVADC_G0_CHCTR7)

/** \brief  5F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G0_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00205F4u)

/** Alias (User Manual Name) for EVADC_G0_EMUXCS.
* To use register names with standard convension, please use EVADC_G0_EMUXCS.
*/
#define	EVADC_G0EMUXCS	(EVADC_G0_EMUXCS)

/** \brief  5F0, External Multiplexer Control Reg., Group */
#define EVADC_G0_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00205F0u)

/** Alias (User Manual Name) for EVADC_G0_EMUXCTR.
* To use register names with standard convension, please use EVADC_G0_EMUXCTR.
*/
#define	EVADC_G0EMUXCTR	(EVADC_G0_EMUXCTR)

/** \brief  4A0, Input Class Reg0ster i, Group */
#define EVADC_G0_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00204A0u)

/** Alias (User Manual Name) for EVADC_G0_ICLASS0.
* To use register names with standard convension, please use EVADC_G0_ICLASS0.
*/
#define	EVADC_G0ICLASS0	(EVADC_G0_ICLASS0)

/** \brief  4A4, Input Class Reg0ster i, Group */
#define EVADC_G0_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00204A4u)

/** Alias (User Manual Name) for EVADC_G0_ICLASS1.
* To use register names with standard convension, please use EVADC_G0_ICLASS1.
*/
#define	EVADC_G0ICLASS1	(EVADC_G0_ICLASS1)

/** \brief  50C, Queue 0 Register 0, Group 0 */
#define EVADC_G0_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002050Cu)

/** Alias (User Manual Name) for EVADC_G0_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G0_Q0_Q0R.
*/
#define	EVADC_G0Q0R0	(EVADC_G0_Q0_Q0R)

/** \brief  500, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G0_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020500u)

/** Alias (User Manual Name) for EVADC_G0_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G0_Q0_QCTRL.
*/
#define	EVADC_G0QCTRL0	(EVADC_G0_Q0_QCTRL)

/** \brief  510, Queue 0 Input Register, Group 0 */
#define EVADC_G0_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020510u)

/** Alias (User Manual Name) for EVADC_G0_Q0_QINR.
* To use register names with standard convension, please use EVADC_G0_Q0_QINR.
*/
#define	EVADC_G0QINR0	(EVADC_G0_Q0_QINR)

/** \brief  504, Queue 0 Mode Register, Group 0 */
#define EVADC_G0_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020504u)

