Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G0_Q0_QMR.
* To use register names with standard convension, please use EVADC_G0_Q0_QMR.
*/
#define	EVADC_G0QMR0	(EVADC_G0_Q0_QMR)

/** \brief  508, Queue 0 Status Register, Group 0 */
#define EVADC_G0_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020508u)

/** Alias (User Manual Name) for EVADC_G0_Q0_QSR.
* To use register names with standard convension, please use EVADC_G0_Q0_QSR.
*/
#define	EVADC_G0QSR0	(EVADC_G0_Q0_QSR)

/** \brief  518, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G0_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020518u)

/** Alias (User Manual Name) for EVADC_G0_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G0_Q0_REQTM.
*/
#define	EVADC_G0REQTM0	(EVADC_G0_Q0_REQTM)

/** \brief  51C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G0_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002051Cu)

/** Alias (User Manual Name) for EVADC_G0_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G0_Q0_REQTS.
*/
#define	EVADC_G0REQTS0	(EVADC_G0_Q0_REQTS)

/** \brief  52C, Queue 0 Register 0, Group 0 */
#define EVADC_G0_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002052Cu)

/** Alias (User Manual Name) for EVADC_G0_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G0_Q1_Q0R.
*/
#define	EVADC_G0Q0R1	(EVADC_G0_Q1_Q0R)

/** \brief  520, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G0_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020520u)

/** Alias (User Manual Name) for EVADC_G0_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G0_Q1_QCTRL.
*/
#define	EVADC_G0QCTRL1	(EVADC_G0_Q1_QCTRL)

/** \brief  530, Queue 0 Input Register, Group 0 */
#define EVADC_G0_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020530u)

/** Alias (User Manual Name) for EVADC_G0_Q1_QINR.
* To use register names with standard convension, please use EVADC_G0_Q1_QINR.
*/
#define	EVADC_G0QINR1	(EVADC_G0_Q1_QINR)

/** \brief  524, Queue 0 Mode Register, Group 0 */
#define EVADC_G0_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020524u)

/** Alias (User Manual Name) for EVADC_G0_Q1_QMR.
* To use register names with standard convension, please use EVADC_G0_Q1_QMR.
*/
#define	EVADC_G0QMR1	(EVADC_G0_Q1_QMR)

/** \brief  528, Queue 0 Status Register, Group 0 */
#define EVADC_G0_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020528u)

/** Alias (User Manual Name) for EVADC_G0_Q1_QSR.
* To use register names with standard convension, please use EVADC_G0_Q1_QSR.
*/
#define	EVADC_G0QSR1	(EVADC_G0_Q1_QSR)

/** \brief  538, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G0_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020538u)

/** Alias (User Manual Name) for EVADC_G0_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G0_Q1_REQTM.
*/
#define	EVADC_G0REQTM1	(EVADC_G0_Q1_REQTM)

/** \brief  53C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G0_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002053Cu)

/** Alias (User Manual Name) for EVADC_G0_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G0_Q1_REQTS.
*/
#define	EVADC_G0REQTS1	(EVADC_G0_Q1_REQTS)

/** \brief  54C, Queue 0 Register 0, Group 0 */
#define EVADC_G0_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002054Cu)

/** Alias (User Manual Name) for EVADC_G0_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G0_Q2_Q0R.
*/
#define	EVADC_G0Q0R2	(EVADC_G0_Q2_Q0R)

/** \brief  540, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G0_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020540u)

/** Alias (User Manual Name) for EVADC_G0_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G0_Q2_QCTRL.
*/
#define	EVADC_G0QCTRL2	(EVADC_G0_Q2_QCTRL)

/** \brief  550, Queue 0 Input Register, Group 0 */
#define EVADC_G0_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020550u)

/** Alias (User Manual Name) for EVADC_G0_Q2_QINR.
* To use register names with standard convension, please use EVADC_G0_Q2_QINR.
*/
#define	EVADC_G0QINR2	(EVADC_G0_Q2_QINR)

/** \brief  544, Queue 0 Mode Register, Group 0 */
#define EVADC_G0_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020544u)

/** Alias (User Manual Name) for EVADC_G0_Q2_QMR.
* To use register names with standard convension, please use EVADC_G0_Q2_QMR.
*/
#define	EVADC_G0QMR2	(EVADC_G0_Q2_QMR)

/** \brief  548, Queue 0 Status Register, Group 0 */
#define EVADC_G0_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020548u)

/** Alias (User Manual Name) for EVADC_G0_Q2_QSR.
* To use register names with standard convension, please use EVADC_G0_Q2_QSR.
*/
#define	EVADC_G0QSR2	(EVADC_G0_Q2_QSR)

/** \brief  554, Queue 2 Status Register, Group 0 */
#define EVADC_G0_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0020554u)

/** Alias (User Manual Name) for EVADC_G0_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G0_Q0_QSR.
*/
#define	EVADC_G0TRCTR	(EVADC_G0_Q2_TRCTR)

/** \brief  558, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G0_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020558u)

/** Alias (User Manual Name) for EVADC_G0_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G0_Q2_REQTM.
*/
#define	EVADC_G0REQTM2	(EVADC_G0_Q2_REQTM)

/** \brief  55C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G0_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002055Cu)

/** Alias (User Manual Name) for EVADC_G0_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G0_Q2_REQTS.
*/
#define	EVADC_G0REQTS2	(EVADC_G0_Q2_REQTS)

/** \brief  680, Group Result Control Register */
#define EVADC_G0_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020680u)

/** Alias (User Manual Name) for EVADC_G0_RCR0.
* To use register names with standard convension, please use EVADC_G0_RCR0.
*/
#define	EVADC_G0RCR0	(EVADC_G0_RCR0)

/** \brief  684, Group Result Control Register */
#define EVADC_G0_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020684u)

