Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G0_RCR1.
* To use register names with standard convension, please use EVADC_G0_RCR1.
*/
#define	EVADC_G0RCR1	(EVADC_G0_RCR1)

/** \brief  6A8, Group Result Control Register */
#define EVADC_G0_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206A8u)

/** Alias (User Manual Name) for EVADC_G0_RCR10.
* To use register names with standard convension, please use EVADC_G0_RCR10.
*/
#define	EVADC_G0RCR10	(EVADC_G0_RCR10)

/** \brief  6AC, Group Result Control Register */
#define EVADC_G0_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206ACu)

/** Alias (User Manual Name) for EVADC_G0_RCR11.
* To use register names with standard convension, please use EVADC_G0_RCR11.
*/
#define	EVADC_G0RCR11	(EVADC_G0_RCR11)

/** \brief  6B0, Group Result Control Register */
#define EVADC_G0_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206B0u)

/** Alias (User Manual Name) for EVADC_G0_RCR12.
* To use register names with standard convension, please use EVADC_G0_RCR12.
*/
#define	EVADC_G0RCR12	(EVADC_G0_RCR12)

/** \brief  6B4, Group Result Control Register */
#define EVADC_G0_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206B4u)

/** Alias (User Manual Name) for EVADC_G0_RCR13.
* To use register names with standard convension, please use EVADC_G0_RCR13.
*/
#define	EVADC_G0RCR13	(EVADC_G0_RCR13)

/** \brief  6B8, Group Result Control Register */
#define EVADC_G0_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206B8u)

/** Alias (User Manual Name) for EVADC_G0_RCR14.
* To use register names with standard convension, please use EVADC_G0_RCR14.
*/
#define	EVADC_G0RCR14	(EVADC_G0_RCR14)

/** \brief  6BC, Group Result Control Register */
#define EVADC_G0_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206BCu)

/** Alias (User Manual Name) for EVADC_G0_RCR15.
* To use register names with standard convension, please use EVADC_G0_RCR15.
*/
#define	EVADC_G0RCR15	(EVADC_G0_RCR15)

/** \brief  688, Group Result Control Register */
#define EVADC_G0_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020688u)

/** Alias (User Manual Name) for EVADC_G0_RCR2.
* To use register names with standard convension, please use EVADC_G0_RCR2.
*/
#define	EVADC_G0RCR2	(EVADC_G0_RCR2)

/** \brief  68C, Group Result Control Register */
#define EVADC_G0_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002068Cu)

/** Alias (User Manual Name) for EVADC_G0_RCR3.
* To use register names with standard convension, please use EVADC_G0_RCR3.
*/
#define	EVADC_G0RCR3	(EVADC_G0_RCR3)

/** \brief  690, Group Result Control Register */
#define EVADC_G0_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020690u)

/** Alias (User Manual Name) for EVADC_G0_RCR4.
* To use register names with standard convension, please use EVADC_G0_RCR4.
*/
#define	EVADC_G0RCR4	(EVADC_G0_RCR4)

/** \brief  694, Group Result Control Register */
#define EVADC_G0_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020694u)

/** Alias (User Manual Name) for EVADC_G0_RCR5.
* To use register names with standard convension, please use EVADC_G0_RCR5.
*/
#define	EVADC_G0RCR5	(EVADC_G0_RCR5)

/** \brief  698, Group Result Control Register */
#define EVADC_G0_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020698u)

/** Alias (User Manual Name) for EVADC_G0_RCR6.
* To use register names with standard convension, please use EVADC_G0_RCR6.
*/
#define	EVADC_G0RCR6	(EVADC_G0_RCR6)

/** \brief  69C, Group Result Control Register */
#define EVADC_G0_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002069Cu)

/** Alias (User Manual Name) for EVADC_G0_RCR7.
* To use register names with standard convension, please use EVADC_G0_RCR7.
*/
#define	EVADC_G0RCR7	(EVADC_G0_RCR7)

/** \brief  6A0, Group Result Control Register */
#define EVADC_G0_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206A0u)

/** Alias (User Manual Name) for EVADC_G0_RCR8.
* To use register names with standard convension, please use EVADC_G0_RCR8.
*/
#define	EVADC_G0RCR8	(EVADC_G0_RCR8)

/** \brief  6A4, Group Result Control Register */
#define EVADC_G0_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00206A4u)

/** Alias (User Manual Name) for EVADC_G0_RCR9.
* To use register names with standard convension, please use EVADC_G0_RCR9.
*/
#define	EVADC_G0RCR9	(EVADC_G0_RCR9)

/** \brief  594, Result Event Flag Clear Register, Group */
#define EVADC_G0_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0020594u)

/** Alias (User Manual Name) for EVADC_G0_REFCLR.
* To use register names with standard convension, please use EVADC_G0_REFCLR.
*/
#define	EVADC_G0REFCLR	(EVADC_G0_REFCLR)

/** \brief  584, Result Event Flag Register, Group */
#define EVADC_G0_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0020584u)

/** Alias (User Manual Name) for EVADC_G0_REFLAG.
* To use register names with standard convension, please use EVADC_G0_REFLAG.
*/
#define	EVADC_G0REFLAG	(EVADC_G0_REFLAG)

/** \brief  700, Group Result Register */
#define EVADC_G0_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020700u)

/** Alias (User Manual Name) for EVADC_G0_RES0.
* To use register names with standard convension, please use EVADC_G0_RES0.
*/
#define	EVADC_G0RES0	(EVADC_G0_RES0)

/** \brief  704, Group Result Register */
#define EVADC_G0_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020704u)

/** Alias (User Manual Name) for EVADC_G0_RES1.
* To use register names with standard convension, please use EVADC_G0_RES1.
*/
#define	EVADC_G0RES1	(EVADC_G0_RES1)

/** \brief  728, Group Result Register */
#define EVADC_G0_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020728u)

/** Alias (User Manual Name) for EVADC_G0_RES10.
* To use register names with standard convension, please use EVADC_G0_RES10.
*/
#define	EVADC_G0RES10	(EVADC_G0_RES10)

/** \brief  72C, Group Result Register */
#define EVADC_G0_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002072Cu)

/** Alias (User Manual Name) for EVADC_G0_RES11.
* To use register names with standard convension, please use EVADC_G0_RES11.
*/
#define	EVADC_G0RES11	(EVADC_G0_RES11)

/** \brief  730, Group Result Register */
#define EVADC_G0_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020730u)

/** Alias (User Manual Name) for EVADC_G0_RES12.
* To use register names with standard convension, please use EVADC_G0_RES12.
*/
#define	EVADC_G0RES12	(EVADC_G0_RES12)

/** \brief  734, Group Result Register */
#define EVADC_G0_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020734u)

/** Alias (User Manual Name) for EVADC_G0_RES13.
* To use register names with standard convension, please use EVADC_G0_RES13.
*/
#define	EVADC_G0RES13	(EVADC_G0_RES13)

