Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  738, Group Result Register */
#define EVADC_G0_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020738u)

/** Alias (User Manual Name) for EVADC_G0_RES14.
* To use register names with standard convension, please use EVADC_G0_RES14.
*/
#define	EVADC_G0RES14	(EVADC_G0_RES14)

/** \brief  73C, Group Result Register */
#define EVADC_G0_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002073Cu)

/** Alias (User Manual Name) for EVADC_G0_RES15.
* To use register names with standard convension, please use EVADC_G0_RES15.
*/
#define	EVADC_G0RES15	(EVADC_G0_RES15)

/** \brief  708, Group Result Register */
#define EVADC_G0_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020708u)

/** Alias (User Manual Name) for EVADC_G0_RES2.
* To use register names with standard convension, please use EVADC_G0_RES2.
*/
#define	EVADC_G0RES2	(EVADC_G0_RES2)

/** \brief  70C, Group Result Register */
#define EVADC_G0_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002070Cu)

/** Alias (User Manual Name) for EVADC_G0_RES3.
* To use register names with standard convension, please use EVADC_G0_RES3.
*/
#define	EVADC_G0RES3	(EVADC_G0_RES3)

/** \brief  710, Group Result Register */
#define EVADC_G0_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020710u)

/** Alias (User Manual Name) for EVADC_G0_RES4.
* To use register names with standard convension, please use EVADC_G0_RES4.
*/
#define	EVADC_G0RES4	(EVADC_G0_RES4)

/** \brief  714, Group Result Register */
#define EVADC_G0_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020714u)

/** Alias (User Manual Name) for EVADC_G0_RES5.
* To use register names with standard convension, please use EVADC_G0_RES5.
*/
#define	EVADC_G0RES5	(EVADC_G0_RES5)

/** \brief  718, Group Result Register */
#define EVADC_G0_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020718u)

/** Alias (User Manual Name) for EVADC_G0_RES6.
* To use register names with standard convension, please use EVADC_G0_RES6.
*/
#define	EVADC_G0RES6	(EVADC_G0_RES6)

/** \brief  71C, Group Result Register */
#define EVADC_G0_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002071Cu)

/** Alias (User Manual Name) for EVADC_G0_RES7.
* To use register names with standard convension, please use EVADC_G0_RES7.
*/
#define	EVADC_G0RES7	(EVADC_G0_RES7)

/** \brief  720, Group Result Register */
#define EVADC_G0_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020720u)

/** Alias (User Manual Name) for EVADC_G0_RES8.
* To use register names with standard convension, please use EVADC_G0_RES8.
*/
#define	EVADC_G0RES8	(EVADC_G0_RES8)

/** \brief  724, Group Result Register */
#define EVADC_G0_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020724u)

/** Alias (User Manual Name) for EVADC_G0_RES9.
* To use register names with standard convension, please use EVADC_G0_RES9.
*/
#define	EVADC_G0RES9	(EVADC_G0_RES9)

/** \brief  780, Group Result Reg., Debug */
#define EVADC_G0_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020780u)

/** Alias (User Manual Name) for EVADC_G0_RESD0.
* To use register names with standard convension, please use EVADC_G0_RESD0.
*/
#define	EVADC_G0RESD0	(EVADC_G0_RESD0)

/** \brief  784, Group Result Reg., Debug */
#define EVADC_G0_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020784u)

/** Alias (User Manual Name) for EVADC_G0_RESD1.
* To use register names with standard convension, please use EVADC_G0_RESD1.
*/
#define	EVADC_G0RESD1	(EVADC_G0_RESD1)

/** \brief  7A8, Group Result Reg., Debug */
#define EVADC_G0_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207A8u)

/** Alias (User Manual Name) for EVADC_G0_RESD10.
* To use register names with standard convension, please use EVADC_G0_RESD10.
*/
#define	EVADC_G0RESD10	(EVADC_G0_RESD10)

/** \brief  7AC, Group Result Reg., Debug */
#define EVADC_G0_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207ACu)

/** Alias (User Manual Name) for EVADC_G0_RESD11.
* To use register names with standard convension, please use EVADC_G0_RESD11.
*/
#define	EVADC_G0RESD11	(EVADC_G0_RESD11)

/** \brief  7B0, Group Result Reg., Debug */
#define EVADC_G0_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207B0u)

/** Alias (User Manual Name) for EVADC_G0_RESD12.
* To use register names with standard convension, please use EVADC_G0_RESD12.
*/
#define	EVADC_G0RESD12	(EVADC_G0_RESD12)

/** \brief  7B4, Group Result Reg., Debug */
#define EVADC_G0_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207B4u)

/** Alias (User Manual Name) for EVADC_G0_RESD13.
* To use register names with standard convension, please use EVADC_G0_RESD13.
*/
#define	EVADC_G0RESD13	(EVADC_G0_RESD13)

/** \brief  7B8, Group Result Reg., Debug */
#define EVADC_G0_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207B8u)

/** Alias (User Manual Name) for EVADC_G0_RESD14.
* To use register names with standard convension, please use EVADC_G0_RESD14.
*/
#define	EVADC_G0RESD14	(EVADC_G0_RESD14)

/** \brief  7BC, Group Result Reg., Debug */
#define EVADC_G0_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207BCu)

/** Alias (User Manual Name) for EVADC_G0_RESD15.
* To use register names with standard convension, please use EVADC_G0_RESD15.
*/
#define	EVADC_G0RESD15	(EVADC_G0_RESD15)

/** \brief  788, Group Result Reg., Debug */
#define EVADC_G0_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020788u)

/** Alias (User Manual Name) for EVADC_G0_RESD2.
* To use register names with standard convension, please use EVADC_G0_RESD2.
*/
#define	EVADC_G0RESD2	(EVADC_G0_RESD2)

/** \brief  78C, Group Result Reg., Debug */
#define EVADC_G0_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002078Cu)

/** Alias (User Manual Name) for EVADC_G0_RESD3.
* To use register names with standard convension, please use EVADC_G0_RESD3.
*/
#define	EVADC_G0RESD3	(EVADC_G0_RESD3)

/** \brief  790, Group Result Reg., Debug */
#define EVADC_G0_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020790u)

/** Alias (User Manual Name) for EVADC_G0_RESD4.
* To use register names with standard convension, please use EVADC_G0_RESD4.
*/
#define	EVADC_G0RESD4	(EVADC_G0_RESD4)

/** \brief  794, Group Result Reg., Debug */
#define EVADC_G0_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020794u)

/** Alias (User Manual Name) for EVADC_G0_RESD5.
* To use register names with standard convension, please use EVADC_G0_RESD5.
*/
#define	EVADC_G0RESD5	(EVADC_G0_RESD5)

/** \brief  798, Group Result Reg., Debug */
#define EVADC_G0_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020798u)

/** Alias (User Manual Name) for EVADC_G0_RESD6.
* To use register names with standard convension, please use EVADC_G0_RESD6.
*/
#define	EVADC_G0RESD6	(EVADC_G0_RESD6)

/** \brief  79C, Group Result Reg., Debug */
#define EVADC_G0_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002079Cu)

