Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G0_RESD7.
* To use register names with standard convension, please use EVADC_G0_RESD7.
*/
#define	EVADC_G0RESD7	(EVADC_G0_RESD7)

/** \brief  7A0, Group Result Reg., Debug */
#define EVADC_G0_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207A0u)

/** Alias (User Manual Name) for EVADC_G0_RESD8.
* To use register names with standard convension, please use EVADC_G0_RESD8.
*/
#define	EVADC_G0RESD8	(EVADC_G0_RESD8)

/** \brief  7A4, Group Result Reg., Debug */
#define EVADC_G0_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00207A4u)

/** Alias (User Manual Name) for EVADC_G0_RESD9.
* To use register names with standard convension, please use EVADC_G0_RESD9.
*/
#define	EVADC_G0RESD9	(EVADC_G0_RESD9)

/** \brief  5B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G0_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00205B0u)

/** Alias (User Manual Name) for EVADC_G0_REVNP0.
* To use register names with standard convension, please use EVADC_G0_REVNP0.
*/
#define	EVADC_G0REVNP0	(EVADC_G0_REVNP0)

/** \brief  5B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G0_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00205B4u)

/** Alias (User Manual Name) for EVADC_G0_REVNP1.
* To use register names with standard convension, please use EVADC_G0_REVNP1.
*/
#define	EVADC_G0REVNP1	(EVADC_G0_REVNP1)

/** \brief  598, Source Event Flag Clear Reg., Group */
#define EVADC_G0_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0020598u)

/** Alias (User Manual Name) for EVADC_G0_SEFCLR.
* To use register names with standard convension, please use EVADC_G0_SEFCLR.
*/
#define	EVADC_G0SEFCLR	(EVADC_G0_SEFCLR)

/** \brief  588, Source Event Flag Register, Group */
#define EVADC_G0_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0020588u)

/** Alias (User Manual Name) for EVADC_G0_SEFLAG.
* To use register names with standard convension, please use EVADC_G0_SEFLAG.
*/
#define	EVADC_G0SEFLAG	(EVADC_G0_SEFLAG)

/** \brief  5C0, Source Event Node Pointer Reg., Group */
#define EVADC_G0_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00205C0u)

/** Alias (User Manual Name) for EVADC_G0_SEVNP.
* To use register names with standard convension, please use EVADC_G0_SEVNP.
*/
#define	EVADC_G0SEVNP	(EVADC_G0_SEVNP)

/** \brief  5C8, Service Request Software Activation Trigger, Group */
#define EVADC_G0_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00205C8u)

/** Alias (User Manual Name) for EVADC_G0_SRACT.
* To use register names with standard convension, please use EVADC_G0_SRACT.
*/
#define	EVADC_G0SRACT	(EVADC_G0_SRACT)

/** \brief  4C0, Synchronization Control Register, Group */
#define EVADC_G0_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00204C0u)

/** Alias (User Manual Name) for EVADC_G0_SYNCTR.
* To use register names with standard convension, please use EVADC_G0_SYNCTR.
*/
#define	EVADC_G0SYNCTR	(EVADC_G0_SYNCTR)

/** \brief  5F8, Valid Flag Register, Group */
#define EVADC_G0_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00205F8u)

/** Alias (User Manual Name) for EVADC_G0_VFR.
* To use register names with standard convension, please use EVADC_G0_VFR.
*/
#define	EVADC_G0VFR	(EVADC_G0_VFR)

/** \brief  2CB0, Alias Register, Group */
#define EVADC_G10_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF0022CB0u)

/** Alias (User Manual Name) for EVADC_G10_ALIAS.
* To use register names with standard convension, please use EVADC_G10_ALIAS.
*/
#define	EVADC_G10ALIAS	(EVADC_G10_ALIAS)

/** \brief  2C88, Analog Fct. Config. Register, Group */
#define EVADC_G10_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0022C88u)

/** Alias (User Manual Name) for EVADC_G10_ANCFG.
* To use register names with standard convension, please use EVADC_G10_ANCFG.
*/
#define	EVADC_G10ANCFG	(EVADC_G10_ANCFG)

/** \brief  2C80, Arbitration Config. Register, Group */
#define EVADC_G10_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0022C80u)

/** Alias (User Manual Name) for EVADC_G10_ARBCFG.
* To use register names with standard convension, please use EVADC_G10_ARBCFG.
*/
#define	EVADC_G10ARBCFG	(EVADC_G10_ARBCFG)

/** \brief  2C84, Arbitration Priority Register, Group */
#define EVADC_G10_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0022C84u)

/** Alias (User Manual Name) for EVADC_G10_ARBPR.
* To use register names with standard convension, please use EVADC_G10_ARBPR.
*/
#define	EVADC_G10ARBPR	(EVADC_G10_ARBPR)

/** \brief  2CB8, Boundary Select Register, Group */
#define EVADC_G10_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF0022CB8u)

/** Alias (User Manual Name) for EVADC_G10_BOUND.
* To use register names with standard convension, please use EVADC_G10_BOUND.
*/
#define	EVADC_G10BOUND	(EVADC_G10_BOUND)

/** \brief  2D90, Channel Event Flag Clear Register, Group */
#define EVADC_G10_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0022D90u)

/** Alias (User Manual Name) for EVADC_G10_CEFCLR.
* To use register names with standard convension, please use EVADC_G10_CEFCLR.
*/
#define	EVADC_G10CEFCLR	(EVADC_G10_CEFCLR)

/** \brief  2D80, Channel Event Flag Register, Group */
#define EVADC_G10_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0022D80u)

/** Alias (User Manual Name) for EVADC_G10_CEFLAG.
* To use register names with standard convension, please use EVADC_G10_CEFLAG.
*/
#define	EVADC_G10CEFLAG	(EVADC_G10_CEFLAG)

/** \brief  2DA0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G10_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF0022DA0u)

/** Alias (User Manual Name) for EVADC_G10_CEVNP0.
* To use register names with standard convension, please use EVADC_G10_CEVNP0.
*/
#define	EVADC_G10CEVNP0	(EVADC_G10_CEVNP0)

/** \brief  2E00, Group, Channel Control Register */
#define EVADC_G10_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E00u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR0.
* To use register names with standard convension, please use EVADC_G10_CHCTR0.
*/
#define	EVADC_G10CHCTR0	(EVADC_G10_CHCTR0)

/** \brief  2E04, Group, Channel Control Register */
#define EVADC_G10_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E04u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR1.
* To use register names with standard convension, please use EVADC_G10_CHCTR1.
*/
#define	EVADC_G10CHCTR1	(EVADC_G10_CHCTR1)

/** \brief  2E28, Group, Channel Control Register */
#define EVADC_G10_CHCTR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E28u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR10.
* To use register names with standard convension, please use EVADC_G10_CHCTR10.
*/
#define	EVADC_G10CHCTR10	(EVADC_G10_CHCTR10)

/** \brief  2E2C, Group, Channel Control Register */
#define EVADC_G10_CHCTR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E2Cu)

/** Alias (User Manual Name) for EVADC_G10_CHCTR11.
* To use register names with standard convension, please use EVADC_G10_CHCTR11.
*/
#define	EVADC_G10CHCTR11	(EVADC_G10_CHCTR11)

/** \brief  2E30, Group, Channel Control Register */
#define EVADC_G10_CHCTR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E30u)

