Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G10_CHCTR12.
* To use register names with standard convension, please use EVADC_G10_CHCTR12.
*/
#define	EVADC_G10CHCTR12	(EVADC_G10_CHCTR12)

/** \brief  2E34, Group, Channel Control Register */
#define EVADC_G10_CHCTR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E34u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR13.
* To use register names with standard convension, please use EVADC_G10_CHCTR13.
*/
#define	EVADC_G10CHCTR13	(EVADC_G10_CHCTR13)

/** \brief  2E38, Group, Channel Control Register */
#define EVADC_G10_CHCTR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E38u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR14.
* To use register names with standard convension, please use EVADC_G10_CHCTR14.
*/
#define	EVADC_G10CHCTR14	(EVADC_G10_CHCTR14)

/** \brief  2E3C, Group, Channel Control Register */
#define EVADC_G10_CHCTR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E3Cu)

/** Alias (User Manual Name) for EVADC_G10_CHCTR15.
* To use register names with standard convension, please use EVADC_G10_CHCTR15.
*/
#define	EVADC_G10CHCTR15	(EVADC_G10_CHCTR15)

/** \brief  2E08, Group, Channel Control Register */
#define EVADC_G10_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E08u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR2.
* To use register names with standard convension, please use EVADC_G10_CHCTR2.
*/
#define	EVADC_G10CHCTR2	(EVADC_G10_CHCTR2)

/** \brief  2E0C, Group, Channel Control Register */
#define EVADC_G10_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E0Cu)

/** Alias (User Manual Name) for EVADC_G10_CHCTR3.
* To use register names with standard convension, please use EVADC_G10_CHCTR3.
*/
#define	EVADC_G10CHCTR3	(EVADC_G10_CHCTR3)

/** \brief  2E10, Group, Channel Control Register */
#define EVADC_G10_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E10u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR4.
* To use register names with standard convension, please use EVADC_G10_CHCTR4.
*/
#define	EVADC_G10CHCTR4	(EVADC_G10_CHCTR4)

/** \brief  2E14, Group, Channel Control Register */
#define EVADC_G10_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E14u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR5.
* To use register names with standard convension, please use EVADC_G10_CHCTR5.
*/
#define	EVADC_G10CHCTR5	(EVADC_G10_CHCTR5)

/** \brief  2E18, Group, Channel Control Register */
#define EVADC_G10_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E18u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR6.
* To use register names with standard convension, please use EVADC_G10_CHCTR6.
*/
#define	EVADC_G10CHCTR6	(EVADC_G10_CHCTR6)

/** \brief  2E1C, Group, Channel Control Register */
#define EVADC_G10_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E1Cu)

/** Alias (User Manual Name) for EVADC_G10_CHCTR7.
* To use register names with standard convension, please use EVADC_G10_CHCTR7.
*/
#define	EVADC_G10CHCTR7	(EVADC_G10_CHCTR7)

/** \brief  2E20, Group, Channel Control Register */
#define EVADC_G10_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E20u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR8.
* To use register names with standard convension, please use EVADC_G10_CHCTR8.
*/
#define	EVADC_G10CHCTR8	(EVADC_G10_CHCTR8)

/** \brief  2E24, Group, Channel Control Register */
#define EVADC_G10_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022E24u)

/** Alias (User Manual Name) for EVADC_G10_CHCTR9.
* To use register names with standard convension, please use EVADC_G10_CHCTR9.
*/
#define	EVADC_G10CHCTR9	(EVADC_G10_CHCTR9)

/** \brief  2DF4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G10_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF0022DF4u)

/** Alias (User Manual Name) for EVADC_G10_EMUXCS.
* To use register names with standard convension, please use EVADC_G10_EMUXCS.
*/
#define	EVADC_G10EMUXCS	(EVADC_G10_EMUXCS)

/** \brief  2DF0, External Multiplexer Control Reg., Group */
#define EVADC_G10_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF0022DF0u)

/** Alias (User Manual Name) for EVADC_G10_EMUXCTR.
* To use register names with standard convension, please use EVADC_G10_EMUXCTR.
*/
#define	EVADC_G10EMUXCTR	(EVADC_G10_EMUXCTR)

/** \brief  2CA0, Input Class Reg0ster i, Group */
#define EVADC_G10_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0022CA0u)

/** Alias (User Manual Name) for EVADC_G10_ICLASS0.
* To use register names with standard convension, please use EVADC_G10_ICLASS0.
*/
#define	EVADC_G10ICLASS0	(EVADC_G10_ICLASS0)

/** \brief  2CA4, Input Class Reg0ster i, Group */
#define EVADC_G10_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0022CA4u)

/** Alias (User Manual Name) for EVADC_G10_ICLASS1.
* To use register names with standard convension, please use EVADC_G10_ICLASS1.
*/
#define	EVADC_G10ICLASS1	(EVADC_G10_ICLASS1)

/** \brief  2D0C, Queue 0 Register 0, Group 0 */
#define EVADC_G10_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0022D0Cu)

/** Alias (User Manual Name) for EVADC_G10_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G10_Q0_Q0R.
*/
#define	EVADC_G10Q0R0	(EVADC_G10_Q0_Q0R)

/** \brief  2D00, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G10_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022D00u)

/** Alias (User Manual Name) for EVADC_G10_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G10_Q0_QCTRL.
*/
#define	EVADC_G10QCTRL0	(EVADC_G10_Q0_QCTRL)

/** \brief  2D10, Queue 0 Input Register, Group 0 */
#define EVADC_G10_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022D10u)

/** Alias (User Manual Name) for EVADC_G10_Q0_QINR.
* To use register names with standard convension, please use EVADC_G10_Q0_QINR.
*/
#define	EVADC_G10QINR0	(EVADC_G10_Q0_QINR)

/** \brief  2D04, Queue 0 Mode Register, Group 0 */
#define EVADC_G10_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022D04u)

/** Alias (User Manual Name) for EVADC_G10_Q0_QMR.
* To use register names with standard convension, please use EVADC_G10_Q0_QMR.
*/
#define	EVADC_G10QMR0	(EVADC_G10_Q0_QMR)

