Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  2D08, Queue 0 Status Register, Group 0 */
#define EVADC_G10_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022D08u)

/** Alias (User Manual Name) for EVADC_G10_Q0_QSR.
* To use register names with standard convension, please use EVADC_G10_Q0_QSR.
*/
#define	EVADC_G10QSR0	(EVADC_G10_Q0_QSR)

/** \brief  2D18, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G10_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022D18u)

/** Alias (User Manual Name) for EVADC_G10_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G10_Q0_REQTM.
*/
#define	EVADC_G10REQTM0	(EVADC_G10_Q0_REQTM)

/** \brief  2D1C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G10_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0022D1Cu)

/** Alias (User Manual Name) for EVADC_G10_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G10_Q0_REQTS.
*/
#define	EVADC_G10REQTS0	(EVADC_G10_Q0_REQTS)

/** \brief  2D2C, Queue 0 Register 0, Group 0 */
#define EVADC_G10_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0022D2Cu)

/** Alias (User Manual Name) for EVADC_G10_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G10_Q1_Q0R.
*/
#define	EVADC_G10Q0R1	(EVADC_G10_Q1_Q0R)

/** \brief  2D20, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G10_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022D20u)

/** Alias (User Manual Name) for EVADC_G10_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G10_Q1_QCTRL.
*/
#define	EVADC_G10QCTRL1	(EVADC_G10_Q1_QCTRL)

/** \brief  2D30, Queue 0 Input Register, Group 0 */
#define EVADC_G10_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022D30u)

/** Alias (User Manual Name) for EVADC_G10_Q1_QINR.
* To use register names with standard convension, please use EVADC_G10_Q1_QINR.
*/
#define	EVADC_G10QINR1	(EVADC_G10_Q1_QINR)

/** \brief  2D24, Queue 0 Mode Register, Group 0 */
#define EVADC_G10_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022D24u)

/** Alias (User Manual Name) for EVADC_G10_Q1_QMR.
* To use register names with standard convension, please use EVADC_G10_Q1_QMR.
*/
#define	EVADC_G10QMR1	(EVADC_G10_Q1_QMR)

/** \brief  2D28, Queue 0 Status Register, Group 0 */
#define EVADC_G10_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022D28u)

/** Alias (User Manual Name) for EVADC_G10_Q1_QSR.
* To use register names with standard convension, please use EVADC_G10_Q1_QSR.
*/
#define	EVADC_G10QSR1	(EVADC_G10_Q1_QSR)

/** \brief  2D38, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G10_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022D38u)

/** Alias (User Manual Name) for EVADC_G10_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G10_Q1_REQTM.
*/
#define	EVADC_G10REQTM1	(EVADC_G10_Q1_REQTM)

/** \brief  2D3C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G10_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0022D3Cu)

/** Alias (User Manual Name) for EVADC_G10_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G10_Q1_REQTS.
*/
#define	EVADC_G10REQTS1	(EVADC_G10_Q1_REQTS)

/** \brief  2D4C, Queue 0 Register 0, Group 0 */
#define EVADC_G10_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0022D4Cu)

/** Alias (User Manual Name) for EVADC_G10_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G10_Q2_Q0R.
*/
#define	EVADC_G10Q0R2	(EVADC_G10_Q2_Q0R)

/** \brief  2D40, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G10_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022D40u)

/** Alias (User Manual Name) for EVADC_G10_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G10_Q2_QCTRL.
*/
#define	EVADC_G10QCTRL2	(EVADC_G10_Q2_QCTRL)

/** \brief  2D50, Queue 0 Input Register, Group 0 */
#define EVADC_G10_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022D50u)

/** Alias (User Manual Name) for EVADC_G10_Q2_QINR.
* To use register names with standard convension, please use EVADC_G10_Q2_QINR.
*/
#define	EVADC_G10QINR2	(EVADC_G10_Q2_QINR)

/** \brief  2D44, Queue 0 Mode Register, Group 0 */
#define EVADC_G10_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022D44u)

/** Alias (User Manual Name) for EVADC_G10_Q2_QMR.
* To use register names with standard convension, please use EVADC_G10_Q2_QMR.
*/
#define	EVADC_G10QMR2	(EVADC_G10_Q2_QMR)

/** \brief  2D48, Queue 0 Status Register, Group 0 */
#define EVADC_G10_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022D48u)

/** Alias (User Manual Name) for EVADC_G10_Q2_QSR.
* To use register names with standard convension, please use EVADC_G10_Q2_QSR.
*/
#define	EVADC_G10QSR2	(EVADC_G10_Q2_QSR)

/** \brief  2D54, Queue 2 Status Register, Group 10 */
#define EVADC_G10_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0022D54u)

/** Alias (User Manual Name) for EVADC_G10_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G10_Q2_TRCTR.
*/
#define	EVADC_G10TRCTR	(EVADC_G10_Q2_TRCTR)

/** \brief  2D58, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G10_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022D58u)

/** Alias (User Manual Name) for EVADC_G10_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G10_Q2_REQTM.
*/
#define	EVADC_G10REQTM2	(EVADC_G10_Q2_REQTM)

/** \brief  2D5C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G10_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0022D5Cu)

/** Alias (User Manual Name) for EVADC_G10_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G10_Q2_REQTS.
*/
#define	EVADC_G10REQTS2	(EVADC_G10_Q2_REQTS)

/** \brief  2E80, Group Result Control Register */
#define EVADC_G10_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E80u)

