Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G10_RCR0.
* To use register names with standard convension, please use EVADC_G10_RCR0.
*/
#define	EVADC_G10RCR0	(EVADC_G10_RCR0)

/** \brief  2E84, Group Result Control Register */
#define EVADC_G10_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E84u)

/** Alias (User Manual Name) for EVADC_G10_RCR1.
* To use register names with standard convension, please use EVADC_G10_RCR1.
*/
#define	EVADC_G10RCR1	(EVADC_G10_RCR1)

/** \brief  2EA8, Group Result Control Register */
#define EVADC_G10_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EA8u)

/** Alias (User Manual Name) for EVADC_G10_RCR10.
* To use register names with standard convension, please use EVADC_G10_RCR10.
*/
#define	EVADC_G10RCR10	(EVADC_G10_RCR10)

/** \brief  2EAC, Group Result Control Register */
#define EVADC_G10_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EACu)

/** Alias (User Manual Name) for EVADC_G10_RCR11.
* To use register names with standard convension, please use EVADC_G10_RCR11.
*/
#define	EVADC_G10RCR11	(EVADC_G10_RCR11)

/** \brief  2EB0, Group Result Control Register */
#define EVADC_G10_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EB0u)

/** Alias (User Manual Name) for EVADC_G10_RCR12.
* To use register names with standard convension, please use EVADC_G10_RCR12.
*/
#define	EVADC_G10RCR12	(EVADC_G10_RCR12)

/** \brief  2EB4, Group Result Control Register */
#define EVADC_G10_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EB4u)

/** Alias (User Manual Name) for EVADC_G10_RCR13.
* To use register names with standard convension, please use EVADC_G10_RCR13.
*/
#define	EVADC_G10RCR13	(EVADC_G10_RCR13)

/** \brief  2EB8, Group Result Control Register */
#define EVADC_G10_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EB8u)

/** Alias (User Manual Name) for EVADC_G10_RCR14.
* To use register names with standard convension, please use EVADC_G10_RCR14.
*/
#define	EVADC_G10RCR14	(EVADC_G10_RCR14)

/** \brief  2EBC, Group Result Control Register */
#define EVADC_G10_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EBCu)

/** Alias (User Manual Name) for EVADC_G10_RCR15.
* To use register names with standard convension, please use EVADC_G10_RCR15.
*/
#define	EVADC_G10RCR15	(EVADC_G10_RCR15)

/** \brief  2E88, Group Result Control Register */
#define EVADC_G10_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E88u)

/** Alias (User Manual Name) for EVADC_G10_RCR2.
* To use register names with standard convension, please use EVADC_G10_RCR2.
*/
#define	EVADC_G10RCR2	(EVADC_G10_RCR2)

/** \brief  2E8C, Group Result Control Register */
#define EVADC_G10_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E8Cu)

/** Alias (User Manual Name) for EVADC_G10_RCR3.
* To use register names with standard convension, please use EVADC_G10_RCR3.
*/
#define	EVADC_G10RCR3	(EVADC_G10_RCR3)

/** \brief  2E90, Group Result Control Register */
#define EVADC_G10_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E90u)

/** Alias (User Manual Name) for EVADC_G10_RCR4.
* To use register names with standard convension, please use EVADC_G10_RCR4.
*/
#define	EVADC_G10RCR4	(EVADC_G10_RCR4)

/** \brief  2E94, Group Result Control Register */
#define EVADC_G10_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E94u)

/** Alias (User Manual Name) for EVADC_G10_RCR5.
* To use register names with standard convension, please use EVADC_G10_RCR5.
*/
#define	EVADC_G10RCR5	(EVADC_G10_RCR5)

/** \brief  2E98, Group Result Control Register */
#define EVADC_G10_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E98u)

/** Alias (User Manual Name) for EVADC_G10_RCR6.
* To use register names with standard convension, please use EVADC_G10_RCR6.
*/
#define	EVADC_G10RCR6	(EVADC_G10_RCR6)

/** \brief  2E9C, Group Result Control Register */
#define EVADC_G10_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022E9Cu)

/** Alias (User Manual Name) for EVADC_G10_RCR7.
* To use register names with standard convension, please use EVADC_G10_RCR7.
*/
#define	EVADC_G10RCR7	(EVADC_G10_RCR7)

/** \brief  2EA0, Group Result Control Register */
#define EVADC_G10_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EA0u)

/** Alias (User Manual Name) for EVADC_G10_RCR8.
* To use register names with standard convension, please use EVADC_G10_RCR8.
*/
#define	EVADC_G10RCR8	(EVADC_G10_RCR8)

/** \brief  2EA4, Group Result Control Register */
#define EVADC_G10_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022EA4u)

/** Alias (User Manual Name) for EVADC_G10_RCR9.
* To use register names with standard convension, please use EVADC_G10_RCR9.
*/
#define	EVADC_G10RCR9	(EVADC_G10_RCR9)

/** \brief  2D94, Result Event Flag Clear Register, Group */
#define EVADC_G10_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0022D94u)

/** Alias (User Manual Name) for EVADC_G10_REFCLR.
* To use register names with standard convension, please use EVADC_G10_REFCLR.
*/
#define	EVADC_G10REFCLR	(EVADC_G10_REFCLR)

/** \brief  2D84, Result Event Flag Register, Group */
#define EVADC_G10_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0022D84u)

/** Alias (User Manual Name) for EVADC_G10_REFLAG.
* To use register names with standard convension, please use EVADC_G10_REFLAG.
*/
#define	EVADC_G10REFLAG	(EVADC_G10_REFLAG)

/** \brief  2F00, Group Result Register */
#define EVADC_G10_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F00u)

/** Alias (User Manual Name) for EVADC_G10_RES0.
* To use register names with standard convension, please use EVADC_G10_RES0.
*/
#define	EVADC_G10RES0	(EVADC_G10_RES0)

/** \brief  2F04, Group Result Register */
#define EVADC_G10_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F04u)

/** Alias (User Manual Name) for EVADC_G10_RES1.
* To use register names with standard convension, please use EVADC_G10_RES1.
*/
#define	EVADC_G10RES1	(EVADC_G10_RES1)

/** \brief  2F28, Group Result Register */
#define EVADC_G10_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F28u)

/** Alias (User Manual Name) for EVADC_G10_RES10.
* To use register names with standard convension, please use EVADC_G10_RES10.
*/
#define	EVADC_G10RES10	(EVADC_G10_RES10)

