Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  2F2C, Group Result Register */
#define EVADC_G10_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F2Cu)

/** Alias (User Manual Name) for EVADC_G10_RES11.
* To use register names with standard convension, please use EVADC_G10_RES11.
*/
#define	EVADC_G10RES11	(EVADC_G10_RES11)

/** \brief  2F30, Group Result Register */
#define EVADC_G10_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F30u)

/** Alias (User Manual Name) for EVADC_G10_RES12.
* To use register names with standard convension, please use EVADC_G10_RES12.
*/
#define	EVADC_G10RES12	(EVADC_G10_RES12)

/** \brief  2F34, Group Result Register */
#define EVADC_G10_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F34u)

/** Alias (User Manual Name) for EVADC_G10_RES13.
* To use register names with standard convension, please use EVADC_G10_RES13.
*/
#define	EVADC_G10RES13	(EVADC_G10_RES13)

/** \brief  2F38, Group Result Register */
#define EVADC_G10_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F38u)

/** Alias (User Manual Name) for EVADC_G10_RES14.
* To use register names with standard convension, please use EVADC_G10_RES14.
*/
#define	EVADC_G10RES14	(EVADC_G10_RES14)

/** \brief  2F3C, Group Result Register */
#define EVADC_G10_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F3Cu)

/** Alias (User Manual Name) for EVADC_G10_RES15.
* To use register names with standard convension, please use EVADC_G10_RES15.
*/
#define	EVADC_G10RES15	(EVADC_G10_RES15)

/** \brief  2F08, Group Result Register */
#define EVADC_G10_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F08u)

/** Alias (User Manual Name) for EVADC_G10_RES2.
* To use register names with standard convension, please use EVADC_G10_RES2.
*/
#define	EVADC_G10RES2	(EVADC_G10_RES2)

/** \brief  2F0C, Group Result Register */
#define EVADC_G10_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F0Cu)

/** Alias (User Manual Name) for EVADC_G10_RES3.
* To use register names with standard convension, please use EVADC_G10_RES3.
*/
#define	EVADC_G10RES3	(EVADC_G10_RES3)

/** \brief  2F10, Group Result Register */
#define EVADC_G10_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F10u)

/** Alias (User Manual Name) for EVADC_G10_RES4.
* To use register names with standard convension, please use EVADC_G10_RES4.
*/
#define	EVADC_G10RES4	(EVADC_G10_RES4)

/** \brief  2F14, Group Result Register */
#define EVADC_G10_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F14u)

/** Alias (User Manual Name) for EVADC_G10_RES5.
* To use register names with standard convension, please use EVADC_G10_RES5.
*/
#define	EVADC_G10RES5	(EVADC_G10_RES5)

/** \brief  2F18, Group Result Register */
#define EVADC_G10_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F18u)

/** Alias (User Manual Name) for EVADC_G10_RES6.
* To use register names with standard convension, please use EVADC_G10_RES6.
*/
#define	EVADC_G10RES6	(EVADC_G10_RES6)

/** \brief  2F1C, Group Result Register */
#define EVADC_G10_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F1Cu)

/** Alias (User Manual Name) for EVADC_G10_RES7.
* To use register names with standard convension, please use EVADC_G10_RES7.
*/
#define	EVADC_G10RES7	(EVADC_G10_RES7)

/** \brief  2F20, Group Result Register */
#define EVADC_G10_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F20u)

/** Alias (User Manual Name) for EVADC_G10_RES8.
* To use register names with standard convension, please use EVADC_G10_RES8.
*/
#define	EVADC_G10RES8	(EVADC_G10_RES8)

/** \brief  2F24, Group Result Register */
#define EVADC_G10_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022F24u)

/** Alias (User Manual Name) for EVADC_G10_RES9.
* To use register names with standard convension, please use EVADC_G10_RES9.
*/
#define	EVADC_G10RES9	(EVADC_G10_RES9)

/** \brief  2F80, Group Result Reg., Debug */
#define EVADC_G10_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F80u)

/** Alias (User Manual Name) for EVADC_G10_RESD0.
* To use register names with standard convension, please use EVADC_G10_RESD0.
*/
#define	EVADC_G10RESD0	(EVADC_G10_RESD0)

/** \brief  2F84, Group Result Reg., Debug */
#define EVADC_G10_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F84u)

/** Alias (User Manual Name) for EVADC_G10_RESD1.
* To use register names with standard convension, please use EVADC_G10_RESD1.
*/
#define	EVADC_G10RESD1	(EVADC_G10_RESD1)

/** \brief  2FA8, Group Result Reg., Debug */
#define EVADC_G10_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FA8u)

/** Alias (User Manual Name) for EVADC_G10_RESD10.
* To use register names with standard convension, please use EVADC_G10_RESD10.
*/
#define	EVADC_G10RESD10	(EVADC_G10_RESD10)

/** \brief  2FAC, Group Result Reg., Debug */
#define EVADC_G10_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FACu)

/** Alias (User Manual Name) for EVADC_G10_RESD11.
* To use register names with standard convension, please use EVADC_G10_RESD11.
*/
#define	EVADC_G10RESD11	(EVADC_G10_RESD11)

/** \brief  2FB0, Group Result Reg., Debug */
#define EVADC_G10_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FB0u)

/** Alias (User Manual Name) for EVADC_G10_RESD12.
* To use register names with standard convension, please use EVADC_G10_RESD12.
*/
#define	EVADC_G10RESD12	(EVADC_G10_RESD12)

/** \brief  2FB4, Group Result Reg., Debug */
#define EVADC_G10_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FB4u)

/** Alias (User Manual Name) for EVADC_G10_RESD13.
* To use register names with standard convension, please use EVADC_G10_RESD13.
*/
#define	EVADC_G10RESD13	(EVADC_G10_RESD13)

/** \brief  2FB8, Group Result Reg., Debug */
#define EVADC_G10_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FB8u)

/** Alias (User Manual Name) for EVADC_G10_RESD14.
* To use register names with standard convension, please use EVADC_G10_RESD14.
*/
#define	EVADC_G10RESD14	(EVADC_G10_RESD14)

/** \brief  2FBC, Group Result Reg., Debug */
#define EVADC_G10_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FBCu)

/** Alias (User Manual Name) for EVADC_G10_RESD15.
* To use register names with standard convension, please use EVADC_G10_RESD15.
*/
#define	EVADC_G10RESD15	(EVADC_G10_RESD15)

/** \brief  2F88, Group Result Reg., Debug */
#define EVADC_G10_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F88u)

