Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G10_RESD2.
* To use register names with standard convension, please use EVADC_G10_RESD2.
*/
#define	EVADC_G10RESD2	(EVADC_G10_RESD2)

/** \brief  2F8C, Group Result Reg., Debug */
#define EVADC_G10_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F8Cu)

/** Alias (User Manual Name) for EVADC_G10_RESD3.
* To use register names with standard convension, please use EVADC_G10_RESD3.
*/
#define	EVADC_G10RESD3	(EVADC_G10_RESD3)

/** \brief  2F90, Group Result Reg., Debug */
#define EVADC_G10_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F90u)

/** Alias (User Manual Name) for EVADC_G10_RESD4.
* To use register names with standard convension, please use EVADC_G10_RESD4.
*/
#define	EVADC_G10RESD4	(EVADC_G10_RESD4)

/** \brief  2F94, Group Result Reg., Debug */
#define EVADC_G10_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F94u)

/** Alias (User Manual Name) for EVADC_G10_RESD5.
* To use register names with standard convension, please use EVADC_G10_RESD5.
*/
#define	EVADC_G10RESD5	(EVADC_G10_RESD5)

/** \brief  2F98, Group Result Reg., Debug */
#define EVADC_G10_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F98u)

/** Alias (User Manual Name) for EVADC_G10_RESD6.
* To use register names with standard convension, please use EVADC_G10_RESD6.
*/
#define	EVADC_G10RESD6	(EVADC_G10_RESD6)

/** \brief  2F9C, Group Result Reg., Debug */
#define EVADC_G10_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022F9Cu)

/** Alias (User Manual Name) for EVADC_G10_RESD7.
* To use register names with standard convension, please use EVADC_G10_RESD7.
*/
#define	EVADC_G10RESD7	(EVADC_G10_RESD7)

/** \brief  2FA0, Group Result Reg., Debug */
#define EVADC_G10_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FA0u)

/** Alias (User Manual Name) for EVADC_G10_RESD8.
* To use register names with standard convension, please use EVADC_G10_RESD8.
*/
#define	EVADC_G10RESD8	(EVADC_G10_RESD8)

/** \brief  2FA4, Group Result Reg., Debug */
#define EVADC_G10_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022FA4u)

/** Alias (User Manual Name) for EVADC_G10_RESD9.
* To use register names with standard convension, please use EVADC_G10_RESD9.
*/
#define	EVADC_G10RESD9	(EVADC_G10_RESD9)

/** \brief  2DB0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G10_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF0022DB0u)

/** Alias (User Manual Name) for EVADC_G10_REVNP0.
* To use register names with standard convension, please use EVADC_G10_REVNP0.
*/
#define	EVADC_G10REVNP0	(EVADC_G10_REVNP0)

/** \brief  2DB4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G10_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF0022DB4u)

/** Alias (User Manual Name) for EVADC_G10_REVNP1.
* To use register names with standard convension, please use EVADC_G10_REVNP1.
*/
#define	EVADC_G10REVNP1	(EVADC_G10_REVNP1)

/** \brief  2D98, Source Event Flag Clear Reg., Group */
#define EVADC_G10_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0022D98u)

/** Alias (User Manual Name) for EVADC_G10_SEFCLR.
* To use register names with standard convension, please use EVADC_G10_SEFCLR.
*/
#define	EVADC_G10SEFCLR	(EVADC_G10_SEFCLR)

/** \brief  2D88, Source Event Flag Register, Group */
#define EVADC_G10_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0022D88u)

/** Alias (User Manual Name) for EVADC_G10_SEFLAG.
* To use register names with standard convension, please use EVADC_G10_SEFLAG.
*/
#define	EVADC_G10SEFLAG	(EVADC_G10_SEFLAG)

/** \brief  2DC0, Source Event Node Pointer Reg., Group */
#define EVADC_G10_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF0022DC0u)

/** Alias (User Manual Name) for EVADC_G10_SEVNP.
* To use register names with standard convension, please use EVADC_G10_SEVNP.
*/
#define	EVADC_G10SEVNP	(EVADC_G10_SEVNP)

/** \brief  2DC8, Service Request Software Activation Trigger, Group */
#define EVADC_G10_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF0022DC8u)

/** Alias (User Manual Name) for EVADC_G10_SRACT.
* To use register names with standard convension, please use EVADC_G10_SRACT.
*/
#define	EVADC_G10SRACT	(EVADC_G10_SRACT)

/** \brief  2CC0, Synchronization Control Register, Group */
#define EVADC_G10_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF0022CC0u)

/** Alias (User Manual Name) for EVADC_G10_SYNCTR.
* To use register names with standard convension, please use EVADC_G10_SYNCTR.
*/
#define	EVADC_G10SYNCTR	(EVADC_G10_SYNCTR)

/** \brief  2DF8, Valid Flag Register, Group */
#define EVADC_G10_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF0022DF8u)

/** Alias (User Manual Name) for EVADC_G10_VFR.
* To use register names with standard convension, please use EVADC_G10_VFR.
*/
#define	EVADC_G10VFR	(EVADC_G10_VFR)

/** \brief  30B0, Alias Register, Group */
#define EVADC_G11_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00230B0u)

/** Alias (User Manual Name) for EVADC_G11_ALIAS.
* To use register names with standard convension, please use EVADC_G11_ALIAS.
*/
#define	EVADC_G11ALIAS	(EVADC_G11_ALIAS)

/** \brief  3088, Analog Fct. Config. Register, Group */
#define EVADC_G11_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0023088u)

/** Alias (User Manual Name) for EVADC_G11_ANCFG.
* To use register names with standard convension, please use EVADC_G11_ANCFG.
*/
#define	EVADC_G11ANCFG	(EVADC_G11_ANCFG)

/** \brief  3080, Arbitration Config. Register, Group */
#define EVADC_G11_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0023080u)

/** Alias (User Manual Name) for EVADC_G11_ARBCFG.
* To use register names with standard convension, please use EVADC_G11_ARBCFG.
*/
#define	EVADC_G11ARBCFG	(EVADC_G11_ARBCFG)

/** \brief  3084, Arbitration Priority Register, Group */
#define EVADC_G11_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0023084u)

/** Alias (User Manual Name) for EVADC_G11_ARBPR.
* To use register names with standard convension, please use EVADC_G11_ARBPR.
*/
#define	EVADC_G11ARBPR	(EVADC_G11_ARBPR)

/** \brief  30B8, Boundary Select Register, Group */
#define EVADC_G11_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00230B8u)

/** Alias (User Manual Name) for EVADC_G11_BOUND.
* To use register names with standard convension, please use EVADC_G11_BOUND.
*/
#define	EVADC_G11BOUND	(EVADC_G11_BOUND)

/** \brief  3190, Channel Event Flag Clear Register, Group */
#define EVADC_G11_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0023190u)

/** Alias (User Manual Name) for EVADC_G11_CEFCLR.
* To use register names with standard convension, please use EVADC_G11_CEFCLR.
*/
#define	EVADC_G11CEFCLR	(EVADC_G11_CEFCLR)

/** \brief  3180, Channel Event Flag Register, Group */
#define EVADC_G11_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0023180u)

/** Alias (User Manual Name) for EVADC_G11_CEFLAG.
* To use register names with standard convension, please use EVADC_G11_CEFLAG.
*/
#define	EVADC_G11CEFLAG	(EVADC_G11_CEFLAG)

/** \brief  31A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G11_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00231A0u)

/** Alias (User Manual Name) for EVADC_G11_CEVNP0.
* To use register names with standard convension, please use EVADC_G11_CEVNP0.
*/
#define	EVADC_G11CEVNP0	(EVADC_G11_CEVNP0)

/** \brief  3200, Group, Channel Control Register */
#define EVADC_G11_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023200u)

