Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G11_CHCTR0.
* To use register names with standard convension, please use EVADC_G11_CHCTR0.
*/
#define	EVADC_G11CHCTR0	(EVADC_G11_CHCTR0)

/** \brief  3204, Group, Channel Control Register */
#define EVADC_G11_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023204u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR1.
* To use register names with standard convension, please use EVADC_G11_CHCTR1.
*/
#define	EVADC_G11CHCTR1	(EVADC_G11_CHCTR1)

/** \brief  3228, Group, Channel Control Register */
#define EVADC_G11_CHCTR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023228u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR10.
* To use register names with standard convension, please use EVADC_G11_CHCTR10.
*/
#define	EVADC_G11CHCTR10	(EVADC_G11_CHCTR10)

/** \brief  322C, Group, Channel Control Register */
#define EVADC_G11_CHCTR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002322Cu)

/** Alias (User Manual Name) for EVADC_G11_CHCTR11.
* To use register names with standard convension, please use EVADC_G11_CHCTR11.
*/
#define	EVADC_G11CHCTR11	(EVADC_G11_CHCTR11)

/** \brief  3230, Group, Channel Control Register */
#define EVADC_G11_CHCTR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023230u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR12.
* To use register names with standard convension, please use EVADC_G11_CHCTR12.
*/
#define	EVADC_G11CHCTR12	(EVADC_G11_CHCTR12)

/** \brief  3234, Group, Channel Control Register */
#define EVADC_G11_CHCTR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023234u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR13.
* To use register names with standard convension, please use EVADC_G11_CHCTR13.
*/
#define	EVADC_G11CHCTR13	(EVADC_G11_CHCTR13)

/** \brief  3238, Group, Channel Control Register */
#define EVADC_G11_CHCTR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023238u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR14.
* To use register names with standard convension, please use EVADC_G11_CHCTR14.
*/
#define	EVADC_G11CHCTR14	(EVADC_G11_CHCTR14)

/** \brief  323C, Group, Channel Control Register */
#define EVADC_G11_CHCTR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002323Cu)

/** Alias (User Manual Name) for EVADC_G11_CHCTR15.
* To use register names with standard convension, please use EVADC_G11_CHCTR15.
*/
#define	EVADC_G11CHCTR15	(EVADC_G11_CHCTR15)

/** \brief  3208, Group, Channel Control Register */
#define EVADC_G11_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023208u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR2.
* To use register names with standard convension, please use EVADC_G11_CHCTR2.
*/
#define	EVADC_G11CHCTR2	(EVADC_G11_CHCTR2)

/** \brief  320C, Group, Channel Control Register */
#define EVADC_G11_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002320Cu)

/** Alias (User Manual Name) for EVADC_G11_CHCTR3.
* To use register names with standard convension, please use EVADC_G11_CHCTR3.
*/
#define	EVADC_G11CHCTR3	(EVADC_G11_CHCTR3)

/** \brief  3210, Group, Channel Control Register */
#define EVADC_G11_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023210u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR4.
* To use register names with standard convension, please use EVADC_G11_CHCTR4.
*/
#define	EVADC_G11CHCTR4	(EVADC_G11_CHCTR4)

/** \brief  3214, Group, Channel Control Register */
#define EVADC_G11_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023214u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR5.
* To use register names with standard convension, please use EVADC_G11_CHCTR5.
*/
#define	EVADC_G11CHCTR5	(EVADC_G11_CHCTR5)

/** \brief  3218, Group, Channel Control Register */
#define EVADC_G11_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023218u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR6.
* To use register names with standard convension, please use EVADC_G11_CHCTR6.
*/
#define	EVADC_G11CHCTR6	(EVADC_G11_CHCTR6)

/** \brief  321C, Group, Channel Control Register */
#define EVADC_G11_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002321Cu)

/** Alias (User Manual Name) for EVADC_G11_CHCTR7.
* To use register names with standard convension, please use EVADC_G11_CHCTR7.
*/
#define	EVADC_G11CHCTR7	(EVADC_G11_CHCTR7)

/** \brief  3220, Group, Channel Control Register */
#define EVADC_G11_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023220u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR8.
* To use register names with standard convension, please use EVADC_G11_CHCTR8.
*/
#define	EVADC_G11CHCTR8	(EVADC_G11_CHCTR8)

/** \brief  3224, Group, Channel Control Register */
#define EVADC_G11_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0023224u)

/** Alias (User Manual Name) for EVADC_G11_CHCTR9.
* To use register names with standard convension, please use EVADC_G11_CHCTR9.
*/
#define	EVADC_G11CHCTR9	(EVADC_G11_CHCTR9)

/** \brief  31F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G11_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00231F4u)

/** Alias (User Manual Name) for EVADC_G11_EMUXCS.
* To use register names with standard convension, please use EVADC_G11_EMUXCS.
*/
#define	EVADC_G11EMUXCS	(EVADC_G11_EMUXCS)

/** \brief  31F0, External Multiplexer Control Reg., Group */
#define EVADC_G11_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00231F0u)

/** Alias (User Manual Name) for EVADC_G11_EMUXCTR.
* To use register names with standard convension, please use EVADC_G11_EMUXCTR.
*/
#define	EVADC_G11EMUXCTR	(EVADC_G11_EMUXCTR)

/** \brief  30A0, Input Class Reg0ster i, Group */
#define EVADC_G11_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00230A0u)

/** Alias (User Manual Name) for EVADC_G11_ICLASS0.
* To use register names with standard convension, please use EVADC_G11_ICLASS0.
*/
#define	EVADC_G11ICLASS0	(EVADC_G11_ICLASS0)

/** \brief  30A4, Input Class Reg0ster i, Group */
#define EVADC_G11_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00230A4u)

/** Alias (User Manual Name) for EVADC_G11_ICLASS1.
* To use register names with standard convension, please use EVADC_G11_ICLASS1.
*/
#define	EVADC_G11ICLASS1	(EVADC_G11_ICLASS1)

/** \brief  310C, Queue 0 Register 0, Group 0 */
#define EVADC_G11_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002310Cu)

/** Alias (User Manual Name) for EVADC_G11_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G11_Q0_Q0R.
*/
#define	EVADC_G11Q0R0	(EVADC_G11_Q0_Q0R)

/** \brief  3100, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G11_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0023100u)

/** Alias (User Manual Name) for EVADC_G11_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G11_Q0_QCTRL.
*/
#define	EVADC_G11QCTRL0	(EVADC_G11_Q0_QCTRL)

