Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  3110, Queue 0 Input Register, Group 0 */
#define EVADC_G11_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0023110u)

/** Alias (User Manual Name) for EVADC_G11_Q0_QINR.
* To use register names with standard convension, please use EVADC_G11_Q0_QINR.
*/
#define	EVADC_G11QINR0	(EVADC_G11_Q0_QINR)

/** \brief  3104, Queue 0 Mode Register, Group 0 */
#define EVADC_G11_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0023104u)

/** Alias (User Manual Name) for EVADC_G11_Q0_QMR.
* To use register names with standard convension, please use EVADC_G11_Q0_QMR.
*/
#define	EVADC_G11QMR0	(EVADC_G11_Q0_QMR)

/** \brief  3108, Queue 0 Status Register, Group 0 */
#define EVADC_G11_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0023108u)

/** Alias (User Manual Name) for EVADC_G11_Q0_QSR.
* To use register names with standard convension, please use EVADC_G11_Q0_QSR.
*/
#define	EVADC_G11QSR0	(EVADC_G11_Q0_QSR)

/** \brief  3118, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G11_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0023118u)

/** Alias (User Manual Name) for EVADC_G11_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G11_Q0_REQTM.
*/
#define	EVADC_G11REQTM0	(EVADC_G11_Q0_REQTM)

/** \brief  311C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G11_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002311Cu)

/** Alias (User Manual Name) for EVADC_G11_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G11_Q0_REQTS.
*/
#define	EVADC_G11REQTS0	(EVADC_G11_Q0_REQTS)

/** \brief  312C, Queue 0 Register 0, Group 0 */
#define EVADC_G11_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002312Cu)

/** Alias (User Manual Name) for EVADC_G11_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G11_Q1_Q0R.
*/
#define	EVADC_G11Q0R1	(EVADC_G11_Q1_Q0R)

/** \brief  3120, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G11_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0023120u)

/** Alias (User Manual Name) for EVADC_G11_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G11_Q1_QCTRL.
*/
#define	EVADC_G11QCTRL1	(EVADC_G11_Q1_QCTRL)

/** \brief  3130, Queue 0 Input Register, Group 0 */
#define EVADC_G11_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0023130u)

/** Alias (User Manual Name) for EVADC_G11_Q1_QINR.
* To use register names with standard convension, please use EVADC_G11_Q1_QINR.
*/
#define	EVADC_G11QINR1	(EVADC_G11_Q1_QINR)

/** \brief  3124, Queue 0 Mode Register, Group 0 */
#define EVADC_G11_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0023124u)

/** Alias (User Manual Name) for EVADC_G11_Q1_QMR.
* To use register names with standard convension, please use EVADC_G11_Q1_QMR.
*/
#define	EVADC_G11QMR1	(EVADC_G11_Q1_QMR)

/** \brief  3128, Queue 0 Status Register, Group 0 */
#define EVADC_G11_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0023128u)

/** Alias (User Manual Name) for EVADC_G11_Q1_QSR.
* To use register names with standard convension, please use EVADC_G11_Q1_QSR.
*/
#define	EVADC_G11QSR1	(EVADC_G11_Q1_QSR)

/** \brief  3138, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G11_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0023138u)

/** Alias (User Manual Name) for EVADC_G11_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G11_Q1_REQTM.
*/
#define	EVADC_G11REQTM1	(EVADC_G11_Q1_REQTM)

/** \brief  313C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G11_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002313Cu)

/** Alias (User Manual Name) for EVADC_G11_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G11_Q1_REQTS.
*/
#define	EVADC_G11REQTS1	(EVADC_G11_Q1_REQTS)

/** \brief  314C, Queue 0 Register 0, Group 0 */
#define EVADC_G11_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002314Cu)

/** Alias (User Manual Name) for EVADC_G11_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G11_Q2_Q0R.
*/
#define	EVADC_G11Q0R2	(EVADC_G11_Q2_Q0R)

/** \brief  3140, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G11_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0023140u)

/** Alias (User Manual Name) for EVADC_G11_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G11_Q2_QCTRL.
*/
#define	EVADC_G11QCTRL2	(EVADC_G11_Q2_QCTRL)

/** \brief  3150, Queue 0 Input Register, Group 0 */
#define EVADC_G11_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0023150u)

/** Alias (User Manual Name) for EVADC_G11_Q2_QINR.
* To use register names with standard convension, please use EVADC_G11_Q2_QINR.
*/
#define	EVADC_G11QINR2	(EVADC_G11_Q2_QINR)

/** \brief  3144, Queue 0 Mode Register, Group 0 */
#define EVADC_G11_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0023144u)

/** Alias (User Manual Name) for EVADC_G11_Q2_QMR.
* To use register names with standard convension, please use EVADC_G11_Q2_QMR.
*/
#define	EVADC_G11QMR2	(EVADC_G11_Q2_QMR)

/** \brief  3148, Queue 0 Status Register, Group 0 */
#define EVADC_G11_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0023148u)

/** Alias (User Manual Name) for EVADC_G11_Q2_QSR.
* To use register names with standard convension, please use EVADC_G11_Q2_QSR.
*/
#define	EVADC_G11QSR2	(EVADC_G11_Q2_QSR)

/** \brief  3154, Queue 2 Status Register, Group 11 */
#define EVADC_G11_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0023154u)

/** Alias (User Manual Name) for EVADC_G11_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G11_Q0_QSR.
*/
#define	EVADC_G11TRCTR	(EVADC_G11_Q2_TRCTR)

/** \brief  3158, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G11_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0023158u)

/** Alias (User Manual Name) for EVADC_G11_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G11_Q2_REQTM.
*/
#define	EVADC_G11REQTM2	(EVADC_G11_Q2_REQTM)

/** \brief  315C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G11_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002315Cu)

/** Alias (User Manual Name) for EVADC_G11_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G11_Q2_REQTS.
*/
#define	EVADC_G11REQTS2	(EVADC_G11_Q2_REQTS)

/** \brief  3280, Group Result Control Register */
#define EVADC_G11_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0023280u)

