Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G11_RCR0.
* To use register names with standard convension, please use EVADC_G11_RCR0.
*/
#define	EVADC_G11RCR0	(EVADC_G11_RCR0)

/** \brief  3284, Group Result Control Register */
#define EVADC_G11_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0023284u)

/** Alias (User Manual Name) for EVADC_G11_RCR1.
* To use register names with standard convension, please use EVADC_G11_RCR1.
*/
#define	EVADC_G11RCR1	(EVADC_G11_RCR1)

/** \brief  32A8, Group Result Control Register */
#define EVADC_G11_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232A8u)

/** Alias (User Manual Name) for EVADC_G11_RCR10.
* To use register names with standard convension, please use EVADC_G11_RCR10.
*/
#define	EVADC_G11RCR10	(EVADC_G11_RCR10)

/** \brief  32AC, Group Result Control Register */
#define EVADC_G11_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232ACu)

/** Alias (User Manual Name) for EVADC_G11_RCR11.
* To use register names with standard convension, please use EVADC_G11_RCR11.
*/
#define	EVADC_G11RCR11	(EVADC_G11_RCR11)

/** \brief  32B0, Group Result Control Register */
#define EVADC_G11_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232B0u)

/** Alias (User Manual Name) for EVADC_G11_RCR12.
* To use register names with standard convension, please use EVADC_G11_RCR12.
*/
#define	EVADC_G11RCR12	(EVADC_G11_RCR12)

/** \brief  32B4, Group Result Control Register */
#define EVADC_G11_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232B4u)

/** Alias (User Manual Name) for EVADC_G11_RCR13.
* To use register names with standard convension, please use EVADC_G11_RCR13.
*/
#define	EVADC_G11RCR13	(EVADC_G11_RCR13)

/** \brief  32B8, Group Result Control Register */
#define EVADC_G11_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232B8u)

/** Alias (User Manual Name) for EVADC_G11_RCR14.
* To use register names with standard convension, please use EVADC_G11_RCR14.
*/
#define	EVADC_G11RCR14	(EVADC_G11_RCR14)

/** \brief  32BC, Group Result Control Register */
#define EVADC_G11_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232BCu)

/** Alias (User Manual Name) for EVADC_G11_RCR15.
* To use register names with standard convension, please use EVADC_G11_RCR15.
*/
#define	EVADC_G11RCR15	(EVADC_G11_RCR15)

/** \brief  3288, Group Result Control Register */
#define EVADC_G11_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0023288u)

/** Alias (User Manual Name) for EVADC_G11_RCR2.
* To use register names with standard convension, please use EVADC_G11_RCR2.
*/
#define	EVADC_G11RCR2	(EVADC_G11_RCR2)

/** \brief  328C, Group Result Control Register */
#define EVADC_G11_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002328Cu)

/** Alias (User Manual Name) for EVADC_G11_RCR3.
* To use register names with standard convension, please use EVADC_G11_RCR3.
*/
#define	EVADC_G11RCR3	(EVADC_G11_RCR3)

/** \brief  3290, Group Result Control Register */
#define EVADC_G11_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0023290u)

/** Alias (User Manual Name) for EVADC_G11_RCR4.
* To use register names with standard convension, please use EVADC_G11_RCR4.
*/
#define	EVADC_G11RCR4	(EVADC_G11_RCR4)

/** \brief  3294, Group Result Control Register */
#define EVADC_G11_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0023294u)

/** Alias (User Manual Name) for EVADC_G11_RCR5.
* To use register names with standard convension, please use EVADC_G11_RCR5.
*/
#define	EVADC_G11RCR5	(EVADC_G11_RCR5)

/** \brief  3298, Group Result Control Register */
#define EVADC_G11_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0023298u)

/** Alias (User Manual Name) for EVADC_G11_RCR6.
* To use register names with standard convension, please use EVADC_G11_RCR6.
*/
#define	EVADC_G11RCR6	(EVADC_G11_RCR6)

/** \brief  329C, Group Result Control Register */
#define EVADC_G11_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002329Cu)

/** Alias (User Manual Name) for EVADC_G11_RCR7.
* To use register names with standard convension, please use EVADC_G11_RCR7.
*/
#define	EVADC_G11RCR7	(EVADC_G11_RCR7)

/** \brief  32A0, Group Result Control Register */
#define EVADC_G11_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232A0u)

/** Alias (User Manual Name) for EVADC_G11_RCR8.
* To use register names with standard convension, please use EVADC_G11_RCR8.
*/
#define	EVADC_G11RCR8	(EVADC_G11_RCR8)

/** \brief  32A4, Group Result Control Register */
#define EVADC_G11_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00232A4u)

/** Alias (User Manual Name) for EVADC_G11_RCR9.
* To use register names with standard convension, please use EVADC_G11_RCR9.
*/
#define	EVADC_G11RCR9	(EVADC_G11_RCR9)

/** \brief  3194, Result Event Flag Clear Register, Group */
#define EVADC_G11_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0023194u)

/** Alias (User Manual Name) for EVADC_G11_REFCLR.
* To use register names with standard convension, please use EVADC_G11_REFCLR.
*/
#define	EVADC_G11REFCLR	(EVADC_G11_REFCLR)

/** \brief  3184, Result Event Flag Register, Group */
#define EVADC_G11_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0023184u)

/** Alias (User Manual Name) for EVADC_G11_REFLAG.
* To use register names with standard convension, please use EVADC_G11_REFLAG.
*/
#define	EVADC_G11REFLAG	(EVADC_G11_REFLAG)

/** \brief  3300, Group Result Register */
#define EVADC_G11_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023300u)

/** Alias (User Manual Name) for EVADC_G11_RES0.
* To use register names with standard convension, please use EVADC_G11_RES0.
*/
#define	EVADC_G11RES0	(EVADC_G11_RES0)

/** \brief  3304, Group Result Register */
#define EVADC_G11_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023304u)

/** Alias (User Manual Name) for EVADC_G11_RES1.
* To use register names with standard convension, please use EVADC_G11_RES1.
*/
#define	EVADC_G11RES1	(EVADC_G11_RES1)

/** \brief  3328, Group Result Register */
#define EVADC_G11_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023328u)

/** Alias (User Manual Name) for EVADC_G11_RES10.
* To use register names with standard convension, please use EVADC_G11_RES10.
*/
#define	EVADC_G11RES10	(EVADC_G11_RES10)

