Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  332C, Group Result Register */
#define EVADC_G11_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002332Cu)

/** Alias (User Manual Name) for EVADC_G11_RES11.
* To use register names with standard convension, please use EVADC_G11_RES11.
*/
#define	EVADC_G11RES11	(EVADC_G11_RES11)

/** \brief  3330, Group Result Register */
#define EVADC_G11_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023330u)

/** Alias (User Manual Name) for EVADC_G11_RES12.
* To use register names with standard convension, please use EVADC_G11_RES12.
*/
#define	EVADC_G11RES12	(EVADC_G11_RES12)

/** \brief  3334, Group Result Register */
#define EVADC_G11_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023334u)

/** Alias (User Manual Name) for EVADC_G11_RES13.
* To use register names with standard convension, please use EVADC_G11_RES13.
*/
#define	EVADC_G11RES13	(EVADC_G11_RES13)

/** \brief  3338, Group Result Register */
#define EVADC_G11_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023338u)

/** Alias (User Manual Name) for EVADC_G11_RES14.
* To use register names with standard convension, please use EVADC_G11_RES14.
*/
#define	EVADC_G11RES14	(EVADC_G11_RES14)

/** \brief  333C, Group Result Register */
#define EVADC_G11_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002333Cu)

/** Alias (User Manual Name) for EVADC_G11_RES15.
* To use register names with standard convension, please use EVADC_G11_RES15.
*/
#define	EVADC_G11RES15	(EVADC_G11_RES15)

/** \brief  3308, Group Result Register */
#define EVADC_G11_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023308u)

/** Alias (User Manual Name) for EVADC_G11_RES2.
* To use register names with standard convension, please use EVADC_G11_RES2.
*/
#define	EVADC_G11RES2	(EVADC_G11_RES2)

/** \brief  330C, Group Result Register */
#define EVADC_G11_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002330Cu)

/** Alias (User Manual Name) for EVADC_G11_RES3.
* To use register names with standard convension, please use EVADC_G11_RES3.
*/
#define	EVADC_G11RES3	(EVADC_G11_RES3)

/** \brief  3310, Group Result Register */
#define EVADC_G11_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023310u)

/** Alias (User Manual Name) for EVADC_G11_RES4.
* To use register names with standard convension, please use EVADC_G11_RES4.
*/
#define	EVADC_G11RES4	(EVADC_G11_RES4)

/** \brief  3314, Group Result Register */
#define EVADC_G11_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023314u)

/** Alias (User Manual Name) for EVADC_G11_RES5.
* To use register names with standard convension, please use EVADC_G11_RES5.
*/
#define	EVADC_G11RES5	(EVADC_G11_RES5)

/** \brief  3318, Group Result Register */
#define EVADC_G11_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023318u)

/** Alias (User Manual Name) for EVADC_G11_RES6.
* To use register names with standard convension, please use EVADC_G11_RES6.
*/
#define	EVADC_G11RES6	(EVADC_G11_RES6)

/** \brief  331C, Group Result Register */
#define EVADC_G11_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002331Cu)

/** Alias (User Manual Name) for EVADC_G11_RES7.
* To use register names with standard convension, please use EVADC_G11_RES7.
*/
#define	EVADC_G11RES7	(EVADC_G11_RES7)

/** \brief  3320, Group Result Register */
#define EVADC_G11_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023320u)

/** Alias (User Manual Name) for EVADC_G11_RES8.
* To use register names with standard convension, please use EVADC_G11_RES8.
*/
#define	EVADC_G11RES8	(EVADC_G11_RES8)

/** \brief  3324, Group Result Register */
#define EVADC_G11_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0023324u)

/** Alias (User Manual Name) for EVADC_G11_RES9.
* To use register names with standard convension, please use EVADC_G11_RES9.
*/
#define	EVADC_G11RES9	(EVADC_G11_RES9)

/** \brief  3380, Group Result Reg., Debug */
#define EVADC_G11_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0023380u)

/** Alias (User Manual Name) for EVADC_G11_RESD0.
* To use register names with standard convension, please use EVADC_G11_RESD0.
*/
#define	EVADC_G11RESD0	(EVADC_G11_RESD0)

/** \brief  3384, Group Result Reg., Debug */
#define EVADC_G11_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0023384u)

/** Alias (User Manual Name) for EVADC_G11_RESD1.
* To use register names with standard convension, please use EVADC_G11_RESD1.
*/
#define	EVADC_G11RESD1	(EVADC_G11_RESD1)

/** \brief  33A8, Group Result Reg., Debug */
#define EVADC_G11_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233A8u)

/** Alias (User Manual Name) for EVADC_G11_RESD10.
* To use register names with standard convension, please use EVADC_G11_RESD10.
*/
#define	EVADC_G11RESD10	(EVADC_G11_RESD10)

/** \brief  33AC, Group Result Reg., Debug */
#define EVADC_G11_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233ACu)

/** Alias (User Manual Name) for EVADC_G11_RESD11.
* To use register names with standard convension, please use EVADC_G11_RESD11.
*/
#define	EVADC_G11RESD11	(EVADC_G11_RESD11)

/** \brief  33B0, Group Result Reg., Debug */
#define EVADC_G11_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233B0u)

/** Alias (User Manual Name) for EVADC_G11_RESD12.
* To use register names with standard convension, please use EVADC_G11_RESD12.
*/
#define	EVADC_G11RESD12	(EVADC_G11_RESD12)

/** \brief  33B4, Group Result Reg., Debug */
#define EVADC_G11_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233B4u)

/** Alias (User Manual Name) for EVADC_G11_RESD13.
* To use register names with standard convension, please use EVADC_G11_RESD13.
*/
#define	EVADC_G11RESD13	(EVADC_G11_RESD13)

/** \brief  33B8, Group Result Reg., Debug */
#define EVADC_G11_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233B8u)

/** Alias (User Manual Name) for EVADC_G11_RESD14.
* To use register names with standard convension, please use EVADC_G11_RESD14.
*/
#define	EVADC_G11RESD14	(EVADC_G11_RESD14)

/** \brief  33BC, Group Result Reg., Debug */
#define EVADC_G11_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233BCu)

/** Alias (User Manual Name) for EVADC_G11_RESD15.
* To use register names with standard convension, please use EVADC_G11_RESD15.
*/
#define	EVADC_G11RESD15	(EVADC_G11_RESD15)

/** \brief  3388, Group Result Reg., Debug */
#define EVADC_G11_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0023388u)

/** Alias (User Manual Name) for EVADC_G11_RESD2.
* To use register names with standard convension, please use EVADC_G11_RESD2.
*/
#define	EVADC_G11RESD2	(EVADC_G11_RESD2)

