Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  338C, Group Result Reg., Debug */
#define EVADC_G11_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002338Cu)

/** Alias (User Manual Name) for EVADC_G11_RESD3.
* To use register names with standard convension, please use EVADC_G11_RESD3.
*/
#define	EVADC_G11RESD3	(EVADC_G11_RESD3)

/** \brief  3390, Group Result Reg., Debug */
#define EVADC_G11_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0023390u)

/** Alias (User Manual Name) for EVADC_G11_RESD4.
* To use register names with standard convension, please use EVADC_G11_RESD4.
*/
#define	EVADC_G11RESD4	(EVADC_G11_RESD4)

/** \brief  3394, Group Result Reg., Debug */
#define EVADC_G11_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0023394u)

/** Alias (User Manual Name) for EVADC_G11_RESD5.
* To use register names with standard convension, please use EVADC_G11_RESD5.
*/
#define	EVADC_G11RESD5	(EVADC_G11_RESD5)

/** \brief  3398, Group Result Reg., Debug */
#define EVADC_G11_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0023398u)

/** Alias (User Manual Name) for EVADC_G11_RESD6.
* To use register names with standard convension, please use EVADC_G11_RESD6.
*/
#define	EVADC_G11RESD6	(EVADC_G11_RESD6)

/** \brief  339C, Group Result Reg., Debug */
#define EVADC_G11_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002339Cu)

/** Alias (User Manual Name) for EVADC_G11_RESD7.
* To use register names with standard convension, please use EVADC_G11_RESD7.
*/
#define	EVADC_G11RESD7	(EVADC_G11_RESD7)

/** \brief  33A0, Group Result Reg., Debug */
#define EVADC_G11_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233A0u)

/** Alias (User Manual Name) for EVADC_G11_RESD8.
* To use register names with standard convension, please use EVADC_G11_RESD8.
*/
#define	EVADC_G11RESD8	(EVADC_G11_RESD8)

/** \brief  33A4, Group Result Reg., Debug */
#define EVADC_G11_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00233A4u)

/** Alias (User Manual Name) for EVADC_G11_RESD9.
* To use register names with standard convension, please use EVADC_G11_RESD9.
*/
#define	EVADC_G11RESD9	(EVADC_G11_RESD9)

/** \brief  31B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G11_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00231B0u)

/** Alias (User Manual Name) for EVADC_G11_REVNP0.
* To use register names with standard convension, please use EVADC_G11_REVNP0.
*/
#define	EVADC_G11REVNP0	(EVADC_G11_REVNP0)

/** \brief  31B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G11_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00231B4u)

/** Alias (User Manual Name) for EVADC_G11_REVNP1.
* To use register names with standard convension, please use EVADC_G11_REVNP1.
*/
#define	EVADC_G11REVNP1	(EVADC_G11_REVNP1)

/** \brief  3198, Source Event Flag Clear Reg., Group */
#define EVADC_G11_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0023198u)

/** Alias (User Manual Name) for EVADC_G11_SEFCLR.
* To use register names with standard convension, please use EVADC_G11_SEFCLR.
*/
#define	EVADC_G11SEFCLR	(EVADC_G11_SEFCLR)

/** \brief  3188, Source Event Flag Register, Group */
#define EVADC_G11_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0023188u)

/** Alias (User Manual Name) for EVADC_G11_SEFLAG.
* To use register names with standard convension, please use EVADC_G11_SEFLAG.
*/
#define	EVADC_G11SEFLAG	(EVADC_G11_SEFLAG)

/** \brief  31C0, Source Event Node Pointer Reg., Group */
#define EVADC_G11_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00231C0u)

/** Alias (User Manual Name) for EVADC_G11_SEVNP.
* To use register names with standard convension, please use EVADC_G11_SEVNP.
*/
#define	EVADC_G11SEVNP	(EVADC_G11_SEVNP)

/** \brief  31C8, Service Request Software Activation Trigger, Group */
#define EVADC_G11_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00231C8u)

/** Alias (User Manual Name) for EVADC_G11_SRACT.
* To use register names with standard convension, please use EVADC_G11_SRACT.
*/
#define	EVADC_G11SRACT	(EVADC_G11_SRACT)

/** \brief  30C0, Synchronization Control Register, Group */
#define EVADC_G11_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00230C0u)

/** Alias (User Manual Name) for EVADC_G11_SYNCTR.
* To use register names with standard convension, please use EVADC_G11_SYNCTR.
*/
#define	EVADC_G11SYNCTR	(EVADC_G11_SYNCTR)

/** \brief  31F8, Valid Flag Register, Group */
#define EVADC_G11_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00231F8u)

/** Alias (User Manual Name) for EVADC_G11_VFR.
* To use register names with standard convension, please use EVADC_G11_VFR.
*/
#define	EVADC_G11VFR	(EVADC_G11_VFR)

/** \brief  8B0, Alias Register, Group */
#define EVADC_G1_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00208B0u)

/** Alias (User Manual Name) for EVADC_G1_ALIAS.
* To use register names with standard convension, please use EVADC_G1_ALIAS.
*/
#define	EVADC_G1ALIAS	(EVADC_G1_ALIAS)

/** \brief  888, Analog Fct. Config. Register, Group */
#define EVADC_G1_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0020888u)

/** Alias (User Manual Name) for EVADC_G1_ANCFG.
* To use register names with standard convension, please use EVADC_G1_ANCFG.
*/
#define	EVADC_G1ANCFG	(EVADC_G1_ANCFG)

/** \brief  880, Arbitration Config. Register, Group */
#define EVADC_G1_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0020880u)

/** Alias (User Manual Name) for EVADC_G1_ARBCFG.
* To use register names with standard convension, please use EVADC_G1_ARBCFG.
*/
#define	EVADC_G1ARBCFG	(EVADC_G1_ARBCFG)

/** \brief  884, Arbitration Priority Register, Group */
#define EVADC_G1_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0020884u)

/** Alias (User Manual Name) for EVADC_G1_ARBPR.
* To use register names with standard convension, please use EVADC_G1_ARBPR.
*/
#define	EVADC_G1ARBPR	(EVADC_G1_ARBPR)

/** \brief  8B8, Boundary Select Register, Group */
#define EVADC_G1_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00208B8u)

/** Alias (User Manual Name) for EVADC_G1_BOUND.
* To use register names with standard convension, please use EVADC_G1_BOUND.
*/
#define	EVADC_G1BOUND	(EVADC_G1_BOUND)

/** \brief  990, Channel Event Flag Clear Register, Group */
#define EVADC_G1_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0020990u)

/** Alias (User Manual Name) for EVADC_G1_CEFCLR.
* To use register names with standard convension, please use EVADC_G1_CEFCLR.
*/
#define	EVADC_G1CEFCLR	(EVADC_G1_CEFCLR)

/** \brief  980, Channel Event Flag Register, Group */
#define EVADC_G1_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0020980u)

/** Alias (User Manual Name) for EVADC_G1_CEFLAG.
* To use register names with standard convension, please use EVADC_G1_CEFLAG.
*/
#define	EVADC_G1CEFLAG	(EVADC_G1_CEFLAG)

