Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  9A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G1_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00209A0u)

/** Alias (User Manual Name) for EVADC_G1_CEVNP0.
* To use register names with standard convension, please use EVADC_G1_CEVNP0.
*/
#define	EVADC_G1CEVNP0	(EVADC_G1_CEVNP0)

/** \brief  A00, Group, Channel Control Register */
#define EVADC_G1_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A00u)

/** Alias (User Manual Name) for EVADC_G1_CHCTR0.
* To use register names with standard convension, please use EVADC_G1_CHCTR0.
*/
#define	EVADC_G1CHCTR0	(EVADC_G1_CHCTR0)

/** \brief  A04, Group, Channel Control Register */
#define EVADC_G1_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A04u)

/** Alias (User Manual Name) for EVADC_G1_CHCTR1.
* To use register names with standard convension, please use EVADC_G1_CHCTR1.
*/
#define	EVADC_G1CHCTR1	(EVADC_G1_CHCTR1)

/** \brief  A08, Group, Channel Control Register */
#define EVADC_G1_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A08u)

/** Alias (User Manual Name) for EVADC_G1_CHCTR2.
* To use register names with standard convension, please use EVADC_G1_CHCTR2.
*/
#define	EVADC_G1CHCTR2	(EVADC_G1_CHCTR2)

/** \brief  A0C, Group, Channel Control Register */
#define EVADC_G1_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A0Cu)

/** Alias (User Manual Name) for EVADC_G1_CHCTR3.
* To use register names with standard convension, please use EVADC_G1_CHCTR3.
*/
#define	EVADC_G1CHCTR3	(EVADC_G1_CHCTR3)

/** \brief  A10, Group, Channel Control Register */
#define EVADC_G1_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A10u)

/** Alias (User Manual Name) for EVADC_G1_CHCTR4.
* To use register names with standard convension, please use EVADC_G1_CHCTR4.
*/
#define	EVADC_G1CHCTR4	(EVADC_G1_CHCTR4)

/** \brief  A14, Group, Channel Control Register */
#define EVADC_G1_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A14u)

/** Alias (User Manual Name) for EVADC_G1_CHCTR5.
* To use register names with standard convension, please use EVADC_G1_CHCTR5.
*/
#define	EVADC_G1CHCTR5	(EVADC_G1_CHCTR5)

/** \brief  A18, Group, Channel Control Register */
#define EVADC_G1_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A18u)

/** Alias (User Manual Name) for EVADC_G1_CHCTR6.
* To use register names with standard convension, please use EVADC_G1_CHCTR6.
*/
#define	EVADC_G1CHCTR6	(EVADC_G1_CHCTR6)

/** \brief  A1C, Group, Channel Control Register */
#define EVADC_G1_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020A1Cu)

/** Alias (User Manual Name) for EVADC_G1_CHCTR7.
* To use register names with standard convension, please use EVADC_G1_CHCTR7.
*/
#define	EVADC_G1CHCTR7	(EVADC_G1_CHCTR7)

/** \brief  9F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G1_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00209F4u)

/** Alias (User Manual Name) for EVADC_G1_EMUXCS.
* To use register names with standard convension, please use EVADC_G1_EMUXCS.
*/
#define	EVADC_G1EMUXCS	(EVADC_G1_EMUXCS)

/** \brief  9F0, External Multiplexer Control Reg., Group */
#define EVADC_G1_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00209F0u)

/** Alias (User Manual Name) for EVADC_G1_EMUXCTR.
* To use register names with standard convension, please use EVADC_G1_EMUXCTR.
*/
#define	EVADC_G1EMUXCTR	(EVADC_G1_EMUXCTR)

/** \brief  8A0, Input Class Reg0ster i, Group */
#define EVADC_G1_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00208A0u)

/** Alias (User Manual Name) for EVADC_G1_ICLASS0.
* To use register names with standard convension, please use EVADC_G1_ICLASS0.
*/
#define	EVADC_G1ICLASS0	(EVADC_G1_ICLASS0)

/** \brief  8A4, Input Class Reg0ster i, Group */
#define EVADC_G1_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00208A4u)

/** Alias (User Manual Name) for EVADC_G1_ICLASS1.
* To use register names with standard convension, please use EVADC_G1_ICLASS1.
*/
#define	EVADC_G1ICLASS1	(EVADC_G1_ICLASS1)

/** \brief  90C, Queue 0 Register 0, Group 0 */
#define EVADC_G1_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002090Cu)

/** Alias (User Manual Name) for EVADC_G1_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G1_Q0_Q0R.
*/
#define	EVADC_G1Q0R0	(EVADC_G1_Q0_Q0R)

/** \brief  900, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G1_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020900u)

/** Alias (User Manual Name) for EVADC_G1_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G1_Q0_QCTRL.
*/
#define	EVADC_G1QCTRL0	(EVADC_G1_Q0_QCTRL)

/** \brief  910, Queue 0 Input Register, Group 0 */
#define EVADC_G1_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020910u)

/** Alias (User Manual Name) for EVADC_G1_Q0_QINR.
* To use register names with standard convension, please use EVADC_G1_Q0_QINR.
*/
#define	EVADC_G1QINR0	(EVADC_G1_Q0_QINR)

/** \brief  904, Queue 0 Mode Register, Group 0 */
#define EVADC_G1_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020904u)

/** Alias (User Manual Name) for EVADC_G1_Q0_QMR.
* To use register names with standard convension, please use EVADC_G1_Q0_QMR.
*/
#define	EVADC_G1QMR0	(EVADC_G1_Q0_QMR)

/** \brief  908, Queue 0 Status Register, Group 0 */
#define EVADC_G1_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020908u)

/** Alias (User Manual Name) for EVADC_G1_Q0_QSR.
* To use register names with standard convension, please use EVADC_G1_Q0_QSR.
*/
#define	EVADC_G1QSR0	(EVADC_G1_Q0_QSR)

/** \brief  918, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G1_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020918u)

/** Alias (User Manual Name) for EVADC_G1_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G1_Q0_REQTM.
*/
#define	EVADC_G1REQTM0	(EVADC_G1_Q0_REQTM)

/** \brief  91C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G1_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002091Cu)

/** Alias (User Manual Name) for EVADC_G1_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G1_Q0_REQTS.
*/
#define	EVADC_G1REQTS0	(EVADC_G1_Q0_REQTS)

