Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  92C, Queue 0 Register 0, Group 0 */
#define EVADC_G1_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002092Cu)

/** Alias (User Manual Name) for EVADC_G1_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G1_Q1_Q0R.
*/
#define	EVADC_G1Q0R1	(EVADC_G1_Q1_Q0R)

/** \brief  920, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G1_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020920u)

/** Alias (User Manual Name) for EVADC_G1_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G1_Q1_QCTRL.
*/
#define	EVADC_G1QCTRL1	(EVADC_G1_Q1_QCTRL)

/** \brief  930, Queue 0 Input Register, Group 0 */
#define EVADC_G1_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020930u)

/** Alias (User Manual Name) for EVADC_G1_Q1_QINR.
* To use register names with standard convension, please use EVADC_G1_Q1_QINR.
*/
#define	EVADC_G1QINR1	(EVADC_G1_Q1_QINR)

/** \brief  924, Queue 0 Mode Register, Group 0 */
#define EVADC_G1_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020924u)

/** Alias (User Manual Name) for EVADC_G1_Q1_QMR.
* To use register names with standard convension, please use EVADC_G1_Q1_QMR.
*/
#define	EVADC_G1QMR1	(EVADC_G1_Q1_QMR)

/** \brief  928, Queue 0 Status Register, Group 0 */
#define EVADC_G1_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020928u)

/** Alias (User Manual Name) for EVADC_G1_Q1_QSR.
* To use register names with standard convension, please use EVADC_G1_Q1_QSR.
*/
#define	EVADC_G1QSR1	(EVADC_G1_Q1_QSR)

/** \brief  938, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G1_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020938u)

/** Alias (User Manual Name) for EVADC_G1_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G1_Q1_REQTM.
*/
#define	EVADC_G1REQTM1	(EVADC_G1_Q1_REQTM)

/** \brief  93C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G1_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002093Cu)

/** Alias (User Manual Name) for EVADC_G1_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G1_Q1_REQTS.
*/
#define	EVADC_G1REQTS1	(EVADC_G1_Q1_REQTS)

/** \brief  94C, Queue 0 Register 0, Group 0 */
#define EVADC_G1_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002094Cu)

/** Alias (User Manual Name) for EVADC_G1_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G1_Q2_Q0R.
*/
#define	EVADC_G1Q0R2	(EVADC_G1_Q2_Q0R)

/** \brief  940, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G1_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020940u)

/** Alias (User Manual Name) for EVADC_G1_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G1_Q2_QCTRL.
*/
#define	EVADC_G1QCTRL2	(EVADC_G1_Q2_QCTRL)

/** \brief  950, Queue 0 Input Register, Group 0 */
#define EVADC_G1_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020950u)

/** Alias (User Manual Name) for EVADC_G1_Q2_QINR.
* To use register names with standard convension, please use EVADC_G1_Q2_QINR.
*/
#define	EVADC_G1QINR2	(EVADC_G1_Q2_QINR)

/** \brief  944, Queue 0 Mode Register, Group 0 */
#define EVADC_G1_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020944u)

/** Alias (User Manual Name) for EVADC_G1_Q2_QMR.
* To use register names with standard convension, please use EVADC_G1_Q2_QMR.
*/
#define	EVADC_G1QMR2	(EVADC_G1_Q2_QMR)

/** \brief  948, Queue 0 Status Register, Group 0 */
#define EVADC_G1_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020948u)

/** Alias (User Manual Name) for EVADC_G1_Q2_QSR.
* To use register names with standard convension, please use EVADC_G1_Q2_QSR.
*/
#define	EVADC_G1QSR2	(EVADC_G1_Q2_QSR)

/** \brief  954, Queue 2 Status Register, Group 1 */
#define EVADC_G1_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0020954u)

/** Alias (User Manual Name) for EVADC_G1_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G1_Q0_QSR.
*/
#define	EVADC_G1TRCTR	(EVADC_G1_Q2_TRCTR)

/** \brief  958, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G1_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020958u)

/** Alias (User Manual Name) for EVADC_G1_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G1_Q2_REQTM.
*/
#define	EVADC_G1REQTM2	(EVADC_G1_Q2_REQTM)

/** \brief  95C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G1_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002095Cu)

/** Alias (User Manual Name) for EVADC_G1_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G1_Q2_REQTS.
*/
#define	EVADC_G1REQTS2	(EVADC_G1_Q2_REQTS)

/** \brief  A80, Group Result Control Register */
#define EVADC_G1_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A80u)

/** Alias (User Manual Name) for EVADC_G1_RCR0.
* To use register names with standard convension, please use EVADC_G1_RCR0.
*/
#define	EVADC_G1RCR0	(EVADC_G1_RCR0)

/** \brief  A84, Group Result Control Register */
#define EVADC_G1_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A84u)

/** Alias (User Manual Name) for EVADC_G1_RCR1.
* To use register names with standard convension, please use EVADC_G1_RCR1.
*/
#define	EVADC_G1RCR1	(EVADC_G1_RCR1)

/** \brief  AA8, Group Result Control Register */
#define EVADC_G1_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020AA8u)

/** Alias (User Manual Name) for EVADC_G1_RCR10.
* To use register names with standard convension, please use EVADC_G1_RCR10.
*/
#define	EVADC_G1RCR10	(EVADC_G1_RCR10)

/** \brief  AAC, Group Result Control Register */
#define EVADC_G1_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020AACu)

/** Alias (User Manual Name) for EVADC_G1_RCR11.
* To use register names with standard convension, please use EVADC_G1_RCR11.
*/
#define	EVADC_G1RCR11	(EVADC_G1_RCR11)

/** \brief  AB0, Group Result Control Register */
#define EVADC_G1_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020AB0u)

/** Alias (User Manual Name) for EVADC_G1_RCR12.
* To use register names with standard convension, please use EVADC_G1_RCR12.
*/
#define	EVADC_G1RCR12	(EVADC_G1_RCR12)

/** \brief  AB4, Group Result Control Register */
#define EVADC_G1_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020AB4u)

