Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G1_RCR13.
* To use register names with standard convension, please use EVADC_G1_RCR13.
*/
#define	EVADC_G1RCR13	(EVADC_G1_RCR13)

/** \brief  AB8, Group Result Control Register */
#define EVADC_G1_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020AB8u)

/** Alias (User Manual Name) for EVADC_G1_RCR14.
* To use register names with standard convension, please use EVADC_G1_RCR14.
*/
#define	EVADC_G1RCR14	(EVADC_G1_RCR14)

/** \brief  ABC, Group Result Control Register */
#define EVADC_G1_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020ABCu)

/** Alias (User Manual Name) for EVADC_G1_RCR15.
* To use register names with standard convension, please use EVADC_G1_RCR15.
*/
#define	EVADC_G1RCR15	(EVADC_G1_RCR15)

/** \brief  A88, Group Result Control Register */
#define EVADC_G1_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A88u)

/** Alias (User Manual Name) for EVADC_G1_RCR2.
* To use register names with standard convension, please use EVADC_G1_RCR2.
*/
#define	EVADC_G1RCR2	(EVADC_G1_RCR2)

/** \brief  A8C, Group Result Control Register */
#define EVADC_G1_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A8Cu)

/** Alias (User Manual Name) for EVADC_G1_RCR3.
* To use register names with standard convension, please use EVADC_G1_RCR3.
*/
#define	EVADC_G1RCR3	(EVADC_G1_RCR3)

/** \brief  A90, Group Result Control Register */
#define EVADC_G1_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A90u)

/** Alias (User Manual Name) for EVADC_G1_RCR4.
* To use register names with standard convension, please use EVADC_G1_RCR4.
*/
#define	EVADC_G1RCR4	(EVADC_G1_RCR4)

/** \brief  A94, Group Result Control Register */
#define EVADC_G1_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A94u)

/** Alias (User Manual Name) for EVADC_G1_RCR5.
* To use register names with standard convension, please use EVADC_G1_RCR5.
*/
#define	EVADC_G1RCR5	(EVADC_G1_RCR5)

/** \brief  A98, Group Result Control Register */
#define EVADC_G1_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A98u)

/** Alias (User Manual Name) for EVADC_G1_RCR6.
* To use register names with standard convension, please use EVADC_G1_RCR6.
*/
#define	EVADC_G1RCR6	(EVADC_G1_RCR6)

/** \brief  A9C, Group Result Control Register */
#define EVADC_G1_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020A9Cu)

/** Alias (User Manual Name) for EVADC_G1_RCR7.
* To use register names with standard convension, please use EVADC_G1_RCR7.
*/
#define	EVADC_G1RCR7	(EVADC_G1_RCR7)

/** \brief  AA0, Group Result Control Register */
#define EVADC_G1_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020AA0u)

/** Alias (User Manual Name) for EVADC_G1_RCR8.
* To use register names with standard convension, please use EVADC_G1_RCR8.
*/
#define	EVADC_G1RCR8	(EVADC_G1_RCR8)

/** \brief  AA4, Group Result Control Register */
#define EVADC_G1_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020AA4u)

/** Alias (User Manual Name) for EVADC_G1_RCR9.
* To use register names with standard convension, please use EVADC_G1_RCR9.
*/
#define	EVADC_G1RCR9	(EVADC_G1_RCR9)

/** \brief  994, Result Event Flag Clear Register, Group */
#define EVADC_G1_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0020994u)

/** Alias (User Manual Name) for EVADC_G1_REFCLR.
* To use register names with standard convension, please use EVADC_G1_REFCLR.
*/
#define	EVADC_G1REFCLR	(EVADC_G1_REFCLR)

/** \brief  984, Result Event Flag Register, Group */
#define EVADC_G1_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0020984u)

/** Alias (User Manual Name) for EVADC_G1_REFLAG.
* To use register names with standard convension, please use EVADC_G1_REFLAG.
*/
#define	EVADC_G1REFLAG	(EVADC_G1_REFLAG)

/** \brief  B00, Group Result Register */
#define EVADC_G1_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B00u)

/** Alias (User Manual Name) for EVADC_G1_RES0.
* To use register names with standard convension, please use EVADC_G1_RES0.
*/
#define	EVADC_G1RES0	(EVADC_G1_RES0)

/** \brief  B04, Group Result Register */
#define EVADC_G1_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B04u)

/** Alias (User Manual Name) for EVADC_G1_RES1.
* To use register names with standard convension, please use EVADC_G1_RES1.
*/
#define	EVADC_G1RES1	(EVADC_G1_RES1)

/** \brief  B28, Group Result Register */
#define EVADC_G1_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B28u)

/** Alias (User Manual Name) for EVADC_G1_RES10.
* To use register names with standard convension, please use EVADC_G1_RES10.
*/
#define	EVADC_G1RES10	(EVADC_G1_RES10)

/** \brief  B2C, Group Result Register */
#define EVADC_G1_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B2Cu)

/** Alias (User Manual Name) for EVADC_G1_RES11.
* To use register names with standard convension, please use EVADC_G1_RES11.
*/
#define	EVADC_G1RES11	(EVADC_G1_RES11)

/** \brief  B30, Group Result Register */
#define EVADC_G1_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B30u)

/** Alias (User Manual Name) for EVADC_G1_RES12.
* To use register names with standard convension, please use EVADC_G1_RES12.
*/
#define	EVADC_G1RES12	(EVADC_G1_RES12)

/** \brief  B34, Group Result Register */
#define EVADC_G1_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B34u)

/** Alias (User Manual Name) for EVADC_G1_RES13.
* To use register names with standard convension, please use EVADC_G1_RES13.
*/
#define	EVADC_G1RES13	(EVADC_G1_RES13)

/** \brief  B38, Group Result Register */
#define EVADC_G1_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B38u)

/** Alias (User Manual Name) for EVADC_G1_RES14.
* To use register names with standard convension, please use EVADC_G1_RES14.
*/
#define	EVADC_G1RES14	(EVADC_G1_RES14)

/** \brief  B3C, Group Result Register */
#define EVADC_G1_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B3Cu)

/** Alias (User Manual Name) for EVADC_G1_RES15.
* To use register names with standard convension, please use EVADC_G1_RES15.
*/
#define	EVADC_G1RES15	(EVADC_G1_RES15)

/** \brief  B08, Group Result Register */
#define EVADC_G1_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B08u)

