Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G1_RES2.
* To use register names with standard convension, please use EVADC_G1_RES2.
*/
#define	EVADC_G1RES2	(EVADC_G1_RES2)

/** \brief  B0C, Group Result Register */
#define EVADC_G1_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B0Cu)

/** Alias (User Manual Name) for EVADC_G1_RES3.
* To use register names with standard convension, please use EVADC_G1_RES3.
*/
#define	EVADC_G1RES3	(EVADC_G1_RES3)

/** \brief  B10, Group Result Register */
#define EVADC_G1_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B10u)

/** Alias (User Manual Name) for EVADC_G1_RES4.
* To use register names with standard convension, please use EVADC_G1_RES4.
*/
#define	EVADC_G1RES4	(EVADC_G1_RES4)

/** \brief  B14, Group Result Register */
#define EVADC_G1_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B14u)

/** Alias (User Manual Name) for EVADC_G1_RES5.
* To use register names with standard convension, please use EVADC_G1_RES5.
*/
#define	EVADC_G1RES5	(EVADC_G1_RES5)

/** \brief  B18, Group Result Register */
#define EVADC_G1_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B18u)

/** Alias (User Manual Name) for EVADC_G1_RES6.
* To use register names with standard convension, please use EVADC_G1_RES6.
*/
#define	EVADC_G1RES6	(EVADC_G1_RES6)

/** \brief  B1C, Group Result Register */
#define EVADC_G1_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B1Cu)

/** Alias (User Manual Name) for EVADC_G1_RES7.
* To use register names with standard convension, please use EVADC_G1_RES7.
*/
#define	EVADC_G1RES7	(EVADC_G1_RES7)

/** \brief  B20, Group Result Register */
#define EVADC_G1_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B20u)

/** Alias (User Manual Name) for EVADC_G1_RES8.
* To use register names with standard convension, please use EVADC_G1_RES8.
*/
#define	EVADC_G1RES8	(EVADC_G1_RES8)

/** \brief  B24, Group Result Register */
#define EVADC_G1_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020B24u)

/** Alias (User Manual Name) for EVADC_G1_RES9.
* To use register names with standard convension, please use EVADC_G1_RES9.
*/
#define	EVADC_G1RES9	(EVADC_G1_RES9)

/** \brief  B80, Group Result Reg., Debug */
#define EVADC_G1_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B80u)

/** Alias (User Manual Name) for EVADC_G1_RESD0.
* To use register names with standard convension, please use EVADC_G1_RESD0.
*/
#define	EVADC_G1RESD0	(EVADC_G1_RESD0)

/** \brief  B84, Group Result Reg., Debug */
#define EVADC_G1_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B84u)

/** Alias (User Manual Name) for EVADC_G1_RESD1.
* To use register names with standard convension, please use EVADC_G1_RESD1.
*/
#define	EVADC_G1RESD1	(EVADC_G1_RESD1)

/** \brief  BA8, Group Result Reg., Debug */
#define EVADC_G1_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BA8u)

/** Alias (User Manual Name) for EVADC_G1_RESD10.
* To use register names with standard convension, please use EVADC_G1_RESD10.
*/
#define	EVADC_G1RESD10	(EVADC_G1_RESD10)

/** \brief  BAC, Group Result Reg., Debug */
#define EVADC_G1_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BACu)

/** Alias (User Manual Name) for EVADC_G1_RESD11.
* To use register names with standard convension, please use EVADC_G1_RESD11.
*/
#define	EVADC_G1RESD11	(EVADC_G1_RESD11)

/** \brief  BB0, Group Result Reg., Debug */
#define EVADC_G1_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BB0u)

/** Alias (User Manual Name) for EVADC_G1_RESD12.
* To use register names with standard convension, please use EVADC_G1_RESD12.
*/
#define	EVADC_G1RESD12	(EVADC_G1_RESD12)

/** \brief  BB4, Group Result Reg., Debug */
#define EVADC_G1_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BB4u)

/** Alias (User Manual Name) for EVADC_G1_RESD13.
* To use register names with standard convension, please use EVADC_G1_RESD13.
*/
#define	EVADC_G1RESD13	(EVADC_G1_RESD13)

/** \brief  BB8, Group Result Reg., Debug */
#define EVADC_G1_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BB8u)

/** Alias (User Manual Name) for EVADC_G1_RESD14.
* To use register names with standard convension, please use EVADC_G1_RESD14.
*/
#define	EVADC_G1RESD14	(EVADC_G1_RESD14)

/** \brief  BBC, Group Result Reg., Debug */
#define EVADC_G1_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BBCu)

/** Alias (User Manual Name) for EVADC_G1_RESD15.
* To use register names with standard convension, please use EVADC_G1_RESD15.
*/
#define	EVADC_G1RESD15	(EVADC_G1_RESD15)

/** \brief  B88, Group Result Reg., Debug */
#define EVADC_G1_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B88u)

/** Alias (User Manual Name) for EVADC_G1_RESD2.
* To use register names with standard convension, please use EVADC_G1_RESD2.
*/
#define	EVADC_G1RESD2	(EVADC_G1_RESD2)

/** \brief  B8C, Group Result Reg., Debug */
#define EVADC_G1_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B8Cu)

/** Alias (User Manual Name) for EVADC_G1_RESD3.
* To use register names with standard convension, please use EVADC_G1_RESD3.
*/
#define	EVADC_G1RESD3	(EVADC_G1_RESD3)

/** \brief  B90, Group Result Reg., Debug */
#define EVADC_G1_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B90u)

/** Alias (User Manual Name) for EVADC_G1_RESD4.
* To use register names with standard convension, please use EVADC_G1_RESD4.
*/
#define	EVADC_G1RESD4	(EVADC_G1_RESD4)

/** \brief  B94, Group Result Reg., Debug */
#define EVADC_G1_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B94u)

/** Alias (User Manual Name) for EVADC_G1_RESD5.
* To use register names with standard convension, please use EVADC_G1_RESD5.
*/
#define	EVADC_G1RESD5	(EVADC_G1_RESD5)

/** \brief  B98, Group Result Reg., Debug */
#define EVADC_G1_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B98u)

/** Alias (User Manual Name) for EVADC_G1_RESD6.
* To use register names with standard convension, please use EVADC_G1_RESD6.
*/
#define	EVADC_G1RESD6	(EVADC_G1_RESD6)

/** \brief  B9C, Group Result Reg., Debug */
#define EVADC_G1_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020B9Cu)

/** Alias (User Manual Name) for EVADC_G1_RESD7.
* To use register names with standard convension, please use EVADC_G1_RESD7.
*/
#define	EVADC_G1RESD7	(EVADC_G1_RESD7)

/** \brief  BA0, Group Result Reg., Debug */
#define EVADC_G1_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BA0u)

/** Alias (User Manual Name) for EVADC_G1_RESD8.
* To use register names with standard convension, please use EVADC_G1_RESD8.
*/
#define	EVADC_G1RESD8	(EVADC_G1_RESD8)

/** \brief  BA4, Group Result Reg., Debug */
#define EVADC_G1_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020BA4u)

