Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G1_RESD9.
* To use register names with standard convension, please use EVADC_G1_RESD9.
*/
#define	EVADC_G1RESD9	(EVADC_G1_RESD9)

/** \brief  9B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G1_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00209B0u)

/** Alias (User Manual Name) for EVADC_G1_REVNP0.
* To use register names with standard convension, please use EVADC_G1_REVNP0.
*/
#define	EVADC_G1REVNP0	(EVADC_G1_REVNP0)

/** \brief  9B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G1_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00209B4u)

/** Alias (User Manual Name) for EVADC_G1_REVNP1.
* To use register names with standard convension, please use EVADC_G1_REVNP1.
*/
#define	EVADC_G1REVNP1	(EVADC_G1_REVNP1)

/** \brief  998, Source Event Flag Clear Reg., Group */
#define EVADC_G1_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0020998u)

/** Alias (User Manual Name) for EVADC_G1_SEFCLR.
* To use register names with standard convension, please use EVADC_G1_SEFCLR.
*/
#define	EVADC_G1SEFCLR	(EVADC_G1_SEFCLR)

/** \brief  988, Source Event Flag Register, Group */
#define EVADC_G1_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0020988u)

/** Alias (User Manual Name) for EVADC_G1_SEFLAG.
* To use register names with standard convension, please use EVADC_G1_SEFLAG.
*/
#define	EVADC_G1SEFLAG	(EVADC_G1_SEFLAG)

/** \brief  9C0, Source Event Node Pointer Reg., Group */
#define EVADC_G1_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00209C0u)

/** Alias (User Manual Name) for EVADC_G1_SEVNP.
* To use register names with standard convension, please use EVADC_G1_SEVNP.
*/
#define	EVADC_G1SEVNP	(EVADC_G1_SEVNP)

/** \brief  9C8, Service Request Software Activation Trigger, Group */
#define EVADC_G1_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00209C8u)

/** Alias (User Manual Name) for EVADC_G1_SRACT.
* To use register names with standard convension, please use EVADC_G1_SRACT.
*/
#define	EVADC_G1SRACT	(EVADC_G1_SRACT)

/** \brief  8C0, Synchronization Control Register, Group */
#define EVADC_G1_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00208C0u)

/** Alias (User Manual Name) for EVADC_G1_SYNCTR.
* To use register names with standard convension, please use EVADC_G1_SYNCTR.
*/
#define	EVADC_G1SYNCTR	(EVADC_G1_SYNCTR)

/** \brief  9F8, Valid Flag Register, Group */
#define EVADC_G1_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00209F8u)

/** Alias (User Manual Name) for EVADC_G1_VFR.
* To use register names with standard convension, please use EVADC_G1_VFR.
*/
#define	EVADC_G1VFR	(EVADC_G1_VFR)

/** \brief  CB0, Alias Register, Group */
#define EVADC_G2_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF0020CB0u)

/** Alias (User Manual Name) for EVADC_G2_ALIAS.
* To use register names with standard convension, please use EVADC_G2_ALIAS.
*/
#define	EVADC_G2ALIAS	(EVADC_G2_ALIAS)

/** \brief  C88, Analog Fct. Config. Register, Group */
#define EVADC_G2_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0020C88u)

/** Alias (User Manual Name) for EVADC_G2_ANCFG.
* To use register names with standard convension, please use EVADC_G2_ANCFG.
*/
#define	EVADC_G2ANCFG	(EVADC_G2_ANCFG)

/** \brief  C80, Arbitration Config. Register, Group */
#define EVADC_G2_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0020C80u)

/** Alias (User Manual Name) for EVADC_G2_ARBCFG.
* To use register names with standard convension, please use EVADC_G2_ARBCFG.
*/
#define	EVADC_G2ARBCFG	(EVADC_G2_ARBCFG)

/** \brief  C84, Arbitration Priority Register, Group */
#define EVADC_G2_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0020C84u)

/** Alias (User Manual Name) for EVADC_G2_ARBPR.
* To use register names with standard convension, please use EVADC_G2_ARBPR.
*/
#define	EVADC_G2ARBPR	(EVADC_G2_ARBPR)

/** \brief  CB8, Boundary Select Register, Group */
#define EVADC_G2_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF0020CB8u)

/** Alias (User Manual Name) for EVADC_G2_BOUND.
* To use register names with standard convension, please use EVADC_G2_BOUND.
*/
#define	EVADC_G2BOUND	(EVADC_G2_BOUND)

/** \brief  D90, Channel Event Flag Clear Register, Group */
#define EVADC_G2_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0020D90u)

/** Alias (User Manual Name) for EVADC_G2_CEFCLR.
* To use register names with standard convension, please use EVADC_G2_CEFCLR.
*/
#define	EVADC_G2CEFCLR	(EVADC_G2_CEFCLR)

/** \brief  D80, Channel Event Flag Register, Group */
#define EVADC_G2_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0020D80u)

/** Alias (User Manual Name) for EVADC_G2_CEFLAG.
* To use register names with standard convension, please use EVADC_G2_CEFLAG.
*/
#define	EVADC_G2CEFLAG	(EVADC_G2_CEFLAG)

/** \brief  DA0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G2_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF0020DA0u)

/** Alias (User Manual Name) for EVADC_G2_CEVNP0.
* To use register names with standard convension, please use EVADC_G2_CEVNP0.
*/
#define	EVADC_G2CEVNP0	(EVADC_G2_CEVNP0)

/** \brief  E00, Group, Channel Control Register */
#define EVADC_G2_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E00u)

/** Alias (User Manual Name) for EVADC_G2_CHCTR0.
* To use register names with standard convension, please use EVADC_G2_CHCTR0.
*/
#define	EVADC_G2CHCTR0	(EVADC_G2_CHCTR0)

/** \brief  E04, Group, Channel Control Register */
#define EVADC_G2_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E04u)

/** Alias (User Manual Name) for EVADC_G2_CHCTR1.
* To use register names with standard convension, please use EVADC_G2_CHCTR1.
*/
#define	EVADC_G2CHCTR1	(EVADC_G2_CHCTR1)

/** \brief  E08, Group, Channel Control Register */
#define EVADC_G2_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E08u)

/** Alias (User Manual Name) for EVADC_G2_CHCTR2.
* To use register names with standard convension, please use EVADC_G2_CHCTR2.
*/
#define	EVADC_G2CHCTR2	(EVADC_G2_CHCTR2)

/** \brief  E0C, Group, Channel Control Register */
#define EVADC_G2_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E0Cu)

/** Alias (User Manual Name) for EVADC_G2_CHCTR3.
* To use register names with standard convension, please use EVADC_G2_CHCTR3.
*/
#define	EVADC_G2CHCTR3	(EVADC_G2_CHCTR3)

/** \brief  E10, Group, Channel Control Register */
#define EVADC_G2_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E10u)

