Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G2_CHCTR4.
* To use register names with standard convension, please use EVADC_G2_CHCTR4.
*/
#define	EVADC_G2CHCTR4	(EVADC_G2_CHCTR4)

/** \brief  E14, Group, Channel Control Register */
#define EVADC_G2_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E14u)

/** Alias (User Manual Name) for EVADC_G2_CHCTR5.
* To use register names with standard convension, please use EVADC_G2_CHCTR5.
*/
#define	EVADC_G2CHCTR5	(EVADC_G2_CHCTR5)

/** \brief  E18, Group, Channel Control Register */
#define EVADC_G2_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E18u)

/** Alias (User Manual Name) for EVADC_G2_CHCTR6.
* To use register names with standard convension, please use EVADC_G2_CHCTR6.
*/
#define	EVADC_G2CHCTR6	(EVADC_G2_CHCTR6)

/** \brief  E1C, Group, Channel Control Register */
#define EVADC_G2_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0020E1Cu)

/** Alias (User Manual Name) for EVADC_G2_CHCTR7.
* To use register names with standard convension, please use EVADC_G2_CHCTR7.
*/
#define	EVADC_G2CHCTR7	(EVADC_G2_CHCTR7)

/** \brief  DF4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G2_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF0020DF4u)

/** Alias (User Manual Name) for EVADC_G2_EMUXCS.
* To use register names with standard convension, please use EVADC_G2_EMUXCS.
*/
#define	EVADC_G2EMUXCS	(EVADC_G2_EMUXCS)

/** \brief  DF0, External Multiplexer Control Reg., Group */
#define EVADC_G2_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF0020DF0u)

/** Alias (User Manual Name) for EVADC_G2_EMUXCTR.
* To use register names with standard convension, please use EVADC_G2_EMUXCTR.
*/
#define	EVADC_G2EMUXCTR	(EVADC_G2_EMUXCTR)

/** \brief  CA0, Input Class Reg0ster i, Group */
#define EVADC_G2_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0020CA0u)

/** Alias (User Manual Name) for EVADC_G2_ICLASS0.
* To use register names with standard convension, please use EVADC_G2_ICLASS0.
*/
#define	EVADC_G2ICLASS0	(EVADC_G2_ICLASS0)

/** \brief  CA4, Input Class Reg0ster i, Group */
#define EVADC_G2_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0020CA4u)

/** Alias (User Manual Name) for EVADC_G2_ICLASS1.
* To use register names with standard convension, please use EVADC_G2_ICLASS1.
*/
#define	EVADC_G2ICLASS1	(EVADC_G2_ICLASS1)

/** \brief  D0C, Queue 0 Register 0, Group 0 */
#define EVADC_G2_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0020D0Cu)

/** Alias (User Manual Name) for EVADC_G2_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G2_Q0_Q0R.
*/
#define	EVADC_G2Q0R0	(EVADC_G2_Q0_Q0R)

/** \brief  D00, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G2_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020D00u)

/** Alias (User Manual Name) for EVADC_G2_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G2_Q0_QCTRL.
*/
#define	EVADC_G2QCTRL0	(EVADC_G2_Q0_QCTRL)

/** \brief  D10, Queue 0 Input Register, Group 0 */
#define EVADC_G2_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020D10u)

/** Alias (User Manual Name) for EVADC_G2_Q0_QINR.
* To use register names with standard convension, please use EVADC_G2_Q0_QINR.
*/
#define	EVADC_G2QINR0	(EVADC_G2_Q0_QINR)

/** \brief  D04, Queue 0 Mode Register, Group 0 */
#define EVADC_G2_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020D04u)

/** Alias (User Manual Name) for EVADC_G2_Q0_QMR.
* To use register names with standard convension, please use EVADC_G2_Q0_QMR.
*/
#define	EVADC_G2QMR0	(EVADC_G2_Q0_QMR)

/** \brief  D08, Queue 0 Status Register, Group 0 */
#define EVADC_G2_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020D08u)

/** Alias (User Manual Name) for EVADC_G2_Q0_QSR.
* To use register names with standard convension, please use EVADC_G2_Q0_QSR.
*/
#define	EVADC_G2QSR0	(EVADC_G2_Q0_QSR)

/** \brief  D18, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G2_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020D18u)

/** Alias (User Manual Name) for EVADC_G2_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G2_Q0_REQTM.
*/
#define	EVADC_G2REQTM0	(EVADC_G2_Q0_REQTM)

/** \brief  D1C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G2_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0020D1Cu)

/** Alias (User Manual Name) for EVADC_G2_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G2_Q0_REQTS.
*/
#define	EVADC_G2REQTS0	(EVADC_G2_Q0_REQTS)

/** \brief  D2C, Queue 0 Register 0, Group 0 */
#define EVADC_G2_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0020D2Cu)

/** Alias (User Manual Name) for EVADC_G2_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G2_Q1_Q0R.
*/
#define	EVADC_G2Q0R1	(EVADC_G2_Q1_Q0R)

/** \brief  D20, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G2_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020D20u)

/** Alias (User Manual Name) for EVADC_G2_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G2_Q1_QCTRL.
*/
#define	EVADC_G2QCTRL1	(EVADC_G2_Q1_QCTRL)

/** \brief  D30, Queue 0 Input Register, Group 0 */
#define EVADC_G2_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020D30u)

/** Alias (User Manual Name) for EVADC_G2_Q1_QINR.
* To use register names with standard convension, please use EVADC_G2_Q1_QINR.
*/
#define	EVADC_G2QINR1	(EVADC_G2_Q1_QINR)

/** \brief  D24, Queue 0 Mode Register, Group 0 */
#define EVADC_G2_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020D24u)

/** Alias (User Manual Name) for EVADC_G2_Q1_QMR.
* To use register names with standard convension, please use EVADC_G2_Q1_QMR.
*/
#define	EVADC_G2QMR1	(EVADC_G2_Q1_QMR)

/** \brief  D28, Queue 0 Status Register, Group 0 */
#define EVADC_G2_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020D28u)

/** Alias (User Manual Name) for EVADC_G2_Q1_QSR.
* To use register names with standard convension, please use EVADC_G2_Q1_QSR.
*/
#define	EVADC_G2QSR1	(EVADC_G2_Q1_QSR)

