Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  D38, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G2_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020D38u)

/** Alias (User Manual Name) for EVADC_G2_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G2_Q1_REQTM.
*/
#define	EVADC_G2REQTM1	(EVADC_G2_Q1_REQTM)

/** \brief  D3C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G2_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0020D3Cu)

/** Alias (User Manual Name) for EVADC_G2_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G2_Q1_REQTS.
*/
#define	EVADC_G2REQTS1	(EVADC_G2_Q1_REQTS)

/** \brief  D4C, Queue 0 Register 0, Group 0 */
#define EVADC_G2_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0020D4Cu)

/** Alias (User Manual Name) for EVADC_G2_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G2_Q2_Q0R.
*/
#define	EVADC_G2Q0R2	(EVADC_G2_Q2_Q0R)

/** \brief  D40, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G2_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0020D40u)

/** Alias (User Manual Name) for EVADC_G2_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G2_Q2_QCTRL.
*/
#define	EVADC_G2QCTRL2	(EVADC_G2_Q2_QCTRL)

/** \brief  D50, Queue 0 Input Register, Group 0 */
#define EVADC_G2_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0020D50u)

/** Alias (User Manual Name) for EVADC_G2_Q2_QINR.
* To use register names with standard convension, please use EVADC_G2_Q2_QINR.
*/
#define	EVADC_G2QINR2	(EVADC_G2_Q2_QINR)

/** \brief  D44, Queue 0 Mode Register, Group 0 */
#define EVADC_G2_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0020D44u)

/** Alias (User Manual Name) for EVADC_G2_Q2_QMR.
* To use register names with standard convension, please use EVADC_G2_Q2_QMR.
*/
#define	EVADC_G2QMR2	(EVADC_G2_Q2_QMR)

/** \brief  D48, Queue 0 Status Register, Group 0 */
#define EVADC_G2_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0020D48u)

/** Alias (User Manual Name) for EVADC_G2_Q2_QSR.
* To use register names with standard convension, please use EVADC_G2_Q2_QSR.
*/
#define	EVADC_G2QSR2	(EVADC_G2_Q2_QSR)

/** \brief  D54, Queue 2 Status Register, Group 2 */
#define EVADC_G2_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0020D54u)

/** Alias (User Manual Name) for EVADC_G2_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G2_Q0_QSR.
*/
#define	EVADC_G2TRCTR	(EVADC_G2_Q2_TRCTR)

/** \brief  D58, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G2_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0020D58u)

/** Alias (User Manual Name) for EVADC_G2_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G2_Q2_REQTM.
*/
#define	EVADC_G2REQTM2	(EVADC_G2_Q2_REQTM)

/** \brief  D5C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G2_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0020D5Cu)

/** Alias (User Manual Name) for EVADC_G2_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G2_Q2_REQTS.
*/
#define	EVADC_G2REQTS2	(EVADC_G2_Q2_REQTS)

/** \brief  E80, Group Result Control Register */
#define EVADC_G2_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E80u)

/** Alias (User Manual Name) for EVADC_G2_RCR0.
* To use register names with standard convension, please use EVADC_G2_RCR0.
*/
#define	EVADC_G2RCR0	(EVADC_G2_RCR0)

/** \brief  E84, Group Result Control Register */
#define EVADC_G2_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E84u)

/** Alias (User Manual Name) for EVADC_G2_RCR1.
* To use register names with standard convension, please use EVADC_G2_RCR1.
*/
#define	EVADC_G2RCR1	(EVADC_G2_RCR1)

/** \brief  EA8, Group Result Control Register */
#define EVADC_G2_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EA8u)

/** Alias (User Manual Name) for EVADC_G2_RCR10.
* To use register names with standard convension, please use EVADC_G2_RCR10.
*/
#define	EVADC_G2RCR10	(EVADC_G2_RCR10)

/** \brief  EAC, Group Result Control Register */
#define EVADC_G2_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EACu)

/** Alias (User Manual Name) for EVADC_G2_RCR11.
* To use register names with standard convension, please use EVADC_G2_RCR11.
*/
#define	EVADC_G2RCR11	(EVADC_G2_RCR11)

/** \brief  EB0, Group Result Control Register */
#define EVADC_G2_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EB0u)

/** Alias (User Manual Name) for EVADC_G2_RCR12.
* To use register names with standard convension, please use EVADC_G2_RCR12.
*/
#define	EVADC_G2RCR12	(EVADC_G2_RCR12)

/** \brief  EB4, Group Result Control Register */
#define EVADC_G2_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EB4u)

/** Alias (User Manual Name) for EVADC_G2_RCR13.
* To use register names with standard convension, please use EVADC_G2_RCR13.
*/
#define	EVADC_G2RCR13	(EVADC_G2_RCR13)

/** \brief  EB8, Group Result Control Register */
#define EVADC_G2_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EB8u)

/** Alias (User Manual Name) for EVADC_G2_RCR14.
* To use register names with standard convension, please use EVADC_G2_RCR14.
*/
#define	EVADC_G2RCR14	(EVADC_G2_RCR14)

/** \brief  EBC, Group Result Control Register */
#define EVADC_G2_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EBCu)

/** Alias (User Manual Name) for EVADC_G2_RCR15.
* To use register names with standard convension, please use EVADC_G2_RCR15.
*/
#define	EVADC_G2RCR15	(EVADC_G2_RCR15)

/** \brief  E88, Group Result Control Register */
#define EVADC_G2_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E88u)

/** Alias (User Manual Name) for EVADC_G2_RCR2.
* To use register names with standard convension, please use EVADC_G2_RCR2.
*/
#define	EVADC_G2RCR2	(EVADC_G2_RCR2)

/** \brief  E8C, Group Result Control Register */
#define EVADC_G2_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E8Cu)

/** Alias (User Manual Name) for EVADC_G2_RCR3.
* To use register names with standard convension, please use EVADC_G2_RCR3.
*/
#define	EVADC_G2RCR3	(EVADC_G2_RCR3)

/** \brief  E90, Group Result Control Register */
#define EVADC_G2_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E90u)

