Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G2_RCR4.
* To use register names with standard convension, please use EVADC_G2_RCR4.
*/
#define	EVADC_G2RCR4	(EVADC_G2_RCR4)

/** \brief  E94, Group Result Control Register */
#define EVADC_G2_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E94u)

/** Alias (User Manual Name) for EVADC_G2_RCR5.
* To use register names with standard convension, please use EVADC_G2_RCR5.
*/
#define	EVADC_G2RCR5	(EVADC_G2_RCR5)

/** \brief  E98, Group Result Control Register */
#define EVADC_G2_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E98u)

/** Alias (User Manual Name) for EVADC_G2_RCR6.
* To use register names with standard convension, please use EVADC_G2_RCR6.
*/
#define	EVADC_G2RCR6	(EVADC_G2_RCR6)

/** \brief  E9C, Group Result Control Register */
#define EVADC_G2_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020E9Cu)

/** Alias (User Manual Name) for EVADC_G2_RCR7.
* To use register names with standard convension, please use EVADC_G2_RCR7.
*/
#define	EVADC_G2RCR7	(EVADC_G2_RCR7)

/** \brief  EA0, Group Result Control Register */
#define EVADC_G2_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EA0u)

/** Alias (User Manual Name) for EVADC_G2_RCR8.
* To use register names with standard convension, please use EVADC_G2_RCR8.
*/
#define	EVADC_G2RCR8	(EVADC_G2_RCR8)

/** \brief  EA4, Group Result Control Register */
#define EVADC_G2_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0020EA4u)

/** Alias (User Manual Name) for EVADC_G2_RCR9.
* To use register names with standard convension, please use EVADC_G2_RCR9.
*/
#define	EVADC_G2RCR9	(EVADC_G2_RCR9)

/** \brief  D94, Result Event Flag Clear Register, Group */
#define EVADC_G2_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0020D94u)

/** Alias (User Manual Name) for EVADC_G2_REFCLR.
* To use register names with standard convension, please use EVADC_G2_REFCLR.
*/
#define	EVADC_G2REFCLR	(EVADC_G2_REFCLR)

/** \brief  D84, Result Event Flag Register, Group */
#define EVADC_G2_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0020D84u)

/** Alias (User Manual Name) for EVADC_G2_REFLAG.
* To use register names with standard convension, please use EVADC_G2_REFLAG.
*/
#define	EVADC_G2REFLAG	(EVADC_G2_REFLAG)

/** \brief  F00, Group Result Register */
#define EVADC_G2_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F00u)

/** Alias (User Manual Name) for EVADC_G2_RES0.
* To use register names with standard convension, please use EVADC_G2_RES0.
*/
#define	EVADC_G2RES0	(EVADC_G2_RES0)

/** \brief  F04, Group Result Register */
#define EVADC_G2_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F04u)

/** Alias (User Manual Name) for EVADC_G2_RES1.
* To use register names with standard convension, please use EVADC_G2_RES1.
*/
#define	EVADC_G2RES1	(EVADC_G2_RES1)

/** \brief  F28, Group Result Register */
#define EVADC_G2_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F28u)

/** Alias (User Manual Name) for EVADC_G2_RES10.
* To use register names with standard convension, please use EVADC_G2_RES10.
*/
#define	EVADC_G2RES10	(EVADC_G2_RES10)

/** \brief  F2C, Group Result Register */
#define EVADC_G2_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F2Cu)

/** Alias (User Manual Name) for EVADC_G2_RES11.
* To use register names with standard convension, please use EVADC_G2_RES11.
*/
#define	EVADC_G2RES11	(EVADC_G2_RES11)

/** \brief  F30, Group Result Register */
#define EVADC_G2_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F30u)

/** Alias (User Manual Name) for EVADC_G2_RES12.
* To use register names with standard convension, please use EVADC_G2_RES12.
*/
#define	EVADC_G2RES12	(EVADC_G2_RES12)

/** \brief  F34, Group Result Register */
#define EVADC_G2_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F34u)

/** Alias (User Manual Name) for EVADC_G2_RES13.
* To use register names with standard convension, please use EVADC_G2_RES13.
*/
#define	EVADC_G2RES13	(EVADC_G2_RES13)

/** \brief  F38, Group Result Register */
#define EVADC_G2_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F38u)

/** Alias (User Manual Name) for EVADC_G2_RES14.
* To use register names with standard convension, please use EVADC_G2_RES14.
*/
#define	EVADC_G2RES14	(EVADC_G2_RES14)

/** \brief  F3C, Group Result Register */
#define EVADC_G2_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F3Cu)

/** Alias (User Manual Name) for EVADC_G2_RES15.
* To use register names with standard convension, please use EVADC_G2_RES15.
*/
#define	EVADC_G2RES15	(EVADC_G2_RES15)

/** \brief  F08, Group Result Register */
#define EVADC_G2_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F08u)

/** Alias (User Manual Name) for EVADC_G2_RES2.
* To use register names with standard convension, please use EVADC_G2_RES2.
*/
#define	EVADC_G2RES2	(EVADC_G2_RES2)

/** \brief  F0C, Group Result Register */
#define EVADC_G2_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F0Cu)

/** Alias (User Manual Name) for EVADC_G2_RES3.
* To use register names with standard convension, please use EVADC_G2_RES3.
*/
#define	EVADC_G2RES3	(EVADC_G2_RES3)

/** \brief  F10, Group Result Register */
#define EVADC_G2_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F10u)

/** Alias (User Manual Name) for EVADC_G2_RES4.
* To use register names with standard convension, please use EVADC_G2_RES4.
*/
#define	EVADC_G2RES4	(EVADC_G2_RES4)

/** \brief  F14, Group Result Register */
#define EVADC_G2_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F14u)

/** Alias (User Manual Name) for EVADC_G2_RES5.
* To use register names with standard convension, please use EVADC_G2_RES5.
*/
#define	EVADC_G2RES5	(EVADC_G2_RES5)

/** \brief  F18, Group Result Register */
#define EVADC_G2_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F18u)

/** Alias (User Manual Name) for EVADC_G2_RES6.
* To use register names with standard convension, please use EVADC_G2_RES6.
*/
#define	EVADC_G2RES6	(EVADC_G2_RES6)

