Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  F1C, Group Result Register */
#define EVADC_G2_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F1Cu)

/** Alias (User Manual Name) for EVADC_G2_RES7.
* To use register names with standard convension, please use EVADC_G2_RES7.
*/
#define	EVADC_G2RES7	(EVADC_G2_RES7)

/** \brief  F20, Group Result Register */
#define EVADC_G2_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F20u)

/** Alias (User Manual Name) for EVADC_G2_RES8.
* To use register names with standard convension, please use EVADC_G2_RES8.
*/
#define	EVADC_G2RES8	(EVADC_G2_RES8)

/** \brief  F24, Group Result Register */
#define EVADC_G2_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0020F24u)

/** Alias (User Manual Name) for EVADC_G2_RES9.
* To use register names with standard convension, please use EVADC_G2_RES9.
*/
#define	EVADC_G2RES9	(EVADC_G2_RES9)

/** \brief  F80, Group Result Reg., Debug */
#define EVADC_G2_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F80u)

/** Alias (User Manual Name) for EVADC_G2_RESD0.
* To use register names with standard convension, please use EVADC_G2_RESD0.
*/
#define	EVADC_G2RESD0	(EVADC_G2_RESD0)

/** \brief  F84, Group Result Reg., Debug */
#define EVADC_G2_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F84u)

/** Alias (User Manual Name) for EVADC_G2_RESD1.
* To use register names with standard convension, please use EVADC_G2_RESD1.
*/
#define	EVADC_G2RESD1	(EVADC_G2_RESD1)

/** \brief  FA8, Group Result Reg., Debug */
#define EVADC_G2_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FA8u)

/** Alias (User Manual Name) for EVADC_G2_RESD10.
* To use register names with standard convension, please use EVADC_G2_RESD10.
*/
#define	EVADC_G2RESD10	(EVADC_G2_RESD10)

/** \brief  FAC, Group Result Reg., Debug */
#define EVADC_G2_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FACu)

/** Alias (User Manual Name) for EVADC_G2_RESD11.
* To use register names with standard convension, please use EVADC_G2_RESD11.
*/
#define	EVADC_G2RESD11	(EVADC_G2_RESD11)

/** \brief  FB0, Group Result Reg., Debug */
#define EVADC_G2_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FB0u)

/** Alias (User Manual Name) for EVADC_G2_RESD12.
* To use register names with standard convension, please use EVADC_G2_RESD12.
*/
#define	EVADC_G2RESD12	(EVADC_G2_RESD12)

/** \brief  FB4, Group Result Reg., Debug */
#define EVADC_G2_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FB4u)

/** Alias (User Manual Name) for EVADC_G2_RESD13.
* To use register names with standard convension, please use EVADC_G2_RESD13.
*/
#define	EVADC_G2RESD13	(EVADC_G2_RESD13)

/** \brief  FB8, Group Result Reg., Debug */
#define EVADC_G2_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FB8u)

/** Alias (User Manual Name) for EVADC_G2_RESD14.
* To use register names with standard convension, please use EVADC_G2_RESD14.
*/
#define	EVADC_G2RESD14	(EVADC_G2_RESD14)

/** \brief  FBC, Group Result Reg., Debug */
#define EVADC_G2_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FBCu)

/** Alias (User Manual Name) for EVADC_G2_RESD15.
* To use register names with standard convension, please use EVADC_G2_RESD15.
*/
#define	EVADC_G2RESD15	(EVADC_G2_RESD15)

/** \brief  F88, Group Result Reg., Debug */
#define EVADC_G2_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F88u)

/** Alias (User Manual Name) for EVADC_G2_RESD2.
* To use register names with standard convension, please use EVADC_G2_RESD2.
*/
#define	EVADC_G2RESD2	(EVADC_G2_RESD2)

/** \brief  F8C, Group Result Reg., Debug */
#define EVADC_G2_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F8Cu)

/** Alias (User Manual Name) for EVADC_G2_RESD3.
* To use register names with standard convension, please use EVADC_G2_RESD3.
*/
#define	EVADC_G2RESD3	(EVADC_G2_RESD3)

/** \brief  F90, Group Result Reg., Debug */
#define EVADC_G2_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F90u)

/** Alias (User Manual Name) for EVADC_G2_RESD4.
* To use register names with standard convension, please use EVADC_G2_RESD4.
*/
#define	EVADC_G2RESD4	(EVADC_G2_RESD4)

/** \brief  F94, Group Result Reg., Debug */
#define EVADC_G2_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F94u)

/** Alias (User Manual Name) for EVADC_G2_RESD5.
* To use register names with standard convension, please use EVADC_G2_RESD5.
*/
#define	EVADC_G2RESD5	(EVADC_G2_RESD5)

/** \brief  F98, Group Result Reg., Debug */
#define EVADC_G2_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F98u)

/** Alias (User Manual Name) for EVADC_G2_RESD6.
* To use register names with standard convension, please use EVADC_G2_RESD6.
*/
#define	EVADC_G2RESD6	(EVADC_G2_RESD6)

/** \brief  F9C, Group Result Reg., Debug */
#define EVADC_G2_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020F9Cu)

/** Alias (User Manual Name) for EVADC_G2_RESD7.
* To use register names with standard convension, please use EVADC_G2_RESD7.
*/
#define	EVADC_G2RESD7	(EVADC_G2_RESD7)

/** \brief  FA0, Group Result Reg., Debug */
#define EVADC_G2_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FA0u)

/** Alias (User Manual Name) for EVADC_G2_RESD8.
* To use register names with standard convension, please use EVADC_G2_RESD8.
*/
#define	EVADC_G2RESD8	(EVADC_G2_RESD8)

/** \brief  FA4, Group Result Reg., Debug */
#define EVADC_G2_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0020FA4u)

/** Alias (User Manual Name) for EVADC_G2_RESD9.
* To use register names with standard convension, please use EVADC_G2_RESD9.
*/
#define	EVADC_G2RESD9	(EVADC_G2_RESD9)

/** \brief  DB0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G2_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF0020DB0u)

/** Alias (User Manual Name) for EVADC_G2_REVNP0.
* To use register names with standard convension, please use EVADC_G2_REVNP0.
*/
#define	EVADC_G2REVNP0	(EVADC_G2_REVNP0)

/** \brief  DB4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G2_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF0020DB4u)

/** Alias (User Manual Name) for EVADC_G2_REVNP1.
* To use register names with standard convension, please use EVADC_G2_REVNP1.
*/
#define	EVADC_G2REVNP1	(EVADC_G2_REVNP1)

/** \brief  D98, Source Event Flag Clear Reg., Group */
#define EVADC_G2_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0020D98u)

/** Alias (User Manual Name) for EVADC_G2_SEFCLR.
* To use register names with standard convension, please use EVADC_G2_SEFCLR.
*/
#define	EVADC_G2SEFCLR	(EVADC_G2_SEFCLR)

/** \brief  D88, Source Event Flag Register, Group */
#define EVADC_G2_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0020D88u)

