Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G2_SEFLAG.
* To use register names with standard convension, please use EVADC_G2_SEFLAG.
*/
#define	EVADC_G2SEFLAG	(EVADC_G2_SEFLAG)

/** \brief  DC0, Source Event Node Pointer Reg., Group */
#define EVADC_G2_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF0020DC0u)

/** Alias (User Manual Name) for EVADC_G2_SEVNP.
* To use register names with standard convension, please use EVADC_G2_SEVNP.
*/
#define	EVADC_G2SEVNP	(EVADC_G2_SEVNP)

/** \brief  DC8, Service Request Software Activation Trigger, Group */
#define EVADC_G2_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF0020DC8u)

/** Alias (User Manual Name) for EVADC_G2_SRACT.
* To use register names with standard convension, please use EVADC_G2_SRACT.
*/
#define	EVADC_G2SRACT	(EVADC_G2_SRACT)

/** \brief  CC0, Synchronization Control Register, Group */
#define EVADC_G2_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF0020CC0u)

/** Alias (User Manual Name) for EVADC_G2_SYNCTR.
* To use register names with standard convension, please use EVADC_G2_SYNCTR.
*/
#define	EVADC_G2SYNCTR	(EVADC_G2_SYNCTR)

/** \brief  DF8, Valid Flag Register, Group */
#define EVADC_G2_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF0020DF8u)

/** Alias (User Manual Name) for EVADC_G2_VFR.
* To use register names with standard convension, please use EVADC_G2_VFR.
*/
#define	EVADC_G2VFR	(EVADC_G2_VFR)

/** \brief  10B0, Alias Register, Group */
#define EVADC_G3_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00210B0u)

/** Alias (User Manual Name) for EVADC_G3_ALIAS.
* To use register names with standard convension, please use EVADC_G3_ALIAS.
*/
#define	EVADC_G3ALIAS	(EVADC_G3_ALIAS)

/** \brief  1088, Analog Fct. Config. Register, Group */
#define EVADC_G3_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0021088u)

/** Alias (User Manual Name) for EVADC_G3_ANCFG.
* To use register names with standard convension, please use EVADC_G3_ANCFG.
*/
#define	EVADC_G3ANCFG	(EVADC_G3_ANCFG)

/** \brief  1080, Arbitration Config. Register, Group */
#define EVADC_G3_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0021080u)

/** Alias (User Manual Name) for EVADC_G3_ARBCFG.
* To use register names with standard convension, please use EVADC_G3_ARBCFG.
*/
#define	EVADC_G3ARBCFG	(EVADC_G3_ARBCFG)

/** \brief  1084, Arbitration Priority Register, Group */
#define EVADC_G3_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0021084u)

/** Alias (User Manual Name) for EVADC_G3_ARBPR.
* To use register names with standard convension, please use EVADC_G3_ARBPR.
*/
#define	EVADC_G3ARBPR	(EVADC_G3_ARBPR)

/** \brief  10B8, Boundary Select Register, Group */
#define EVADC_G3_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00210B8u)

/** Alias (User Manual Name) for EVADC_G3_BOUND.
* To use register names with standard convension, please use EVADC_G3_BOUND.
*/
#define	EVADC_G3BOUND	(EVADC_G3_BOUND)

/** \brief  1190, Channel Event Flag Clear Register, Group */
#define EVADC_G3_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0021190u)

/** Alias (User Manual Name) for EVADC_G3_CEFCLR.
* To use register names with standard convension, please use EVADC_G3_CEFCLR.
*/
#define	EVADC_G3CEFCLR	(EVADC_G3_CEFCLR)

/** \brief  1180, Channel Event Flag Register, Group */
#define EVADC_G3_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0021180u)

/** Alias (User Manual Name) for EVADC_G3_CEFLAG.
* To use register names with standard convension, please use EVADC_G3_CEFLAG.
*/
#define	EVADC_G3CEFLAG	(EVADC_G3_CEFLAG)

/** \brief  11A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G3_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00211A0u)

/** Alias (User Manual Name) for EVADC_G3_CEVNP0.
* To use register names with standard convension, please use EVADC_G3_CEVNP0.
*/
#define	EVADC_G3CEVNP0	(EVADC_G3_CEVNP0)

/** \brief  1200, Group, Channel Control Register */
#define EVADC_G3_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021200u)

/** Alias (User Manual Name) for EVADC_G3_CHCTR0.
* To use register names with standard convension, please use EVADC_G3_CHCTR0.
*/
#define	EVADC_G3CHCTR0	(EVADC_G3_CHCTR0)

/** \brief  1204, Group, Channel Control Register */
#define EVADC_G3_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021204u)

/** Alias (User Manual Name) for EVADC_G3_CHCTR1.
* To use register names with standard convension, please use EVADC_G3_CHCTR1.
*/
#define	EVADC_G3CHCTR1	(EVADC_G3_CHCTR1)

/** \brief  1208, Group, Channel Control Register */
#define EVADC_G3_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021208u)

/** Alias (User Manual Name) for EVADC_G3_CHCTR2.
* To use register names with standard convension, please use EVADC_G3_CHCTR2.
*/
#define	EVADC_G3CHCTR2	(EVADC_G3_CHCTR2)

/** \brief  120C, Group, Channel Control Register */
#define EVADC_G3_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002120Cu)

/** Alias (User Manual Name) for EVADC_G3_CHCTR3.
* To use register names with standard convension, please use EVADC_G3_CHCTR3.
*/
#define	EVADC_G3CHCTR3	(EVADC_G3_CHCTR3)

/** \brief  1210, Group, Channel Control Register */
#define EVADC_G3_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021210u)

/** Alias (User Manual Name) for EVADC_G3_CHCTR4.
* To use register names with standard convension, please use EVADC_G3_CHCTR4.
*/
#define	EVADC_G3CHCTR4	(EVADC_G3_CHCTR4)

/** \brief  1214, Group, Channel Control Register */
#define EVADC_G3_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021214u)

/** Alias (User Manual Name) for EVADC_G3_CHCTR5.
* To use register names with standard convension, please use EVADC_G3_CHCTR5.
*/
#define	EVADC_G3CHCTR5	(EVADC_G3_CHCTR5)

/** \brief  1218, Group, Channel Control Register */
#define EVADC_G3_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021218u)

/** Alias (User Manual Name) for EVADC_G3_CHCTR6.
* To use register names with standard convension, please use EVADC_G3_CHCTR6.
*/
#define	EVADC_G3CHCTR6	(EVADC_G3_CHCTR6)

/** \brief  121C, Group, Channel Control Register */
#define EVADC_G3_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002121Cu)

