Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G3_CHCTR7.
* To use register names with standard convension, please use EVADC_G3_CHCTR7.
*/
#define	EVADC_G3CHCTR7	(EVADC_G3_CHCTR7)

/** \brief  11F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G3_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00211F4u)

/** Alias (User Manual Name) for EVADC_G3_EMUXCS.
* To use register names with standard convension, please use EVADC_G3_EMUXCS.
*/
#define	EVADC_G3EMUXCS	(EVADC_G3_EMUXCS)

/** \brief  11F0, External Multiplexer Control Reg., Group */
#define EVADC_G3_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00211F0u)

/** Alias (User Manual Name) for EVADC_G3_EMUXCTR.
* To use register names with standard convension, please use EVADC_G3_EMUXCTR.
*/
#define	EVADC_G3EMUXCTR	(EVADC_G3_EMUXCTR)

/** \brief  10A0, Input Class Reg0ster i, Group */
#define EVADC_G3_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00210A0u)

/** Alias (User Manual Name) for EVADC_G3_ICLASS0.
* To use register names with standard convension, please use EVADC_G3_ICLASS0.
*/
#define	EVADC_G3ICLASS0	(EVADC_G3_ICLASS0)

/** \brief  10A4, Input Class Reg0ster i, Group */
#define EVADC_G3_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00210A4u)

/** Alias (User Manual Name) for EVADC_G3_ICLASS1.
* To use register names with standard convension, please use EVADC_G3_ICLASS1.
*/
#define	EVADC_G3ICLASS1	(EVADC_G3_ICLASS1)

/** \brief  110C, Queue 0 Register 0, Group 0 */
#define EVADC_G3_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002110Cu)

/** Alias (User Manual Name) for EVADC_G3_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G3_Q0_Q0R.
*/
#define	EVADC_G3Q0R0	(EVADC_G3_Q0_Q0R)

/** \brief  1100, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G3_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021100u)

/** Alias (User Manual Name) for EVADC_G3_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G3_Q0_QCTRL.
*/
#define	EVADC_G3QCTRL0	(EVADC_G3_Q0_QCTRL)

/** \brief  1110, Queue 0 Input Register, Group 0 */
#define EVADC_G3_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021110u)

/** Alias (User Manual Name) for EVADC_G3_Q0_QINR.
* To use register names with standard convension, please use EVADC_G3_Q0_QINR.
*/
#define	EVADC_G3QINR0	(EVADC_G3_Q0_QINR)

/** \brief  1104, Queue 0 Mode Register, Group 0 */
#define EVADC_G3_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021104u)

/** Alias (User Manual Name) for EVADC_G3_Q0_QMR.
* To use register names with standard convension, please use EVADC_G3_Q0_QMR.
*/
#define	EVADC_G3QMR0	(EVADC_G3_Q0_QMR)

/** \brief  1108, Queue 0 Status Register, Group 0 */
#define EVADC_G3_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021108u)

/** Alias (User Manual Name) for EVADC_G3_Q0_QSR.
* To use register names with standard convension, please use EVADC_G3_Q0_QSR.
*/
#define	EVADC_G3QSR0	(EVADC_G3_Q0_QSR)

/** \brief  1118, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G3_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021118u)

/** Alias (User Manual Name) for EVADC_G3_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G3_Q0_REQTM.
*/
#define	EVADC_G3REQTM0	(EVADC_G3_Q0_REQTM)

/** \brief  111C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G3_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002111Cu)

/** Alias (User Manual Name) for EVADC_G3_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G3_Q0_REQTS.
*/
#define	EVADC_G3REQTS0	(EVADC_G3_Q0_REQTS)

/** \brief  112C, Queue 0 Register 0, Group 0 */
#define EVADC_G3_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002112Cu)

/** Alias (User Manual Name) for EVADC_G3_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G3_Q1_Q0R.
*/
#define	EVADC_G3Q0R1	(EVADC_G3_Q1_Q0R)

/** \brief  1120, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G3_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021120u)

/** Alias (User Manual Name) for EVADC_G3_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G3_Q1_QCTRL.
*/
#define	EVADC_G3QCTRL1	(EVADC_G3_Q1_QCTRL)

/** \brief  1130, Queue 0 Input Register, Group 0 */
#define EVADC_G3_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021130u)

/** Alias (User Manual Name) for EVADC_G3_Q1_QINR.
* To use register names with standard convension, please use EVADC_G3_Q1_QINR.
*/
#define	EVADC_G3QINR1	(EVADC_G3_Q1_QINR)

/** \brief  1124, Queue 0 Mode Register, Group 0 */
#define EVADC_G3_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021124u)

/** Alias (User Manual Name) for EVADC_G3_Q1_QMR.
* To use register names with standard convension, please use EVADC_G3_Q1_QMR.
*/
#define	EVADC_G3QMR1	(EVADC_G3_Q1_QMR)

/** \brief  1128, Queue 0 Status Register, Group 0 */
#define EVADC_G3_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021128u)

/** Alias (User Manual Name) for EVADC_G3_Q1_QSR.
* To use register names with standard convension, please use EVADC_G3_Q1_QSR.
*/
#define	EVADC_G3QSR1	(EVADC_G3_Q1_QSR)

/** \brief  1138, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G3_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021138u)

/** Alias (User Manual Name) for EVADC_G3_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G3_Q1_REQTM.
*/
#define	EVADC_G3REQTM1	(EVADC_G3_Q1_REQTM)

/** \brief  113C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G3_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002113Cu)

/** Alias (User Manual Name) for EVADC_G3_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G3_Q1_REQTS.
*/
#define	EVADC_G3REQTS1	(EVADC_G3_Q1_REQTS)

/** \brief  114C, Queue 0 Register 0, Group 0 */
#define EVADC_G3_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002114Cu)

/** Alias (User Manual Name) for EVADC_G3_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G3_Q2_Q0R.
*/
#define	EVADC_G3Q0R2	(EVADC_G3_Q2_Q0R)

/** \brief  1140, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G3_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021140u)

/** Alias (User Manual Name) for EVADC_G3_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G3_Q2_QCTRL.
*/
#define	EVADC_G3QCTRL2	(EVADC_G3_Q2_QCTRL)

