Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  1150, Queue 0 Input Register, Group 0 */
#define EVADC_G3_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021150u)

/** Alias (User Manual Name) for EVADC_G3_Q2_QINR.
* To use register names with standard convension, please use EVADC_G3_Q2_QINR.
*/
#define	EVADC_G3QINR2	(EVADC_G3_Q2_QINR)

/** \brief  1144, Queue 0 Mode Register, Group 0 */
#define EVADC_G3_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021144u)

/** Alias (User Manual Name) for EVADC_G3_Q2_QMR.
* To use register names with standard convension, please use EVADC_G3_Q2_QMR.
*/
#define	EVADC_G3QMR2	(EVADC_G3_Q2_QMR)

/** \brief  1148, Queue 0 Status Register, Group 0 */
#define EVADC_G3_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021148u)

/** Alias (User Manual Name) for EVADC_G3_Q2_QSR.
* To use register names with standard convension, please use EVADC_G3_Q2_QSR.
*/
#define	EVADC_G3QSR2	(EVADC_G3_Q2_QSR)

/** \brief  1154, Queue 2 Status Register, Group 3 */
#define EVADC_G3_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0021154u)

/** Alias (User Manual Name) for EVADC_G3_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G3_Q0_QSR.
*/
#define	EVADC_G3TRCTR	(EVADC_G3_Q2_TRCTR)

/** \brief  1158, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G3_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021158u)

/** Alias (User Manual Name) for EVADC_G3_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G3_Q2_REQTM.
*/
#define	EVADC_G3REQTM2	(EVADC_G3_Q2_REQTM)

/** \brief  115C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G3_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002115Cu)

/** Alias (User Manual Name) for EVADC_G3_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G3_Q2_REQTS.
*/
#define	EVADC_G3REQTS2	(EVADC_G3_Q2_REQTS)

/** \brief  1280, Group Result Control Register */
#define EVADC_G3_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021280u)

/** Alias (User Manual Name) for EVADC_G3_RCR0.
* To use register names with standard convension, please use EVADC_G3_RCR0.
*/
#define	EVADC_G3RCR0	(EVADC_G3_RCR0)

/** \brief  1284, Group Result Control Register */
#define EVADC_G3_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021284u)

/** Alias (User Manual Name) for EVADC_G3_RCR1.
* To use register names with standard convension, please use EVADC_G3_RCR1.
*/
#define	EVADC_G3RCR1	(EVADC_G3_RCR1)

/** \brief  12A8, Group Result Control Register */
#define EVADC_G3_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212A8u)

/** Alias (User Manual Name) for EVADC_G3_RCR10.
* To use register names with standard convension, please use EVADC_G3_RCR10.
*/
#define	EVADC_G3RCR10	(EVADC_G3_RCR10)

/** \brief  12AC, Group Result Control Register */
#define EVADC_G3_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212ACu)

/** Alias (User Manual Name) for EVADC_G3_RCR11.
* To use register names with standard convension, please use EVADC_G3_RCR11.
*/
#define	EVADC_G3RCR11	(EVADC_G3_RCR11)

/** \brief  12B0, Group Result Control Register */
#define EVADC_G3_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212B0u)

/** Alias (User Manual Name) for EVADC_G3_RCR12.
* To use register names with standard convension, please use EVADC_G3_RCR12.
*/
#define	EVADC_G3RCR12	(EVADC_G3_RCR12)

/** \brief  12B4, Group Result Control Register */
#define EVADC_G3_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212B4u)

/** Alias (User Manual Name) for EVADC_G3_RCR13.
* To use register names with standard convension, please use EVADC_G3_RCR13.
*/
#define	EVADC_G3RCR13	(EVADC_G3_RCR13)

/** \brief  12B8, Group Result Control Register */
#define EVADC_G3_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212B8u)

/** Alias (User Manual Name) for EVADC_G3_RCR14.
* To use register names with standard convension, please use EVADC_G3_RCR14.
*/
#define	EVADC_G3RCR14	(EVADC_G3_RCR14)

/** \brief  12BC, Group Result Control Register */
#define EVADC_G3_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212BCu)

/** Alias (User Manual Name) for EVADC_G3_RCR15.
* To use register names with standard convension, please use EVADC_G3_RCR15.
*/
#define	EVADC_G3RCR15	(EVADC_G3_RCR15)

/** \brief  1288, Group Result Control Register */
#define EVADC_G3_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021288u)

/** Alias (User Manual Name) for EVADC_G3_RCR2.
* To use register names with standard convension, please use EVADC_G3_RCR2.
*/
#define	EVADC_G3RCR2	(EVADC_G3_RCR2)

/** \brief  128C, Group Result Control Register */
#define EVADC_G3_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002128Cu)

/** Alias (User Manual Name) for EVADC_G3_RCR3.
* To use register names with standard convension, please use EVADC_G3_RCR3.
*/
#define	EVADC_G3RCR3	(EVADC_G3_RCR3)

/** \brief  1290, Group Result Control Register */
#define EVADC_G3_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021290u)

/** Alias (User Manual Name) for EVADC_G3_RCR4.
* To use register names with standard convension, please use EVADC_G3_RCR4.
*/
#define	EVADC_G3RCR4	(EVADC_G3_RCR4)

/** \brief  1294, Group Result Control Register */
#define EVADC_G3_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021294u)

/** Alias (User Manual Name) for EVADC_G3_RCR5.
* To use register names with standard convension, please use EVADC_G3_RCR5.
*/
#define	EVADC_G3RCR5	(EVADC_G3_RCR5)

/** \brief  1298, Group Result Control Register */
#define EVADC_G3_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021298u)

/** Alias (User Manual Name) for EVADC_G3_RCR6.
* To use register names with standard convension, please use EVADC_G3_RCR6.
*/
#define	EVADC_G3RCR6	(EVADC_G3_RCR6)

/** \brief  129C, Group Result Control Register */
#define EVADC_G3_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002129Cu)

/** Alias (User Manual Name) for EVADC_G3_RCR7.
* To use register names with standard convension, please use EVADC_G3_RCR7.
*/
#define	EVADC_G3RCR7	(EVADC_G3_RCR7)

/** \brief  12A0, Group Result Control Register */
#define EVADC_G3_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212A0u)

