Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G3_RCR8.
* To use register names with standard convension, please use EVADC_G3_RCR8.
*/
#define	EVADC_G3RCR8	(EVADC_G3_RCR8)

/** \brief  12A4, Group Result Control Register */
#define EVADC_G3_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00212A4u)

/** Alias (User Manual Name) for EVADC_G3_RCR9.
* To use register names with standard convension, please use EVADC_G3_RCR9.
*/
#define	EVADC_G3RCR9	(EVADC_G3_RCR9)

/** \brief  1194, Result Event Flag Clear Register, Group */
#define EVADC_G3_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0021194u)

/** Alias (User Manual Name) for EVADC_G3_REFCLR.
* To use register names with standard convension, please use EVADC_G3_REFCLR.
*/
#define	EVADC_G3REFCLR	(EVADC_G3_REFCLR)

/** \brief  1184, Result Event Flag Register, Group */
#define EVADC_G3_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0021184u)

/** Alias (User Manual Name) for EVADC_G3_REFLAG.
* To use register names with standard convension, please use EVADC_G3_REFLAG.
*/
#define	EVADC_G3REFLAG	(EVADC_G3_REFLAG)

/** \brief  1300, Group Result Register */
#define EVADC_G3_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021300u)

/** Alias (User Manual Name) for EVADC_G3_RES0.
* To use register names with standard convension, please use EVADC_G3_RES0.
*/
#define	EVADC_G3RES0	(EVADC_G3_RES0)

/** \brief  1304, Group Result Register */
#define EVADC_G3_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021304u)

/** Alias (User Manual Name) for EVADC_G3_RES1.
* To use register names with standard convension, please use EVADC_G3_RES1.
*/
#define	EVADC_G3RES1	(EVADC_G3_RES1)

/** \brief  1328, Group Result Register */
#define EVADC_G3_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021328u)

/** Alias (User Manual Name) for EVADC_G3_RES10.
* To use register names with standard convension, please use EVADC_G3_RES10.
*/
#define	EVADC_G3RES10	(EVADC_G3_RES10)

/** \brief  132C, Group Result Register */
#define EVADC_G3_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002132Cu)

/** Alias (User Manual Name) for EVADC_G3_RES11.
* To use register names with standard convension, please use EVADC_G3_RES11.
*/
#define	EVADC_G3RES11	(EVADC_G3_RES11)

/** \brief  1330, Group Result Register */
#define EVADC_G3_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021330u)

/** Alias (User Manual Name) for EVADC_G3_RES12.
* To use register names with standard convension, please use EVADC_G3_RES12.
*/
#define	EVADC_G3RES12	(EVADC_G3_RES12)

/** \brief  1334, Group Result Register */
#define EVADC_G3_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021334u)

/** Alias (User Manual Name) for EVADC_G3_RES13.
* To use register names with standard convension, please use EVADC_G3_RES13.
*/
#define	EVADC_G3RES13	(EVADC_G3_RES13)

/** \brief  1338, Group Result Register */
#define EVADC_G3_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021338u)

/** Alias (User Manual Name) for EVADC_G3_RES14.
* To use register names with standard convension, please use EVADC_G3_RES14.
*/
#define	EVADC_G3RES14	(EVADC_G3_RES14)

/** \brief  133C, Group Result Register */
#define EVADC_G3_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002133Cu)

/** Alias (User Manual Name) for EVADC_G3_RES15.
* To use register names with standard convension, please use EVADC_G3_RES15.
*/
#define	EVADC_G3RES15	(EVADC_G3_RES15)

/** \brief  1308, Group Result Register */
#define EVADC_G3_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021308u)

/** Alias (User Manual Name) for EVADC_G3_RES2.
* To use register names with standard convension, please use EVADC_G3_RES2.
*/
#define	EVADC_G3RES2	(EVADC_G3_RES2)

/** \brief  130C, Group Result Register */
#define EVADC_G3_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002130Cu)

/** Alias (User Manual Name) for EVADC_G3_RES3.
* To use register names with standard convension, please use EVADC_G3_RES3.
*/
#define	EVADC_G3RES3	(EVADC_G3_RES3)

/** \brief  1310, Group Result Register */
#define EVADC_G3_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021310u)

/** Alias (User Manual Name) for EVADC_G3_RES4.
* To use register names with standard convension, please use EVADC_G3_RES4.
*/
#define	EVADC_G3RES4	(EVADC_G3_RES4)

/** \brief  1314, Group Result Register */
#define EVADC_G3_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021314u)

/** Alias (User Manual Name) for EVADC_G3_RES5.
* To use register names with standard convension, please use EVADC_G3_RES5.
*/
#define	EVADC_G3RES5	(EVADC_G3_RES5)

/** \brief  1318, Group Result Register */
#define EVADC_G3_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021318u)

/** Alias (User Manual Name) for EVADC_G3_RES6.
* To use register names with standard convension, please use EVADC_G3_RES6.
*/
#define	EVADC_G3RES6	(EVADC_G3_RES6)

/** \brief  131C, Group Result Register */
#define EVADC_G3_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002131Cu)

/** Alias (User Manual Name) for EVADC_G3_RES7.
* To use register names with standard convension, please use EVADC_G3_RES7.
*/
#define	EVADC_G3RES7	(EVADC_G3_RES7)

/** \brief  1320, Group Result Register */
#define EVADC_G3_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021320u)

/** Alias (User Manual Name) for EVADC_G3_RES8.
* To use register names with standard convension, please use EVADC_G3_RES8.
*/
#define	EVADC_G3RES8	(EVADC_G3_RES8)

/** \brief  1324, Group Result Register */
#define EVADC_G3_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021324u)

/** Alias (User Manual Name) for EVADC_G3_RES9.
* To use register names with standard convension, please use EVADC_G3_RES9.
*/
#define	EVADC_G3RES9	(EVADC_G3_RES9)

/** \brief  1380, Group Result Reg., Debug */
#define EVADC_G3_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021380u)

/** Alias (User Manual Name) for EVADC_G3_RESD0.
* To use register names with standard convension, please use EVADC_G3_RESD0.
*/
#define	EVADC_G3RESD0	(EVADC_G3_RESD0)

/** \brief  1384, Group Result Reg., Debug */
#define EVADC_G3_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021384u)

/** Alias (User Manual Name) for EVADC_G3_RESD1.
* To use register names with standard convension, please use EVADC_G3_RESD1.
*/
#define	EVADC_G3RESD1	(EVADC_G3_RESD1)

/** \brief  13A8, Group Result Reg., Debug */
#define EVADC_G3_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213A8u)

/** Alias (User Manual Name) for EVADC_G3_RESD10.
* To use register names with standard convension, please use EVADC_G3_RESD10.
*/
#define	EVADC_G3RESD10	(EVADC_G3_RESD10)

