Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  13AC, Group Result Reg., Debug */
#define EVADC_G3_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213ACu)

/** Alias (User Manual Name) for EVADC_G3_RESD11.
* To use register names with standard convension, please use EVADC_G3_RESD11.
*/
#define	EVADC_G3RESD11	(EVADC_G3_RESD11)

/** \brief  13B0, Group Result Reg., Debug */
#define EVADC_G3_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213B0u)

/** Alias (User Manual Name) for EVADC_G3_RESD12.
* To use register names with standard convension, please use EVADC_G3_RESD12.
*/
#define	EVADC_G3RESD12	(EVADC_G3_RESD12)

/** \brief  13B4, Group Result Reg., Debug */
#define EVADC_G3_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213B4u)

/** Alias (User Manual Name) for EVADC_G3_RESD13.
* To use register names with standard convension, please use EVADC_G3_RESD13.
*/
#define	EVADC_G3RESD13	(EVADC_G3_RESD13)

/** \brief  13B8, Group Result Reg., Debug */
#define EVADC_G3_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213B8u)

/** Alias (User Manual Name) for EVADC_G3_RESD14.
* To use register names with standard convension, please use EVADC_G3_RESD14.
*/
#define	EVADC_G3RESD14	(EVADC_G3_RESD14)

/** \brief  13BC, Group Result Reg., Debug */
#define EVADC_G3_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213BCu)

/** Alias (User Manual Name) for EVADC_G3_RESD15.
* To use register names with standard convension, please use EVADC_G3_RESD15.
*/
#define	EVADC_G3RESD15	(EVADC_G3_RESD15)

/** \brief  1388, Group Result Reg., Debug */
#define EVADC_G3_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021388u)

/** Alias (User Manual Name) for EVADC_G3_RESD2.
* To use register names with standard convension, please use EVADC_G3_RESD2.
*/
#define	EVADC_G3RESD2	(EVADC_G3_RESD2)

/** \brief  138C, Group Result Reg., Debug */
#define EVADC_G3_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002138Cu)

/** Alias (User Manual Name) for EVADC_G3_RESD3.
* To use register names with standard convension, please use EVADC_G3_RESD3.
*/
#define	EVADC_G3RESD3	(EVADC_G3_RESD3)

/** \brief  1390, Group Result Reg., Debug */
#define EVADC_G3_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021390u)

/** Alias (User Manual Name) for EVADC_G3_RESD4.
* To use register names with standard convension, please use EVADC_G3_RESD4.
*/
#define	EVADC_G3RESD4	(EVADC_G3_RESD4)

/** \brief  1394, Group Result Reg., Debug */
#define EVADC_G3_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021394u)

/** Alias (User Manual Name) for EVADC_G3_RESD5.
* To use register names with standard convension, please use EVADC_G3_RESD5.
*/
#define	EVADC_G3RESD5	(EVADC_G3_RESD5)

/** \brief  1398, Group Result Reg., Debug */
#define EVADC_G3_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021398u)

/** Alias (User Manual Name) for EVADC_G3_RESD6.
* To use register names with standard convension, please use EVADC_G3_RESD6.
*/
#define	EVADC_G3RESD6	(EVADC_G3_RESD6)

/** \brief  139C, Group Result Reg., Debug */
#define EVADC_G3_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002139Cu)

/** Alias (User Manual Name) for EVADC_G3_RESD7.
* To use register names with standard convension, please use EVADC_G3_RESD7.
*/
#define	EVADC_G3RESD7	(EVADC_G3_RESD7)

/** \brief  13A0, Group Result Reg., Debug */
#define EVADC_G3_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213A0u)

/** Alias (User Manual Name) for EVADC_G3_RESD8.
* To use register names with standard convension, please use EVADC_G3_RESD8.
*/
#define	EVADC_G3RESD8	(EVADC_G3_RESD8)

/** \brief  13A4, Group Result Reg., Debug */
#define EVADC_G3_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00213A4u)

/** Alias (User Manual Name) for EVADC_G3_RESD9.
* To use register names with standard convension, please use EVADC_G3_RESD9.
*/
#define	EVADC_G3RESD9	(EVADC_G3_RESD9)

/** \brief  11B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G3_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00211B0u)

/** Alias (User Manual Name) for EVADC_G3_REVNP0.
* To use register names with standard convension, please use EVADC_G3_REVNP0.
*/
#define	EVADC_G3REVNP0	(EVADC_G3_REVNP0)

/** \brief  11B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G3_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00211B4u)

/** Alias (User Manual Name) for EVADC_G3_REVNP1.
* To use register names with standard convension, please use EVADC_G3_REVNP1.
*/
#define	EVADC_G3REVNP1	(EVADC_G3_REVNP1)

/** \brief  1198, Source Event Flag Clear Reg., Group */
#define EVADC_G3_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0021198u)

/** Alias (User Manual Name) for EVADC_G3_SEFCLR.
* To use register names with standard convension, please use EVADC_G3_SEFCLR.
*/
#define	EVADC_G3SEFCLR	(EVADC_G3_SEFCLR)

/** \brief  1188, Source Event Flag Register, Group */
#define EVADC_G3_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0021188u)

/** Alias (User Manual Name) for EVADC_G3_SEFLAG.
* To use register names with standard convension, please use EVADC_G3_SEFLAG.
*/
#define	EVADC_G3SEFLAG	(EVADC_G3_SEFLAG)

/** \brief  11C0, Source Event Node Pointer Reg., Group */
#define EVADC_G3_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00211C0u)

/** Alias (User Manual Name) for EVADC_G3_SEVNP.
* To use register names with standard convension, please use EVADC_G3_SEVNP.
*/
#define	EVADC_G3SEVNP	(EVADC_G3_SEVNP)

/** \brief  11C8, Service Request Software Activation Trigger, Group */
#define EVADC_G3_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00211C8u)

/** Alias (User Manual Name) for EVADC_G3_SRACT.
* To use register names with standard convension, please use EVADC_G3_SRACT.
*/
#define	EVADC_G3SRACT	(EVADC_G3_SRACT)

/** \brief  10C0, Synchronization Control Register, Group */
#define EVADC_G3_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00210C0u)

/** Alias (User Manual Name) for EVADC_G3_SYNCTR.
* To use register names with standard convension, please use EVADC_G3_SYNCTR.
*/
#define	EVADC_G3SYNCTR	(EVADC_G3_SYNCTR)

/** \brief  11F8, Valid Flag Register, Group */
#define EVADC_G3_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00211F8u)

/** Alias (User Manual Name) for EVADC_G3_VFR.
* To use register names with standard convension, please use EVADC_G3_VFR.
*/
#define	EVADC_G3VFR	(EVADC_G3_VFR)

/** \brief  14B0, Alias Register, Group */
#define EVADC_G4_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00214B0u)

/** Alias (User Manual Name) for EVADC_G4_ALIAS.
* To use register names with standard convension, please use EVADC_G4_ALIAS.
*/
#define	EVADC_G4ALIAS	(EVADC_G4_ALIAS)

/** \brief  1488, Analog Fct. Config. Register, Group */
#define EVADC_G4_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0021488u)

/** Alias (User Manual Name) for EVADC_G4_ANCFG.
* To use register names with standard convension, please use EVADC_G4_ANCFG.
*/
#define	EVADC_G4ANCFG	(EVADC_G4_ANCFG)

/** \brief  1480, Arbitration Config. Register, Group */
#define EVADC_G4_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0021480u)

/** Alias (User Manual Name) for EVADC_G4_ARBCFG.
* To use register names with standard convension, please use EVADC_G4_ARBCFG.
*/
#define	EVADC_G4ARBCFG	(EVADC_G4_ARBCFG)

/** \brief  1484, Arbitration Priority Register, Group */
#define EVADC_G4_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0021484u)

/** Alias (User Manual Name) for EVADC_G4_ARBPR.
* To use register names with standard convension, please use EVADC_G4_ARBPR.
*/
#define	EVADC_G4ARBPR	(EVADC_G4_ARBPR)

/** \brief  14B8, Boundary Select Register, Group */
#define EVADC_G4_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00214B8u)

/** Alias (User Manual Name) for EVADC_G4_BOUND.
* To use register names with standard convension, please use EVADC_G4_BOUND.
*/
#define	EVADC_G4BOUND	(EVADC_G4_BOUND)

