Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  1590, Channel Event Flag Clear Register, Group */
#define EVADC_G4_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0021590u)

/** Alias (User Manual Name) for EVADC_G4_CEFCLR.
* To use register names with standard convension, please use EVADC_G4_CEFCLR.
*/
#define	EVADC_G4CEFCLR	(EVADC_G4_CEFCLR)

/** \brief  1580, Channel Event Flag Register, Group */
#define EVADC_G4_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0021580u)

/** Alias (User Manual Name) for EVADC_G4_CEFLAG.
* To use register names with standard convension, please use EVADC_G4_CEFLAG.
*/
#define	EVADC_G4CEFLAG	(EVADC_G4_CEFLAG)

/** \brief  15A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G4_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00215A0u)

/** Alias (User Manual Name) for EVADC_G4_CEVNP0.
* To use register names with standard convension, please use EVADC_G4_CEVNP0.
*/
#define	EVADC_G4CEVNP0	(EVADC_G4_CEVNP0)

/** \brief  1600, Group, Channel Control Register */
#define EVADC_G4_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021600u)

/** Alias (User Manual Name) for EVADC_G4_CHCTR0.
* To use register names with standard convension, please use EVADC_G4_CHCTR0.
*/
#define	EVADC_G4CHCTR0	(EVADC_G4_CHCTR0)

/** \brief  1604, Group, Channel Control Register */
#define EVADC_G4_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021604u)

/** Alias (User Manual Name) for EVADC_G4_CHCTR1.
* To use register names with standard convension, please use EVADC_G4_CHCTR1.
*/
#define	EVADC_G4CHCTR1	(EVADC_G4_CHCTR1)

/** \brief  1608, Group, Channel Control Register */
#define EVADC_G4_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021608u)

/** Alias (User Manual Name) for EVADC_G4_CHCTR2.
* To use register names with standard convension, please use EVADC_G4_CHCTR2.
*/
#define	EVADC_G4CHCTR2	(EVADC_G4_CHCTR2)

/** \brief  160C, Group, Channel Control Register */
#define EVADC_G4_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002160Cu)

/** Alias (User Manual Name) for EVADC_G4_CHCTR3.
* To use register names with standard convension, please use EVADC_G4_CHCTR3.
*/
#define	EVADC_G4CHCTR3	(EVADC_G4_CHCTR3)

/** \brief  1610, Group, Channel Control Register */
#define EVADC_G4_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021610u)

/** Alias (User Manual Name) for EVADC_G4_CHCTR4.
* To use register names with standard convension, please use EVADC_G4_CHCTR4.
*/
#define	EVADC_G4CHCTR4	(EVADC_G4_CHCTR4)

/** \brief  1614, Group, Channel Control Register */
#define EVADC_G4_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021614u)

/** Alias (User Manual Name) for EVADC_G4_CHCTR5.
* To use register names with standard convension, please use EVADC_G4_CHCTR5.
*/
#define	EVADC_G4CHCTR5	(EVADC_G4_CHCTR5)

/** \brief  1618, Group, Channel Control Register */
#define EVADC_G4_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021618u)

/** Alias (User Manual Name) for EVADC_G4_CHCTR6.
* To use register names with standard convension, please use EVADC_G4_CHCTR6.
*/
#define	EVADC_G4CHCTR6	(EVADC_G4_CHCTR6)

/** \brief  161C, Group, Channel Control Register */
#define EVADC_G4_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002161Cu)

/** Alias (User Manual Name) for EVADC_G4_CHCTR7.
* To use register names with standard convension, please use EVADC_G4_CHCTR7.
*/
#define	EVADC_G4CHCTR7	(EVADC_G4_CHCTR7)

/** \brief  15F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G4_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00215F4u)

/** Alias (User Manual Name) for EVADC_G4_EMUXCS.
* To use register names with standard convension, please use EVADC_G4_EMUXCS.
*/
#define	EVADC_G4EMUXCS	(EVADC_G4_EMUXCS)

/** \brief  15F0, External Multiplexer Control Reg., Group */
#define EVADC_G4_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00215F0u)

/** Alias (User Manual Name) for EVADC_G4_EMUXCTR.
* To use register names with standard convension, please use EVADC_G4_EMUXCTR.
*/
#define	EVADC_G4EMUXCTR	(EVADC_G4_EMUXCTR)

/** \brief  14A0, Input Class Reg0ster i, Group */
#define EVADC_G4_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00214A0u)

/** Alias (User Manual Name) for EVADC_G4_ICLASS0.
* To use register names with standard convension, please use EVADC_G4_ICLASS0.
*/
#define	EVADC_G4ICLASS0	(EVADC_G4_ICLASS0)

/** \brief  14A4, Input Class Reg0ster i, Group */
#define EVADC_G4_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00214A4u)

/** Alias (User Manual Name) for EVADC_G4_ICLASS1.
* To use register names with standard convension, please use EVADC_G4_ICLASS1.
*/
#define	EVADC_G4ICLASS1	(EVADC_G4_ICLASS1)

/** \brief  150C, Queue 0 Register 0, Group 0 */
#define EVADC_G4_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002150Cu)

/** Alias (User Manual Name) for EVADC_G4_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G4_Q0_Q0R.
*/
#define	EVADC_G4Q0R0	(EVADC_G4_Q0_Q0R)

/** \brief  1500, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G4_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021500u)

/** Alias (User Manual Name) for EVADC_G4_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G4_Q0_QCTRL.
*/
#define	EVADC_G4QCTRL0	(EVADC_G4_Q0_QCTRL)

/** \brief  1510, Queue 0 Input Register, Group 0 */
#define EVADC_G4_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021510u)

/** Alias (User Manual Name) for EVADC_G4_Q0_QINR.
* To use register names with standard convension, please use EVADC_G4_Q0_QINR.
*/
#define	EVADC_G4QINR0	(EVADC_G4_Q0_QINR)

/** \brief  1504, Queue 0 Mode Register, Group 0 */
#define EVADC_G4_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021504u)

/** Alias (User Manual Name) for EVADC_G4_Q0_QMR.
* To use register names with standard convension, please use EVADC_G4_Q0_QMR.
*/
#define	EVADC_G4QMR0	(EVADC_G4_Q0_QMR)

