Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  1508, Queue 0 Status Register, Group 0 */
#define EVADC_G4_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021508u)

/** Alias (User Manual Name) for EVADC_G4_Q0_QSR.
* To use register names with standard convension, please use EVADC_G4_Q0_QSR.
*/
#define	EVADC_G4QSR0	(EVADC_G4_Q0_QSR)

/** \brief  1518, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G4_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021518u)

/** Alias (User Manual Name) for EVADC_G4_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G4_Q0_REQTM.
*/
#define	EVADC_G4REQTM0	(EVADC_G4_Q0_REQTM)

/** \brief  151C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G4_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002151Cu)

/** Alias (User Manual Name) for EVADC_G4_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G4_Q0_REQTS.
*/
#define	EVADC_G4REQTS0	(EVADC_G4_Q0_REQTS)

/** \brief  152C, Queue 0 Register 0, Group 0 */
#define EVADC_G4_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002152Cu)

/** Alias (User Manual Name) for EVADC_G4_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G4_Q1_Q0R.
*/
#define	EVADC_G4Q0R1	(EVADC_G4_Q1_Q0R)

/** \brief  1520, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G4_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021520u)

/** Alias (User Manual Name) for EVADC_G4_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G4_Q1_QCTRL.
*/
#define	EVADC_G4QCTRL1	(EVADC_G4_Q1_QCTRL)

/** \brief  1530, Queue 0 Input Register, Group 0 */
#define EVADC_G4_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021530u)

/** Alias (User Manual Name) for EVADC_G4_Q1_QINR.
* To use register names with standard convension, please use EVADC_G4_Q1_QINR.
*/
#define	EVADC_G4QINR1	(EVADC_G4_Q1_QINR)

/** \brief  1524, Queue 0 Mode Register, Group 0 */
#define EVADC_G4_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021524u)

/** Alias (User Manual Name) for EVADC_G4_Q1_QMR.
* To use register names with standard convension, please use EVADC_G4_Q1_QMR.
*/
#define	EVADC_G4QMR1	(EVADC_G4_Q1_QMR)

/** \brief  1528, Queue 0 Status Register, Group 0 */
#define EVADC_G4_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021528u)

/** Alias (User Manual Name) for EVADC_G4_Q1_QSR.
* To use register names with standard convension, please use EVADC_G4_Q1_QSR.
*/
#define	EVADC_G4QSR1	(EVADC_G4_Q1_QSR)

/** \brief  1538, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G4_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021538u)

/** Alias (User Manual Name) for EVADC_G4_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G4_Q1_REQTM.
*/
#define	EVADC_G4REQTM1	(EVADC_G4_Q1_REQTM)

/** \brief  153C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G4_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002153Cu)

/** Alias (User Manual Name) for EVADC_G4_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G4_Q1_REQTS.
*/
#define	EVADC_G4REQTS1	(EVADC_G4_Q1_REQTS)

/** \brief  154C, Queue 0 Register 0, Group 0 */
#define EVADC_G4_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002154Cu)

/** Alias (User Manual Name) for EVADC_G4_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G4_Q2_Q0R.
*/
#define	EVADC_G4Q0R2	(EVADC_G4_Q2_Q0R)

/** \brief  1540, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G4_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021540u)

/** Alias (User Manual Name) for EVADC_G4_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G4_Q2_QCTRL.
*/
#define	EVADC_G4QCTRL2	(EVADC_G4_Q2_QCTRL)

/** \brief  1550, Queue 0 Input Register, Group 0 */
#define EVADC_G4_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021550u)

/** Alias (User Manual Name) for EVADC_G4_Q2_QINR.
* To use register names with standard convension, please use EVADC_G4_Q2_QINR.
*/
#define	EVADC_G4QINR2	(EVADC_G4_Q2_QINR)

/** \brief  1544, Queue 0 Mode Register, Group 0 */
#define EVADC_G4_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021544u)

/** Alias (User Manual Name) for EVADC_G4_Q2_QMR.
* To use register names with standard convension, please use EVADC_G4_Q2_QMR.
*/
#define	EVADC_G4QMR2	(EVADC_G4_Q2_QMR)

/** \brief  1548, Queue 0 Status Register, Group 0 */
#define EVADC_G4_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021548u)

/** Alias (User Manual Name) for EVADC_G4_Q2_QSR.
* To use register names with standard convension, please use EVADC_G4_Q2_QSR.
*/
#define	EVADC_G4QSR2	(EVADC_G4_Q2_QSR)

/** \brief  1554, Queue 2 Status Register, Group 4 */
#define EVADC_G4_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0021554u)

/** Alias (User Manual Name) for EVADC_G4_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G4_Q0_QSR.
*/
#define	EVADC_G4TRCTR	(EVADC_G4_Q2_TRCTR)

/** \brief  1558, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G4_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021558u)

/** Alias (User Manual Name) for EVADC_G4_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G4_Q2_REQTM.
*/
#define	EVADC_G4REQTM2	(EVADC_G4_Q2_REQTM)

/** \brief  155C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G4_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002155Cu)

/** Alias (User Manual Name) for EVADC_G4_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G4_Q2_REQTS.
*/
#define	EVADC_G4REQTS2	(EVADC_G4_Q2_REQTS)

/** \brief  1680, Group Result Control Register */
#define EVADC_G4_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021680u)

/** Alias (User Manual Name) for EVADC_G4_RCR0.
* To use register names with standard convension, please use EVADC_G4_RCR0.
*/
#define	EVADC_G4RCR0	(EVADC_G4_RCR0)

/** \brief  1684, Group Result Control Register */
#define EVADC_G4_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021684u)

/** Alias (User Manual Name) for EVADC_G4_RCR1.
* To use register names with standard convension, please use EVADC_G4_RCR1.
*/
#define	EVADC_G4RCR1	(EVADC_G4_RCR1)

/** \brief  16A8, Group Result Control Register */
#define EVADC_G4_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00216A8u)

/** Alias (User Manual Name) for EVADC_G4_RCR10.
* To use register names with standard convension, please use EVADC_G4_RCR10.
*/
#define	EVADC_G4RCR10	(EVADC_G4_RCR10)

/** \brief  16AC, Group Result Control Register */
#define EVADC_G4_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00216ACu)

/** Alias (User Manual Name) for EVADC_G4_RCR11.
* To use register names with standard convension, please use EVADC_G4_RCR11.
*/
#define	EVADC_G4RCR11	(EVADC_G4_RCR11)

/** \brief  16B0, Group Result Control Register */
#define EVADC_G4_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00216B0u)

/** Alias (User Manual Name) for EVADC_G4_RCR12.
* To use register names with standard convension, please use EVADC_G4_RCR12.
*/
#define	EVADC_G4RCR12	(EVADC_G4_RCR12)

