Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  1708, Group Result Register */
#define EVADC_G4_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021708u)

/** Alias (User Manual Name) for EVADC_G4_RES2.
* To use register names with standard convension, please use EVADC_G4_RES2.
*/
#define	EVADC_G4RES2	(EVADC_G4_RES2)

/** \brief  170C, Group Result Register */
#define EVADC_G4_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002170Cu)

/** Alias (User Manual Name) for EVADC_G4_RES3.
* To use register names with standard convension, please use EVADC_G4_RES3.
*/
#define	EVADC_G4RES3	(EVADC_G4_RES3)

/** \brief  1710, Group Result Register */
#define EVADC_G4_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021710u)

/** Alias (User Manual Name) for EVADC_G4_RES4.
* To use register names with standard convension, please use EVADC_G4_RES4.
*/
#define	EVADC_G4RES4	(EVADC_G4_RES4)

/** \brief  1714, Group Result Register */
#define EVADC_G4_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021714u)

/** Alias (User Manual Name) for EVADC_G4_RES5.
* To use register names with standard convension, please use EVADC_G4_RES5.
*/
#define	EVADC_G4RES5	(EVADC_G4_RES5)

/** \brief  1718, Group Result Register */
#define EVADC_G4_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021718u)

/** Alias (User Manual Name) for EVADC_G4_RES6.
* To use register names with standard convension, please use EVADC_G4_RES6.
*/
#define	EVADC_G4RES6	(EVADC_G4_RES6)

/** \brief  171C, Group Result Register */
#define EVADC_G4_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002171Cu)

/** Alias (User Manual Name) for EVADC_G4_RES7.
* To use register names with standard convension, please use EVADC_G4_RES7.
*/
#define	EVADC_G4RES7	(EVADC_G4_RES7)

/** \brief  1720, Group Result Register */
#define EVADC_G4_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021720u)

/** Alias (User Manual Name) for EVADC_G4_RES8.
* To use register names with standard convension, please use EVADC_G4_RES8.
*/
#define	EVADC_G4RES8	(EVADC_G4_RES8)

/** \brief  1724, Group Result Register */
#define EVADC_G4_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021724u)

/** Alias (User Manual Name) for EVADC_G4_RES9.
* To use register names with standard convension, please use EVADC_G4_RES9.
*/
#define	EVADC_G4RES9	(EVADC_G4_RES9)

/** \brief  1780, Group Result Reg., Debug */
#define EVADC_G4_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021780u)

/** Alias (User Manual Name) for EVADC_G4_RESD0.
* To use register names with standard convension, please use EVADC_G4_RESD0.
*/
#define	EVADC_G4RESD0	(EVADC_G4_RESD0)

/** \brief  1784, Group Result Reg., Debug */
#define EVADC_G4_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021784u)

/** Alias (User Manual Name) for EVADC_G4_RESD1.
* To use register names with standard convension, please use EVADC_G4_RESD1.
*/
#define	EVADC_G4RESD1	(EVADC_G4_RESD1)

/** \brief  17A8, Group Result Reg., Debug */
#define EVADC_G4_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217A8u)

/** Alias (User Manual Name) for EVADC_G4_RESD10.
* To use register names with standard convension, please use EVADC_G4_RESD10.
*/
#define	EVADC_G4RESD10	(EVADC_G4_RESD10)

/** \brief  17AC, Group Result Reg., Debug */
#define EVADC_G4_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217ACu)

/** Alias (User Manual Name) for EVADC_G4_RESD11.
* To use register names with standard convension, please use EVADC_G4_RESD11.
*/
#define	EVADC_G4RESD11	(EVADC_G4_RESD11)

/** \brief  17B0, Group Result Reg., Debug */
#define EVADC_G4_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217B0u)

/** Alias (User Manual Name) for EVADC_G4_RESD12.
* To use register names with standard convension, please use EVADC_G4_RESD12.
*/
#define	EVADC_G4RESD12	(EVADC_G4_RESD12)

/** \brief  17B4, Group Result Reg., Debug */
#define EVADC_G4_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217B4u)

/** Alias (User Manual Name) for EVADC_G4_RESD13.
* To use register names with standard convension, please use EVADC_G4_RESD13.
*/
#define	EVADC_G4RESD13	(EVADC_G4_RESD13)

/** \brief  17B8, Group Result Reg., Debug */
#define EVADC_G4_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217B8u)

/** Alias (User Manual Name) for EVADC_G4_RESD14.
* To use register names with standard convension, please use EVADC_G4_RESD14.
*/
#define	EVADC_G4RESD14	(EVADC_G4_RESD14)

/** \brief  17BC, Group Result Reg., Debug */
#define EVADC_G4_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217BCu)

/** Alias (User Manual Name) for EVADC_G4_RESD15.
* To use register names with standard convension, please use EVADC_G4_RESD15.
*/
#define	EVADC_G4RESD15	(EVADC_G4_RESD15)

/** \brief  1788, Group Result Reg., Debug */
#define EVADC_G4_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021788u)

/** Alias (User Manual Name) for EVADC_G4_RESD2.
* To use register names with standard convension, please use EVADC_G4_RESD2.
*/
#define	EVADC_G4RESD2	(EVADC_G4_RESD2)

/** \brief  178C, Group Result Reg., Debug */
#define EVADC_G4_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002178Cu)

/** Alias (User Manual Name) for EVADC_G4_RESD3.
* To use register names with standard convension, please use EVADC_G4_RESD3.
*/
#define	EVADC_G4RESD3	(EVADC_G4_RESD3)

/** \brief  1790, Group Result Reg., Debug */
#define EVADC_G4_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021790u)

/** Alias (User Manual Name) for EVADC_G4_RESD4.
* To use register names with standard convension, please use EVADC_G4_RESD4.
*/
#define	EVADC_G4RESD4	(EVADC_G4_RESD4)

/** \brief  1794, Group Result Reg., Debug */
#define EVADC_G4_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021794u)

/** Alias (User Manual Name) for EVADC_G4_RESD5.
* To use register names with standard convension, please use EVADC_G4_RESD5.
*/
#define	EVADC_G4RESD5	(EVADC_G4_RESD5)

/** \brief  1798, Group Result Reg., Debug */
#define EVADC_G4_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021798u)

/** Alias (User Manual Name) for EVADC_G4_RESD6.
* To use register names with standard convension, please use EVADC_G4_RESD6.
*/
#define	EVADC_G4RESD6	(EVADC_G4_RESD6)

/** \brief  179C, Group Result Reg., Debug */
#define EVADC_G4_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002179Cu)

/** Alias (User Manual Name) for EVADC_G4_RESD7.
* To use register names with standard convension, please use EVADC_G4_RESD7.
*/
#define	EVADC_G4RESD7	(EVADC_G4_RESD7)

/** \brief  17A0, Group Result Reg., Debug */
#define EVADC_G4_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217A0u)

/** Alias (User Manual Name) for EVADC_G4_RESD8.
* To use register names with standard convension, please use EVADC_G4_RESD8.
*/
#define	EVADC_G4RESD8	(EVADC_G4_RESD8)

/** \brief  17A4, Group Result Reg., Debug */
#define EVADC_G4_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00217A4u)

