Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G4_RESD9.
* To use register names with standard convension, please use EVADC_G4_RESD9.
*/
#define	EVADC_G4RESD9	(EVADC_G4_RESD9)

/** \brief  15B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G4_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00215B0u)

/** Alias (User Manual Name) for EVADC_G4_REVNP0.
* To use register names with standard convension, please use EVADC_G4_REVNP0.
*/
#define	EVADC_G4REVNP0	(EVADC_G4_REVNP0)

/** \brief  15B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G4_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00215B4u)

/** Alias (User Manual Name) for EVADC_G4_REVNP1.
* To use register names with standard convension, please use EVADC_G4_REVNP1.
*/
#define	EVADC_G4REVNP1	(EVADC_G4_REVNP1)

/** \brief  1598, Source Event Flag Clear Reg., Group */
#define EVADC_G4_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0021598u)

/** Alias (User Manual Name) for EVADC_G4_SEFCLR.
* To use register names with standard convension, please use EVADC_G4_SEFCLR.
*/
#define	EVADC_G4SEFCLR	(EVADC_G4_SEFCLR)

/** \brief  1588, Source Event Flag Register, Group */
#define EVADC_G4_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0021588u)

/** Alias (User Manual Name) for EVADC_G4_SEFLAG.
* To use register names with standard convension, please use EVADC_G4_SEFLAG.
*/
#define	EVADC_G4SEFLAG	(EVADC_G4_SEFLAG)

/** \brief  15C0, Source Event Node Pointer Reg., Group */
#define EVADC_G4_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00215C0u)

/** Alias (User Manual Name) for EVADC_G4_SEVNP.
* To use register names with standard convension, please use EVADC_G4_SEVNP.
*/
#define	EVADC_G4SEVNP	(EVADC_G4_SEVNP)

/** \brief  15C8, Service Request Software Activation Trigger, Group */
#define EVADC_G4_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00215C8u)

/** Alias (User Manual Name) for EVADC_G4_SRACT.
* To use register names with standard convension, please use EVADC_G4_SRACT.
*/
#define	EVADC_G4SRACT	(EVADC_G4_SRACT)

/** \brief  14C0, Synchronization Control Register, Group */
#define EVADC_G4_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00214C0u)

/** Alias (User Manual Name) for EVADC_G4_SYNCTR.
* To use register names with standard convension, please use EVADC_G4_SYNCTR.
*/
#define	EVADC_G4SYNCTR	(EVADC_G4_SYNCTR)

/** \brief  15F8, Valid Flag Register, Group */
#define EVADC_G4_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00215F8u)

/** Alias (User Manual Name) for EVADC_G4_VFR.
* To use register names with standard convension, please use EVADC_G4_VFR.
*/
#define	EVADC_G4VFR	(EVADC_G4_VFR)

/** \brief  18B0, Alias Register, Group */
#define EVADC_G5_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00218B0u)

/** Alias (User Manual Name) for EVADC_G5_ALIAS.
* To use register names with standard convension, please use EVADC_G5_ALIAS.
*/
#define	EVADC_G5ALIAS	(EVADC_G5_ALIAS)

/** \brief  1888, Analog Fct. Config. Register, Group */
#define EVADC_G5_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0021888u)

/** Alias (User Manual Name) for EVADC_G5_ANCFG.
* To use register names with standard convension, please use EVADC_G5_ANCFG.
*/
#define	EVADC_G5ANCFG	(EVADC_G5_ANCFG)

/** \brief  1880, Arbitration Config. Register, Group */
#define EVADC_G5_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0021880u)

/** Alias (User Manual Name) for EVADC_G5_ARBCFG.
* To use register names with standard convension, please use EVADC_G5_ARBCFG.
*/
#define	EVADC_G5ARBCFG	(EVADC_G5_ARBCFG)

/** \brief  1884, Arbitration Priority Register, Group */
#define EVADC_G5_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0021884u)

/** Alias (User Manual Name) for EVADC_G5_ARBPR.
* To use register names with standard convension, please use EVADC_G5_ARBPR.
*/
#define	EVADC_G5ARBPR	(EVADC_G5_ARBPR)

/** \brief  18B8, Boundary Select Register, Group */
#define EVADC_G5_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00218B8u)

/** Alias (User Manual Name) for EVADC_G5_BOUND.
* To use register names with standard convension, please use EVADC_G5_BOUND.
*/
#define	EVADC_G5BOUND	(EVADC_G5_BOUND)

/** \brief  1990, Channel Event Flag Clear Register, Group */
#define EVADC_G5_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0021990u)

/** Alias (User Manual Name) for EVADC_G5_CEFCLR.
* To use register names with standard convension, please use EVADC_G5_CEFCLR.
*/
#define	EVADC_G5CEFCLR	(EVADC_G5_CEFCLR)

/** \brief  1980, Channel Event Flag Register, Group */
#define EVADC_G5_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0021980u)

/** Alias (User Manual Name) for EVADC_G5_CEFLAG.
* To use register names with standard convension, please use EVADC_G5_CEFLAG.
*/
#define	EVADC_G5CEFLAG	(EVADC_G5_CEFLAG)

/** \brief  19A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G5_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00219A0u)

/** Alias (User Manual Name) for EVADC_G5_CEVNP0.
* To use register names with standard convension, please use EVADC_G5_CEVNP0.
*/
#define	EVADC_G5CEVNP0	(EVADC_G5_CEVNP0)

/** \brief  1A00, Group, Channel Control Register */
#define EVADC_G5_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A00u)

/** Alias (User Manual Name) for EVADC_G5_CHCTR0.
* To use register names with standard convension, please use EVADC_G5_CHCTR0.
*/
#define	EVADC_G5CHCTR0	(EVADC_G5_CHCTR0)

/** \brief  1A04, Group, Channel Control Register */
#define EVADC_G5_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A04u)

/** Alias (User Manual Name) for EVADC_G5_CHCTR1.
* To use register names with standard convension, please use EVADC_G5_CHCTR1.
*/
#define	EVADC_G5CHCTR1	(EVADC_G5_CHCTR1)

/** \brief  1A08, Group, Channel Control Register */
#define EVADC_G5_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A08u)

/** Alias (User Manual Name) for EVADC_G5_CHCTR2.
* To use register names with standard convension, please use EVADC_G5_CHCTR2.
*/
#define	EVADC_G5CHCTR2	(EVADC_G5_CHCTR2)

/** \brief  1A0C, Group, Channel Control Register */
#define EVADC_G5_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A0Cu)

/** Alias (User Manual Name) for EVADC_G5_CHCTR3.
* To use register names with standard convension, please use EVADC_G5_CHCTR3.
*/
#define	EVADC_G5CHCTR3	(EVADC_G5_CHCTR3)

/** \brief  1A10, Group, Channel Control Register */
#define EVADC_G5_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A10u)

/** Alias (User Manual Name) for EVADC_G5_CHCTR4.
* To use register names with standard convension, please use EVADC_G5_CHCTR4.
*/
#define	EVADC_G5CHCTR4	(EVADC_G5_CHCTR4)

/** \brief  1A14, Group, Channel Control Register */
#define EVADC_G5_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A14u)

