Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G5_CHCTR5.
* To use register names with standard convension, please use EVADC_G5_CHCTR5.
*/
#define	EVADC_G5CHCTR5	(EVADC_G5_CHCTR5)

/** \brief  1A18, Group, Channel Control Register */
#define EVADC_G5_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A18u)

/** Alias (User Manual Name) for EVADC_G5_CHCTR6.
* To use register names with standard convension, please use EVADC_G5_CHCTR6.
*/
#define	EVADC_G5CHCTR6	(EVADC_G5_CHCTR6)

/** \brief  1A1C, Group, Channel Control Register */
#define EVADC_G5_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021A1Cu)

/** Alias (User Manual Name) for EVADC_G5_CHCTR7.
* To use register names with standard convension, please use EVADC_G5_CHCTR7.
*/
#define	EVADC_G5CHCTR7	(EVADC_G5_CHCTR7)

/** \brief  19F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G5_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00219F4u)

/** Alias (User Manual Name) for EVADC_G5_EMUXCS.
* To use register names with standard convension, please use EVADC_G5_EMUXCS.
*/
#define	EVADC_G5EMUXCS	(EVADC_G5_EMUXCS)

/** \brief  19F0, External Multiplexer Control Reg., Group */
#define EVADC_G5_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00219F0u)

/** Alias (User Manual Name) for EVADC_G5_EMUXCTR.
* To use register names with standard convension, please use EVADC_G5_EMUXCTR.
*/
#define	EVADC_G5EMUXCTR	(EVADC_G5_EMUXCTR)

/** \brief  18A0, Input Class Reg0ster i, Group */
#define EVADC_G5_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00218A0u)

/** Alias (User Manual Name) for EVADC_G5_ICLASS0.
* To use register names with standard convension, please use EVADC_G5_ICLASS0.
*/
#define	EVADC_G5ICLASS0	(EVADC_G5_ICLASS0)

/** \brief  18A4, Input Class Reg0ster i, Group */
#define EVADC_G5_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00218A4u)

/** Alias (User Manual Name) for EVADC_G5_ICLASS1.
* To use register names with standard convension, please use EVADC_G5_ICLASS1.
*/
#define	EVADC_G5ICLASS1	(EVADC_G5_ICLASS1)

/** \brief  190C, Queue 0 Register 0, Group 0 */
#define EVADC_G5_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002190Cu)

/** Alias (User Manual Name) for EVADC_G5_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G5_Q0_Q0R.
*/
#define	EVADC_G5Q0R0	(EVADC_G5_Q0_Q0R)

/** \brief  1900, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G5_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021900u)

/** Alias (User Manual Name) for EVADC_G5_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G5_Q0_QCTRL.
*/
#define	EVADC_G5QCTRL0	(EVADC_G5_Q0_QCTRL)

/** \brief  1910, Queue 0 Input Register, Group 0 */
#define EVADC_G5_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021910u)

/** Alias (User Manual Name) for EVADC_G5_Q0_QINR.
* To use register names with standard convension, please use EVADC_G5_Q0_QINR.
*/
#define	EVADC_G5QINR0	(EVADC_G5_Q0_QINR)

/** \brief  1904, Queue 0 Mode Register, Group 0 */
#define EVADC_G5_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021904u)

/** Alias (User Manual Name) for EVADC_G5_Q0_QMR.
* To use register names with standard convension, please use EVADC_G5_Q0_QMR.
*/
#define	EVADC_G5QMR0	(EVADC_G5_Q0_QMR)

/** \brief  1908, Queue 0 Status Register, Group 0 */
#define EVADC_G5_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021908u)

/** Alias (User Manual Name) for EVADC_G5_Q0_QSR.
* To use register names with standard convension, please use EVADC_G5_Q0_QSR.
*/
#define	EVADC_G5QSR0	(EVADC_G5_Q0_QSR)

/** \brief  1918, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G5_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021918u)

/** Alias (User Manual Name) for EVADC_G5_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G5_Q0_REQTM.
*/
#define	EVADC_G5REQTM0	(EVADC_G5_Q0_REQTM)

/** \brief  191C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G5_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002191Cu)

/** Alias (User Manual Name) for EVADC_G5_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G5_Q0_REQTS.
*/
#define	EVADC_G5REQTS0	(EVADC_G5_Q0_REQTS)

/** \brief  192C, Queue 0 Register 0, Group 0 */
#define EVADC_G5_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002192Cu)

/** Alias (User Manual Name) for EVADC_G5_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G5_Q1_Q0R.
*/
#define	EVADC_G5Q0R1	(EVADC_G5_Q1_Q0R)

/** \brief  1920, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G5_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021920u)

/** Alias (User Manual Name) for EVADC_G5_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G5_Q1_QCTRL.
*/
#define	EVADC_G5QCTRL1	(EVADC_G5_Q1_QCTRL)

/** \brief  1930, Queue 0 Input Register, Group 0 */
#define EVADC_G5_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021930u)

/** Alias (User Manual Name) for EVADC_G5_Q1_QINR.
* To use register names with standard convension, please use EVADC_G5_Q1_QINR.
*/
#define	EVADC_G5QINR1	(EVADC_G5_Q1_QINR)

/** \brief  1924, Queue 0 Mode Register, Group 0 */
#define EVADC_G5_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021924u)

/** Alias (User Manual Name) for EVADC_G5_Q1_QMR.
* To use register names with standard convension, please use EVADC_G5_Q1_QMR.
*/
#define	EVADC_G5QMR1	(EVADC_G5_Q1_QMR)

/** \brief  1928, Queue 0 Status Register, Group 0 */
#define EVADC_G5_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021928u)

/** Alias (User Manual Name) for EVADC_G5_Q1_QSR.
* To use register names with standard convension, please use EVADC_G5_Q1_QSR.
*/
#define	EVADC_G5QSR1	(EVADC_G5_Q1_QSR)

/** \brief  1938, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G5_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021938u)

