Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G5_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G5_Q1_REQTM.
*/
#define	EVADC_G5REQTM1	(EVADC_G5_Q1_REQTM)

/** \brief  193C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G5_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002193Cu)

/** Alias (User Manual Name) for EVADC_G5_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G5_Q1_REQTS.
*/
#define	EVADC_G5REQTS1	(EVADC_G5_Q1_REQTS)

/** \brief  194C, Queue 0 Register 0, Group 0 */
#define EVADC_G5_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002194Cu)

/** Alias (User Manual Name) for EVADC_G5_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G5_Q2_Q0R.
*/
#define	EVADC_G5Q0R2	(EVADC_G5_Q2_Q0R)

/** \brief  1940, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G5_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021940u)

/** Alias (User Manual Name) for EVADC_G5_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G5_Q2_QCTRL.
*/
#define	EVADC_G5QCTRL2	(EVADC_G5_Q2_QCTRL)

/** \brief  1950, Queue 0 Input Register, Group 0 */
#define EVADC_G5_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021950u)

/** Alias (User Manual Name) for EVADC_G5_Q2_QINR.
* To use register names with standard convension, please use EVADC_G5_Q2_QINR.
*/
#define	EVADC_G5QINR2	(EVADC_G5_Q2_QINR)

/** \brief  1944, Queue 0 Mode Register, Group 0 */
#define EVADC_G5_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021944u)

/** Alias (User Manual Name) for EVADC_G5_Q2_QMR.
* To use register names with standard convension, please use EVADC_G5_Q2_QMR.
*/
#define	EVADC_G5QMR2	(EVADC_G5_Q2_QMR)

/** \brief  1948, Queue 0 Status Register, Group 0 */
#define EVADC_G5_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021948u)

/** Alias (User Manual Name) for EVADC_G5_Q2_QSR.
* To use register names with standard convension, please use EVADC_G5_Q2_QSR.
*/
#define	EVADC_G5QSR2	(EVADC_G5_Q2_QSR)

/** \brief  1954, Queue 2 Status Register, Group 5 */
#define EVADC_G5_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0021954u)

/** Alias (User Manual Name) for EVADC_G5_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G5_Q0_QSR.
*/
#define	EVADC_G5TRCTR	(EVADC_G5_Q2_TRCTR)

/** \brief  1958, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G5_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021958u)

/** Alias (User Manual Name) for EVADC_G5_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G5_Q2_REQTM.
*/
#define	EVADC_G5REQTM2	(EVADC_G5_Q2_REQTM)

/** \brief  195C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G5_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002195Cu)

/** Alias (User Manual Name) for EVADC_G5_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G5_Q2_REQTS.
*/
#define	EVADC_G5REQTS2	(EVADC_G5_Q2_REQTS)

/** \brief  1A80, Group Result Control Register */
#define EVADC_G5_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A80u)

/** Alias (User Manual Name) for EVADC_G5_RCR0.
* To use register names with standard convension, please use EVADC_G5_RCR0.
*/
#define	EVADC_G5RCR0	(EVADC_G5_RCR0)

/** \brief  1A84, Group Result Control Register */
#define EVADC_G5_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A84u)

/** Alias (User Manual Name) for EVADC_G5_RCR1.
* To use register names with standard convension, please use EVADC_G5_RCR1.
*/
#define	EVADC_G5RCR1	(EVADC_G5_RCR1)

/** \brief  1AA8, Group Result Control Register */
#define EVADC_G5_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021AA8u)

/** Alias (User Manual Name) for EVADC_G5_RCR10.
* To use register names with standard convension, please use EVADC_G5_RCR10.
*/
#define	EVADC_G5RCR10	(EVADC_G5_RCR10)

/** \brief  1AAC, Group Result Control Register */
#define EVADC_G5_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021AACu)

/** Alias (User Manual Name) for EVADC_G5_RCR11.
* To use register names with standard convension, please use EVADC_G5_RCR11.
*/
#define	EVADC_G5RCR11	(EVADC_G5_RCR11)

/** \brief  1AB0, Group Result Control Register */
#define EVADC_G5_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021AB0u)

/** Alias (User Manual Name) for EVADC_G5_RCR12.
* To use register names with standard convension, please use EVADC_G5_RCR12.
*/
#define	EVADC_G5RCR12	(EVADC_G5_RCR12)

/** \brief  1AB4, Group Result Control Register */
#define EVADC_G5_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021AB4u)

/** Alias (User Manual Name) for EVADC_G5_RCR13.
* To use register names with standard convension, please use EVADC_G5_RCR13.
*/
#define	EVADC_G5RCR13	(EVADC_G5_RCR13)

/** \brief  1AB8, Group Result Control Register */
#define EVADC_G5_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021AB8u)

/** Alias (User Manual Name) for EVADC_G5_RCR14.
* To use register names with standard convension, please use EVADC_G5_RCR14.
*/
#define	EVADC_G5RCR14	(EVADC_G5_RCR14)

/** \brief  1ABC, Group Result Control Register */
#define EVADC_G5_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021ABCu)

/** Alias (User Manual Name) for EVADC_G5_RCR15.
* To use register names with standard convension, please use EVADC_G5_RCR15.
*/
#define	EVADC_G5RCR15	(EVADC_G5_RCR15)

/** \brief  1A88, Group Result Control Register */
#define EVADC_G5_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A88u)

/** Alias (User Manual Name) for EVADC_G5_RCR2.
* To use register names with standard convension, please use EVADC_G5_RCR2.
*/
#define	EVADC_G5RCR2	(EVADC_G5_RCR2)

/** \brief  1A8C, Group Result Control Register */
#define EVADC_G5_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A8Cu)

/** Alias (User Manual Name) for EVADC_G5_RCR3.
* To use register names with standard convension, please use EVADC_G5_RCR3.
*/
#define	EVADC_G5RCR3	(EVADC_G5_RCR3)

