Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  1A90, Group Result Control Register */
#define EVADC_G5_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A90u)

/** Alias (User Manual Name) for EVADC_G5_RCR4.
* To use register names with standard convension, please use EVADC_G5_RCR4.
*/
#define	EVADC_G5RCR4	(EVADC_G5_RCR4)

/** \brief  1A94, Group Result Control Register */
#define EVADC_G5_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A94u)

/** Alias (User Manual Name) for EVADC_G5_RCR5.
* To use register names with standard convension, please use EVADC_G5_RCR5.
*/
#define	EVADC_G5RCR5	(EVADC_G5_RCR5)

/** \brief  1A98, Group Result Control Register */
#define EVADC_G5_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A98u)

/** Alias (User Manual Name) for EVADC_G5_RCR6.
* To use register names with standard convension, please use EVADC_G5_RCR6.
*/
#define	EVADC_G5RCR6	(EVADC_G5_RCR6)

/** \brief  1A9C, Group Result Control Register */
#define EVADC_G5_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021A9Cu)

/** Alias (User Manual Name) for EVADC_G5_RCR7.
* To use register names with standard convension, please use EVADC_G5_RCR7.
*/
#define	EVADC_G5RCR7	(EVADC_G5_RCR7)

/** \brief  1AA0, Group Result Control Register */
#define EVADC_G5_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021AA0u)

/** Alias (User Manual Name) for EVADC_G5_RCR8.
* To use register names with standard convension, please use EVADC_G5_RCR8.
*/
#define	EVADC_G5RCR8	(EVADC_G5_RCR8)

/** \brief  1AA4, Group Result Control Register */
#define EVADC_G5_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021AA4u)

/** Alias (User Manual Name) for EVADC_G5_RCR9.
* To use register names with standard convension, please use EVADC_G5_RCR9.
*/
#define	EVADC_G5RCR9	(EVADC_G5_RCR9)

/** \brief  1994, Result Event Flag Clear Register, Group */
#define EVADC_G5_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0021994u)

/** Alias (User Manual Name) for EVADC_G5_REFCLR.
* To use register names with standard convension, please use EVADC_G5_REFCLR.
*/
#define	EVADC_G5REFCLR	(EVADC_G5_REFCLR)

/** \brief  1984, Result Event Flag Register, Group */
#define EVADC_G5_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0021984u)

/** Alias (User Manual Name) for EVADC_G5_REFLAG.
* To use register names with standard convension, please use EVADC_G5_REFLAG.
*/
#define	EVADC_G5REFLAG	(EVADC_G5_REFLAG)

/** \brief  1B00, Group Result Register */
#define EVADC_G5_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B00u)

/** Alias (User Manual Name) for EVADC_G5_RES0.
* To use register names with standard convension, please use EVADC_G5_RES0.
*/
#define	EVADC_G5RES0	(EVADC_G5_RES0)

/** \brief  1B04, Group Result Register */
#define EVADC_G5_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B04u)

/** Alias (User Manual Name) for EVADC_G5_RES1.
* To use register names with standard convension, please use EVADC_G5_RES1.
*/
#define	EVADC_G5RES1	(EVADC_G5_RES1)

/** \brief  1B28, Group Result Register */
#define EVADC_G5_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B28u)

/** Alias (User Manual Name) for EVADC_G5_RES10.
* To use register names with standard convension, please use EVADC_G5_RES10.
*/
#define	EVADC_G5RES10	(EVADC_G5_RES10)

/** \brief  1B2C, Group Result Register */
#define EVADC_G5_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B2Cu)

/** Alias (User Manual Name) for EVADC_G5_RES11.
* To use register names with standard convension, please use EVADC_G5_RES11.
*/
#define	EVADC_G5RES11	(EVADC_G5_RES11)

/** \brief  1B30, Group Result Register */
#define EVADC_G5_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B30u)

/** Alias (User Manual Name) for EVADC_G5_RES12.
* To use register names with standard convension, please use EVADC_G5_RES12.
*/
#define	EVADC_G5RES12	(EVADC_G5_RES12)

/** \brief  1B34, Group Result Register */
#define EVADC_G5_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B34u)

/** Alias (User Manual Name) for EVADC_G5_RES13.
* To use register names with standard convension, please use EVADC_G5_RES13.
*/
#define	EVADC_G5RES13	(EVADC_G5_RES13)

/** \brief  1B38, Group Result Register */
#define EVADC_G5_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B38u)

/** Alias (User Manual Name) for EVADC_G5_RES14.
* To use register names with standard convension, please use EVADC_G5_RES14.
*/
#define	EVADC_G5RES14	(EVADC_G5_RES14)

/** \brief  1B3C, Group Result Register */
#define EVADC_G5_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B3Cu)

/** Alias (User Manual Name) for EVADC_G5_RES15.
* To use register names with standard convension, please use EVADC_G5_RES15.
*/
#define	EVADC_G5RES15	(EVADC_G5_RES15)

/** \brief  1B08, Group Result Register */
#define EVADC_G5_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B08u)

/** Alias (User Manual Name) for EVADC_G5_RES2.
* To use register names with standard convension, please use EVADC_G5_RES2.
*/
#define	EVADC_G5RES2	(EVADC_G5_RES2)

/** \brief  1B0C, Group Result Register */
#define EVADC_G5_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B0Cu)

/** Alias (User Manual Name) for EVADC_G5_RES3.
* To use register names with standard convension, please use EVADC_G5_RES3.
*/
#define	EVADC_G5RES3	(EVADC_G5_RES3)

/** \brief  1B10, Group Result Register */
#define EVADC_G5_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B10u)

/** Alias (User Manual Name) for EVADC_G5_RES4.
* To use register names with standard convension, please use EVADC_G5_RES4.
*/
#define	EVADC_G5RES4	(EVADC_G5_RES4)

/** \brief  1B14, Group Result Register */
#define EVADC_G5_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B14u)

/** Alias (User Manual Name) for EVADC_G5_RES5.
* To use register names with standard convension, please use EVADC_G5_RES5.
*/
#define	EVADC_G5RES5	(EVADC_G5_RES5)

/** \brief  1B18, Group Result Register */
#define EVADC_G5_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B18u)

/** Alias (User Manual Name) for EVADC_G5_RES6.
* To use register names with standard convension, please use EVADC_G5_RES6.
*/
#define	EVADC_G5RES6	(EVADC_G5_RES6)

/** \brief  1B1C, Group Result Register */
#define EVADC_G5_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B1Cu)

/** Alias (User Manual Name) for EVADC_G5_RES7.
* To use register names with standard convension, please use EVADC_G5_RES7.
*/
#define	EVADC_G5RES7	(EVADC_G5_RES7)

