Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  1B20, Group Result Register */
#define EVADC_G5_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B20u)

/** Alias (User Manual Name) for EVADC_G5_RES8.
* To use register names with standard convension, please use EVADC_G5_RES8.
*/
#define	EVADC_G5RES8	(EVADC_G5_RES8)

/** \brief  1B24, Group Result Register */
#define EVADC_G5_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0021B24u)

/** Alias (User Manual Name) for EVADC_G5_RES9.
* To use register names with standard convension, please use EVADC_G5_RES9.
*/
#define	EVADC_G5RES9	(EVADC_G5_RES9)

/** \brief  1B80, Group Result Reg., Debug */
#define EVADC_G5_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B80u)

/** Alias (User Manual Name) for EVADC_G5_RESD0.
* To use register names with standard convension, please use EVADC_G5_RESD0.
*/
#define	EVADC_G5RESD0	(EVADC_G5_RESD0)

/** \brief  1B84, Group Result Reg., Debug */
#define EVADC_G5_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B84u)

/** Alias (User Manual Name) for EVADC_G5_RESD1.
* To use register names with standard convension, please use EVADC_G5_RESD1.
*/
#define	EVADC_G5RESD1	(EVADC_G5_RESD1)

/** \brief  1BA8, Group Result Reg., Debug */
#define EVADC_G5_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BA8u)

/** Alias (User Manual Name) for EVADC_G5_RESD10.
* To use register names with standard convension, please use EVADC_G5_RESD10.
*/
#define	EVADC_G5RESD10	(EVADC_G5_RESD10)

/** \brief  1BAC, Group Result Reg., Debug */
#define EVADC_G5_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BACu)

/** Alias (User Manual Name) for EVADC_G5_RESD11.
* To use register names with standard convension, please use EVADC_G5_RESD11.
*/
#define	EVADC_G5RESD11	(EVADC_G5_RESD11)

/** \brief  1BB0, Group Result Reg., Debug */
#define EVADC_G5_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BB0u)

/** Alias (User Manual Name) for EVADC_G5_RESD12.
* To use register names with standard convension, please use EVADC_G5_RESD12.
*/
#define	EVADC_G5RESD12	(EVADC_G5_RESD12)

/** \brief  1BB4, Group Result Reg., Debug */
#define EVADC_G5_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BB4u)

/** Alias (User Manual Name) for EVADC_G5_RESD13.
* To use register names with standard convension, please use EVADC_G5_RESD13.
*/
#define	EVADC_G5RESD13	(EVADC_G5_RESD13)

/** \brief  1BB8, Group Result Reg., Debug */
#define EVADC_G5_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BB8u)

/** Alias (User Manual Name) for EVADC_G5_RESD14.
* To use register names with standard convension, please use EVADC_G5_RESD14.
*/
#define	EVADC_G5RESD14	(EVADC_G5_RESD14)

/** \brief  1BBC, Group Result Reg., Debug */
#define EVADC_G5_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BBCu)

/** Alias (User Manual Name) for EVADC_G5_RESD15.
* To use register names with standard convension, please use EVADC_G5_RESD15.
*/
#define	EVADC_G5RESD15	(EVADC_G5_RESD15)

/** \brief  1B88, Group Result Reg., Debug */
#define EVADC_G5_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B88u)

/** Alias (User Manual Name) for EVADC_G5_RESD2.
* To use register names with standard convension, please use EVADC_G5_RESD2.
*/
#define	EVADC_G5RESD2	(EVADC_G5_RESD2)

/** \brief  1B8C, Group Result Reg., Debug */
#define EVADC_G5_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B8Cu)

/** Alias (User Manual Name) for EVADC_G5_RESD3.
* To use register names with standard convension, please use EVADC_G5_RESD3.
*/
#define	EVADC_G5RESD3	(EVADC_G5_RESD3)

/** \brief  1B90, Group Result Reg., Debug */
#define EVADC_G5_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B90u)

/** Alias (User Manual Name) for EVADC_G5_RESD4.
* To use register names with standard convension, please use EVADC_G5_RESD4.
*/
#define	EVADC_G5RESD4	(EVADC_G5_RESD4)

/** \brief  1B94, Group Result Reg., Debug */
#define EVADC_G5_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B94u)

/** Alias (User Manual Name) for EVADC_G5_RESD5.
* To use register names with standard convension, please use EVADC_G5_RESD5.
*/
#define	EVADC_G5RESD5	(EVADC_G5_RESD5)

/** \brief  1B98, Group Result Reg., Debug */
#define EVADC_G5_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B98u)

/** Alias (User Manual Name) for EVADC_G5_RESD6.
* To use register names with standard convension, please use EVADC_G5_RESD6.
*/
#define	EVADC_G5RESD6	(EVADC_G5_RESD6)

/** \brief  1B9C, Group Result Reg., Debug */
#define EVADC_G5_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021B9Cu)

/** Alias (User Manual Name) for EVADC_G5_RESD7.
* To use register names with standard convension, please use EVADC_G5_RESD7.
*/
#define	EVADC_G5RESD7	(EVADC_G5_RESD7)

/** \brief  1BA0, Group Result Reg., Debug */
#define EVADC_G5_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BA0u)

/** Alias (User Manual Name) for EVADC_G5_RESD8.
* To use register names with standard convension, please use EVADC_G5_RESD8.
*/
#define	EVADC_G5RESD8	(EVADC_G5_RESD8)

/** \brief  1BA4, Group Result Reg., Debug */
#define EVADC_G5_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021BA4u)

/** Alias (User Manual Name) for EVADC_G5_RESD9.
* To use register names with standard convension, please use EVADC_G5_RESD9.
*/
#define	EVADC_G5RESD9	(EVADC_G5_RESD9)

/** \brief  19B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G5_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00219B0u)

/** Alias (User Manual Name) for EVADC_G5_REVNP0.
* To use register names with standard convension, please use EVADC_G5_REVNP0.
*/
#define	EVADC_G5REVNP0	(EVADC_G5_REVNP0)

/** \brief  19B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G5_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00219B4u)

/** Alias (User Manual Name) for EVADC_G5_REVNP1.
* To use register names with standard convension, please use EVADC_G5_REVNP1.
*/
#define	EVADC_G5REVNP1	(EVADC_G5_REVNP1)

/** \brief  1998, Source Event Flag Clear Reg., Group */
#define EVADC_G5_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0021998u)

