Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G5_SEFCLR.
* To use register names with standard convension, please use EVADC_G5_SEFCLR.
*/
#define	EVADC_G5SEFCLR	(EVADC_G5_SEFCLR)

/** \brief  1988, Source Event Flag Register, Group */
#define EVADC_G5_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0021988u)

/** Alias (User Manual Name) for EVADC_G5_SEFLAG.
* To use register names with standard convension, please use EVADC_G5_SEFLAG.
*/
#define	EVADC_G5SEFLAG	(EVADC_G5_SEFLAG)

/** \brief  19C0, Source Event Node Pointer Reg., Group */
#define EVADC_G5_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00219C0u)

/** Alias (User Manual Name) for EVADC_G5_SEVNP.
* To use register names with standard convension, please use EVADC_G5_SEVNP.
*/
#define	EVADC_G5SEVNP	(EVADC_G5_SEVNP)

/** \brief  19C8, Service Request Software Activation Trigger, Group */
#define EVADC_G5_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00219C8u)

/** Alias (User Manual Name) for EVADC_G5_SRACT.
* To use register names with standard convension, please use EVADC_G5_SRACT.
*/
#define	EVADC_G5SRACT	(EVADC_G5_SRACT)

/** \brief  18C0, Synchronization Control Register, Group */
#define EVADC_G5_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00218C0u)

/** Alias (User Manual Name) for EVADC_G5_SYNCTR.
* To use register names with standard convension, please use EVADC_G5_SYNCTR.
*/
#define	EVADC_G5SYNCTR	(EVADC_G5_SYNCTR)

/** \brief  19F8, Valid Flag Register, Group */
#define EVADC_G5_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00219F8u)

/** Alias (User Manual Name) for EVADC_G5_VFR.
* To use register names with standard convension, please use EVADC_G5_VFR.
*/
#define	EVADC_G5VFR	(EVADC_G5_VFR)

/** \brief  1CB0, Alias Register, Group */
#define EVADC_G6_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF0021CB0u)

/** Alias (User Manual Name) for EVADC_G6_ALIAS.
* To use register names with standard convension, please use EVADC_G6_ALIAS.
*/
#define	EVADC_G6ALIAS	(EVADC_G6_ALIAS)

/** \brief  1C88, Analog Fct. Config. Register, Group */
#define EVADC_G6_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0021C88u)

/** Alias (User Manual Name) for EVADC_G6_ANCFG.
* To use register names with standard convension, please use EVADC_G6_ANCFG.
*/
#define	EVADC_G6ANCFG	(EVADC_G6_ANCFG)

/** \brief  1C80, Arbitration Config. Register, Group */
#define EVADC_G6_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0021C80u)

/** Alias (User Manual Name) for EVADC_G6_ARBCFG.
* To use register names with standard convension, please use EVADC_G6_ARBCFG.
*/
#define	EVADC_G6ARBCFG	(EVADC_G6_ARBCFG)

/** \brief  1C84, Arbitration Priority Register, Group */
#define EVADC_G6_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0021C84u)

/** Alias (User Manual Name) for EVADC_G6_ARBPR.
* To use register names with standard convension, please use EVADC_G6_ARBPR.
*/
#define	EVADC_G6ARBPR	(EVADC_G6_ARBPR)

/** \brief  1CB8, Boundary Select Register, Group */
#define EVADC_G6_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF0021CB8u)

/** Alias (User Manual Name) for EVADC_G6_BOUND.
* To use register names with standard convension, please use EVADC_G6_BOUND.
*/
#define	EVADC_G6BOUND	(EVADC_G6_BOUND)

/** \brief  1D90, Channel Event Flag Clear Register, Group */
#define EVADC_G6_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0021D90u)

/** Alias (User Manual Name) for EVADC_G6_CEFCLR.
* To use register names with standard convension, please use EVADC_G6_CEFCLR.
*/
#define	EVADC_G6CEFCLR	(EVADC_G6_CEFCLR)

/** \brief  1D80, Channel Event Flag Register, Group */
#define EVADC_G6_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0021D80u)

/** Alias (User Manual Name) for EVADC_G6_CEFLAG.
* To use register names with standard convension, please use EVADC_G6_CEFLAG.
*/
#define	EVADC_G6CEFLAG	(EVADC_G6_CEFLAG)

/** \brief  1DA0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G6_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF0021DA0u)

/** Alias (User Manual Name) for EVADC_G6_CEVNP0.
* To use register names with standard convension, please use EVADC_G6_CEVNP0.
*/
#define	EVADC_G6CEVNP0	(EVADC_G6_CEVNP0)

/** \brief  1E00, Group, Channel Control Register */
#define EVADC_G6_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E00u)

/** Alias (User Manual Name) for EVADC_G6_CHCTR0.
* To use register names with standard convension, please use EVADC_G6_CHCTR0.
*/
#define	EVADC_G6CHCTR0	(EVADC_G6_CHCTR0)

/** \brief  1E04, Group, Channel Control Register */
#define EVADC_G6_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E04u)

/** Alias (User Manual Name) for EVADC_G6_CHCTR1.
* To use register names with standard convension, please use EVADC_G6_CHCTR1.
*/
#define	EVADC_G6CHCTR1	(EVADC_G6_CHCTR1)

/** \brief  1E08, Group, Channel Control Register */
#define EVADC_G6_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E08u)

/** Alias (User Manual Name) for EVADC_G6_CHCTR2.
* To use register names with standard convension, please use EVADC_G6_CHCTR2.
*/
#define	EVADC_G6CHCTR2	(EVADC_G6_CHCTR2)

/** \brief  1E0C, Group, Channel Control Register */
#define EVADC_G6_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E0Cu)

/** Alias (User Manual Name) for EVADC_G6_CHCTR3.
* To use register names with standard convension, please use EVADC_G6_CHCTR3.
*/
#define	EVADC_G6CHCTR3	(EVADC_G6_CHCTR3)

/** \brief  1E10, Group, Channel Control Register */
#define EVADC_G6_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E10u)

/** Alias (User Manual Name) for EVADC_G6_CHCTR4.
* To use register names with standard convension, please use EVADC_G6_CHCTR4.
*/
#define	EVADC_G6CHCTR4	(EVADC_G6_CHCTR4)

/** \brief  1E14, Group, Channel Control Register */
#define EVADC_G6_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E14u)

/** Alias (User Manual Name) for EVADC_G6_CHCTR5.
* To use register names with standard convension, please use EVADC_G6_CHCTR5.
*/
#define	EVADC_G6CHCTR5	(EVADC_G6_CHCTR5)

/** \brief  1E18, Group, Channel Control Register */
#define EVADC_G6_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E18u)

/** Alias (User Manual Name) for EVADC_G6_CHCTR6.
* To use register names with standard convension, please use EVADC_G6_CHCTR6.
*/
#define	EVADC_G6CHCTR6	(EVADC_G6_CHCTR6)

/** \brief  1E1C, Group, Channel Control Register */
#define EVADC_G6_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0021E1Cu)

/** Alias (User Manual Name) for EVADC_G6_CHCTR7.
* To use register names with standard convension, please use EVADC_G6_CHCTR7.
*/
#define	EVADC_G6CHCTR7	(EVADC_G6_CHCTR7)

/** \brief  1DF4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G6_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF0021DF4u)

