Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G6_EMUXCS.
* To use register names with standard convension, please use EVADC_G6_EMUXCS.
*/
#define	EVADC_G6EMUXCS	(EVADC_G6_EMUXCS)

/** \brief  1DF0, External Multiplexer Control Reg., Group */
#define EVADC_G6_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF0021DF0u)

/** Alias (User Manual Name) for EVADC_G6_EMUXCTR.
* To use register names with standard convension, please use EVADC_G6_EMUXCTR.
*/
#define	EVADC_G6EMUXCTR	(EVADC_G6_EMUXCTR)

/** \brief  1CA0, Input Class Reg0ster i, Group */
#define EVADC_G6_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0021CA0u)

/** Alias (User Manual Name) for EVADC_G6_ICLASS0.
* To use register names with standard convension, please use EVADC_G6_ICLASS0.
*/
#define	EVADC_G6ICLASS0	(EVADC_G6_ICLASS0)

/** \brief  1CA4, Input Class Reg0ster i, Group */
#define EVADC_G6_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0021CA4u)

/** Alias (User Manual Name) for EVADC_G6_ICLASS1.
* To use register names with standard convension, please use EVADC_G6_ICLASS1.
*/
#define	EVADC_G6ICLASS1	(EVADC_G6_ICLASS1)

/** \brief  1D0C, Queue 0 Register 0, Group 0 */
#define EVADC_G6_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0021D0Cu)

/** Alias (User Manual Name) for EVADC_G6_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G6_Q0_Q0R.
*/
#define	EVADC_G6Q0R0	(EVADC_G6_Q0_Q0R)

/** \brief  1D00, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G6_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021D00u)

/** Alias (User Manual Name) for EVADC_G6_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G6_Q0_QCTRL.
*/
#define	EVADC_G6QCTRL0	(EVADC_G6_Q0_QCTRL)

/** \brief  1D10, Queue 0 Input Register, Group 0 */
#define EVADC_G6_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021D10u)

/** Alias (User Manual Name) for EVADC_G6_Q0_QINR.
* To use register names with standard convension, please use EVADC_G6_Q0_QINR.
*/
#define	EVADC_G6QINR0	(EVADC_G6_Q0_QINR)

/** \brief  1D04, Queue 0 Mode Register, Group 0 */
#define EVADC_G6_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021D04u)

/** Alias (User Manual Name) for EVADC_G6_Q0_QMR.
* To use register names with standard convension, please use EVADC_G6_Q0_QMR.
*/
#define	EVADC_G6QMR0	(EVADC_G6_Q0_QMR)

/** \brief  1D08, Queue 0 Status Register, Group 0 */
#define EVADC_G6_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021D08u)

/** Alias (User Manual Name) for EVADC_G6_Q0_QSR.
* To use register names with standard convension, please use EVADC_G6_Q0_QSR.
*/
#define	EVADC_G6QSR0	(EVADC_G6_Q0_QSR)

/** \brief  1D18, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G6_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021D18u)

/** Alias (User Manual Name) for EVADC_G6_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G6_Q0_REQTM.
*/
#define	EVADC_G6REQTM0	(EVADC_G6_Q0_REQTM)

/** \brief  1D1C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G6_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0021D1Cu)

/** Alias (User Manual Name) for EVADC_G6_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G6_Q0_REQTS.
*/
#define	EVADC_G6REQTS0	(EVADC_G6_Q0_REQTS)

/** \brief  1D2C, Queue 0 Register 0, Group 0 */
#define EVADC_G6_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0021D2Cu)

/** Alias (User Manual Name) for EVADC_G6_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G6_Q1_Q0R.
*/
#define	EVADC_G6Q0R1	(EVADC_G6_Q1_Q0R)

/** \brief  1D20, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G6_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021D20u)

/** Alias (User Manual Name) for EVADC_G6_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G6_Q1_QCTRL.
*/
#define	EVADC_G6QCTRL1	(EVADC_G6_Q1_QCTRL)

/** \brief  1D30, Queue 0 Input Register, Group 0 */
#define EVADC_G6_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021D30u)

/** Alias (User Manual Name) for EVADC_G6_Q1_QINR.
* To use register names with standard convension, please use EVADC_G6_Q1_QINR.
*/
#define	EVADC_G6QINR1	(EVADC_G6_Q1_QINR)

/** \brief  1D24, Queue 0 Mode Register, Group 0 */
#define EVADC_G6_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021D24u)

/** Alias (User Manual Name) for EVADC_G6_Q1_QMR.
* To use register names with standard convension, please use EVADC_G6_Q1_QMR.
*/
#define	EVADC_G6QMR1	(EVADC_G6_Q1_QMR)

/** \brief  1D28, Queue 0 Status Register, Group 0 */
#define EVADC_G6_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021D28u)

/** Alias (User Manual Name) for EVADC_G6_Q1_QSR.
* To use register names with standard convension, please use EVADC_G6_Q1_QSR.
*/
#define	EVADC_G6QSR1	(EVADC_G6_Q1_QSR)

/** \brief  1D38, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G6_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021D38u)

/** Alias (User Manual Name) for EVADC_G6_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G6_Q1_REQTM.
*/
#define	EVADC_G6REQTM1	(EVADC_G6_Q1_REQTM)

/** \brief  1D3C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G6_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0021D3Cu)

/** Alias (User Manual Name) for EVADC_G6_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G6_Q1_REQTS.
*/
#define	EVADC_G6REQTS1	(EVADC_G6_Q1_REQTS)

/** \brief  1D4C, Queue 0 Register 0, Group 0 */
#define EVADC_G6_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0021D4Cu)

/** Alias (User Manual Name) for EVADC_G6_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G6_Q2_Q0R.
*/
#define	EVADC_G6Q0R2	(EVADC_G6_Q2_Q0R)

/** \brief  1D40, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G6_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021D40u)

/** Alias (User Manual Name) for EVADC_G6_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G6_Q2_QCTRL.
*/
#define	EVADC_G6QCTRL2	(EVADC_G6_Q2_QCTRL)

/** \brief  1D50, Queue 0 Input Register, Group 0 */
#define EVADC_G6_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021D50u)

