Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G6_Q2_QINR.
* To use register names with standard convension, please use EVADC_G6_Q2_QINR.
*/
#define	EVADC_G6QINR2	(EVADC_G6_Q2_QINR)

/** \brief  1D44, Queue 0 Mode Register, Group 0 */
#define EVADC_G6_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021D44u)

/** Alias (User Manual Name) for EVADC_G6_Q2_QMR.
* To use register names with standard convension, please use EVADC_G6_Q2_QMR.
*/
#define	EVADC_G6QMR2	(EVADC_G6_Q2_QMR)

/** \brief  1D48, Queue 0 Status Register, Group 0 */
#define EVADC_G6_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021D48u)

/** Alias (User Manual Name) for EVADC_G6_Q2_QSR.
* To use register names with standard convension, please use EVADC_G6_Q2_QSR.
*/
#define	EVADC_G6QSR2	(EVADC_G6_Q2_QSR)

/** \brief  1D54, Queue 2 Status Register, Group 6 */
#define EVADC_G6_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0021D54u)

/** Alias (User Manual Name) for EVADC_G6_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G6_Q0_QSR.
*/
#define	EVADC_G6TRCTR	(EVADC_G6_Q2_TRCTR)

/** \brief  1D58, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G6_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021D58u)

/** Alias (User Manual Name) for EVADC_G6_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G6_Q2_REQTM.
*/
#define	EVADC_G6REQTM2	(EVADC_G6_Q2_REQTM)

/** \brief  1D5C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G6_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0021D5Cu)

/** Alias (User Manual Name) for EVADC_G6_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G6_Q2_REQTS.
*/
#define	EVADC_G6REQTS2	(EVADC_G6_Q2_REQTS)

/** \brief  1E80, Group Result Control Register */
#define EVADC_G6_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E80u)

/** Alias (User Manual Name) for EVADC_G6_RCR0.
* To use register names with standard convension, please use EVADC_G6_RCR0.
*/
#define	EVADC_G6RCR0	(EVADC_G6_RCR0)

/** \brief  1E84, Group Result Control Register */
#define EVADC_G6_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E84u)

/** Alias (User Manual Name) for EVADC_G6_RCR1.
* To use register names with standard convension, please use EVADC_G6_RCR1.
*/
#define	EVADC_G6RCR1	(EVADC_G6_RCR1)

/** \brief  1EA8, Group Result Control Register */
#define EVADC_G6_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021EA8u)

/** Alias (User Manual Name) for EVADC_G6_RCR10.
* To use register names with standard convension, please use EVADC_G6_RCR10.
*/
#define	EVADC_G6RCR10	(EVADC_G6_RCR10)

/** \brief  1EAC, Group Result Control Register */
#define EVADC_G6_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021EACu)

/** Alias (User Manual Name) for EVADC_G6_RCR11.
* To use register names with standard convension, please use EVADC_G6_RCR11.
*/
#define	EVADC_G6RCR11	(EVADC_G6_RCR11)

/** \brief  1EB0, Group Result Control Register */
#define EVADC_G6_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021EB0u)

/** Alias (User Manual Name) for EVADC_G6_RCR12.
* To use register names with standard convension, please use EVADC_G6_RCR12.
*/
#define	EVADC_G6RCR12	(EVADC_G6_RCR12)

/** \brief  1EB4, Group Result Control Register */
#define EVADC_G6_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021EB4u)

/** Alias (User Manual Name) for EVADC_G6_RCR13.
* To use register names with standard convension, please use EVADC_G6_RCR13.
*/
#define	EVADC_G6RCR13	(EVADC_G6_RCR13)

/** \brief  1EB8, Group Result Control Register */
#define EVADC_G6_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021EB8u)

/** Alias (User Manual Name) for EVADC_G6_RCR14.
* To use register names with standard convension, please use EVADC_G6_RCR14.
*/
#define	EVADC_G6RCR14	(EVADC_G6_RCR14)

/** \brief  1EBC, Group Result Control Register */
#define EVADC_G6_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021EBCu)

/** Alias (User Manual Name) for EVADC_G6_RCR15.
* To use register names with standard convension, please use EVADC_G6_RCR15.
*/
#define	EVADC_G6RCR15	(EVADC_G6_RCR15)

/** \brief  1E88, Group Result Control Register */
#define EVADC_G6_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E88u)

/** Alias (User Manual Name) for EVADC_G6_RCR2.
* To use register names with standard convension, please use EVADC_G6_RCR2.
*/
#define	EVADC_G6RCR2	(EVADC_G6_RCR2)

/** \brief  1E8C, Group Result Control Register */
#define EVADC_G6_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E8Cu)

/** Alias (User Manual Name) for EVADC_G6_RCR3.
* To use register names with standard convension, please use EVADC_G6_RCR3.
*/
#define	EVADC_G6RCR3	(EVADC_G6_RCR3)

/** \brief  1E90, Group Result Control Register */
#define EVADC_G6_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E90u)

/** Alias (User Manual Name) for EVADC_G6_RCR4.
* To use register names with standard convension, please use EVADC_G6_RCR4.
*/
#define	EVADC_G6RCR4	(EVADC_G6_RCR4)

/** \brief  1E94, Group Result Control Register */
#define EVADC_G6_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E94u)

/** Alias (User Manual Name) for EVADC_G6_RCR5.
* To use register names with standard convension, please use EVADC_G6_RCR5.
*/
#define	EVADC_G6RCR5	(EVADC_G6_RCR5)

/** \brief  1E98, Group Result Control Register */
#define EVADC_G6_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E98u)

/** Alias (User Manual Name) for EVADC_G6_RCR6.
* To use register names with standard convension, please use EVADC_G6_RCR6.
*/
#define	EVADC_G6RCR6	(EVADC_G6_RCR6)

/** \brief  1E9C, Group Result Control Register */
#define EVADC_G6_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021E9Cu)

/** Alias (User Manual Name) for EVADC_G6_RCR7.
* To use register names with standard convension, please use EVADC_G6_RCR7.
*/
#define	EVADC_G6RCR7	(EVADC_G6_RCR7)

/** \brief  1EA0, Group Result Control Register */
#define EVADC_G6_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0021EA0u)

/** Alias (User Manual Name) for EVADC_G6_RCR8.
* To use register names with standard convension, please use EVADC_G6_RCR8.
*/
#define	EVADC_G6RCR8	(EVADC_G6_RCR8)

