Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G6_RESD10.
* To use register names with standard convension, please use EVADC_G6_RESD10.
*/
#define	EVADC_G6RESD10	(EVADC_G6_RESD10)

/** \brief  1FAC, Group Result Reg., Debug */
#define EVADC_G6_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021FACu)

/** Alias (User Manual Name) for EVADC_G6_RESD11.
* To use register names with standard convension, please use EVADC_G6_RESD11.
*/
#define	EVADC_G6RESD11	(EVADC_G6_RESD11)

/** \brief  1FB0, Group Result Reg., Debug */
#define EVADC_G6_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021FB0u)

/** Alias (User Manual Name) for EVADC_G6_RESD12.
* To use register names with standard convension, please use EVADC_G6_RESD12.
*/
#define	EVADC_G6RESD12	(EVADC_G6_RESD12)

/** \brief  1FB4, Group Result Reg., Debug */
#define EVADC_G6_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021FB4u)

/** Alias (User Manual Name) for EVADC_G6_RESD13.
* To use register names with standard convension, please use EVADC_G6_RESD13.
*/
#define	EVADC_G6RESD13	(EVADC_G6_RESD13)

/** \brief  1FB8, Group Result Reg., Debug */
#define EVADC_G6_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021FB8u)

/** Alias (User Manual Name) for EVADC_G6_RESD14.
* To use register names with standard convension, please use EVADC_G6_RESD14.
*/
#define	EVADC_G6RESD14	(EVADC_G6_RESD14)

/** \brief  1FBC, Group Result Reg., Debug */
#define EVADC_G6_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021FBCu)

/** Alias (User Manual Name) for EVADC_G6_RESD15.
* To use register names with standard convension, please use EVADC_G6_RESD15.
*/
#define	EVADC_G6RESD15	(EVADC_G6_RESD15)

/** \brief  1F88, Group Result Reg., Debug */
#define EVADC_G6_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021F88u)

/** Alias (User Manual Name) for EVADC_G6_RESD2.
* To use register names with standard convension, please use EVADC_G6_RESD2.
*/
#define	EVADC_G6RESD2	(EVADC_G6_RESD2)

/** \brief  1F8C, Group Result Reg., Debug */
#define EVADC_G6_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021F8Cu)

/** Alias (User Manual Name) for EVADC_G6_RESD3.
* To use register names with standard convension, please use EVADC_G6_RESD3.
*/
#define	EVADC_G6RESD3	(EVADC_G6_RESD3)

/** \brief  1F90, Group Result Reg., Debug */
#define EVADC_G6_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021F90u)

/** Alias (User Manual Name) for EVADC_G6_RESD4.
* To use register names with standard convension, please use EVADC_G6_RESD4.
*/
#define	EVADC_G6RESD4	(EVADC_G6_RESD4)

/** \brief  1F94, Group Result Reg., Debug */
#define EVADC_G6_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021F94u)

/** Alias (User Manual Name) for EVADC_G6_RESD5.
* To use register names with standard convension, please use EVADC_G6_RESD5.
*/
#define	EVADC_G6RESD5	(EVADC_G6_RESD5)

/** \brief  1F98, Group Result Reg., Debug */
#define EVADC_G6_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021F98u)

/** Alias (User Manual Name) for EVADC_G6_RESD6.
* To use register names with standard convension, please use EVADC_G6_RESD6.
*/
#define	EVADC_G6RESD6	(EVADC_G6_RESD6)

/** \brief  1F9C, Group Result Reg., Debug */
#define EVADC_G6_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021F9Cu)

/** Alias (User Manual Name) for EVADC_G6_RESD7.
* To use register names with standard convension, please use EVADC_G6_RESD7.
*/
#define	EVADC_G6RESD7	(EVADC_G6_RESD7)

/** \brief  1FA0, Group Result Reg., Debug */
#define EVADC_G6_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021FA0u)

/** Alias (User Manual Name) for EVADC_G6_RESD8.
* To use register names with standard convension, please use EVADC_G6_RESD8.
*/
#define	EVADC_G6RESD8	(EVADC_G6_RESD8)

/** \brief  1FA4, Group Result Reg., Debug */
#define EVADC_G6_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0021FA4u)

/** Alias (User Manual Name) for EVADC_G6_RESD9.
* To use register names with standard convension, please use EVADC_G6_RESD9.
*/
#define	EVADC_G6RESD9	(EVADC_G6_RESD9)

/** \brief  1DB0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G6_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF0021DB0u)

/** Alias (User Manual Name) for EVADC_G6_REVNP0.
* To use register names with standard convension, please use EVADC_G6_REVNP0.
*/
#define	EVADC_G6REVNP0	(EVADC_G6_REVNP0)

/** \brief  1DB4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G6_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF0021DB4u)

/** Alias (User Manual Name) for EVADC_G6_REVNP1.
* To use register names with standard convension, please use EVADC_G6_REVNP1.
*/
#define	EVADC_G6REVNP1	(EVADC_G6_REVNP1)

/** \brief  1D98, Source Event Flag Clear Reg., Group */
#define EVADC_G6_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0021D98u)

/** Alias (User Manual Name) for EVADC_G6_SEFCLR.
* To use register names with standard convension, please use EVADC_G6_SEFCLR.
*/
#define	EVADC_G6SEFCLR	(EVADC_G6_SEFCLR)

/** \brief  1D88, Source Event Flag Register, Group */
#define EVADC_G6_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0021D88u)

/** Alias (User Manual Name) for EVADC_G6_SEFLAG.
* To use register names with standard convension, please use EVADC_G6_SEFLAG.
*/
#define	EVADC_G6SEFLAG	(EVADC_G6_SEFLAG)

/** \brief  1DC0, Source Event Node Pointer Reg., Group */
#define EVADC_G6_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF0021DC0u)

/** Alias (User Manual Name) for EVADC_G6_SEVNP.
* To use register names with standard convension, please use EVADC_G6_SEVNP.
*/
#define	EVADC_G6SEVNP	(EVADC_G6_SEVNP)

/** \brief  1DC8, Service Request Software Activation Trigger, Group */
#define EVADC_G6_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF0021DC8u)

/** Alias (User Manual Name) for EVADC_G6_SRACT.
* To use register names with standard convension, please use EVADC_G6_SRACT.
*/
#define	EVADC_G6SRACT	(EVADC_G6_SRACT)

/** \brief  1CC0, Synchronization Control Register, Group */
#define EVADC_G6_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF0021CC0u)

