Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G6_SYNCTR.
* To use register names with standard convension, please use EVADC_G6_SYNCTR.
*/
#define	EVADC_G6SYNCTR	(EVADC_G6_SYNCTR)

/** \brief  1DF8, Valid Flag Register, Group */
#define EVADC_G6_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF0021DF8u)

/** Alias (User Manual Name) for EVADC_G6_VFR.
* To use register names with standard convension, please use EVADC_G6_VFR.
*/
#define	EVADC_G6VFR	(EVADC_G6_VFR)

/** \brief  20B0, Alias Register, Group */
#define EVADC_G7_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00220B0u)

/** Alias (User Manual Name) for EVADC_G7_ALIAS.
* To use register names with standard convension, please use EVADC_G7_ALIAS.
*/
#define	EVADC_G7ALIAS	(EVADC_G7_ALIAS)

/** \brief  2088, Analog Fct. Config. Register, Group */
#define EVADC_G7_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0022088u)

/** Alias (User Manual Name) for EVADC_G7_ANCFG.
* To use register names with standard convension, please use EVADC_G7_ANCFG.
*/
#define	EVADC_G7ANCFG	(EVADC_G7_ANCFG)

/** \brief  2080, Arbitration Config. Register, Group */
#define EVADC_G7_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0022080u)

/** Alias (User Manual Name) for EVADC_G7_ARBCFG.
* To use register names with standard convension, please use EVADC_G7_ARBCFG.
*/
#define	EVADC_G7ARBCFG	(EVADC_G7_ARBCFG)

/** \brief  2084, Arbitration Priority Register, Group */
#define EVADC_G7_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0022084u)

/** Alias (User Manual Name) for EVADC_G7_ARBPR.
* To use register names with standard convension, please use EVADC_G7_ARBPR.
*/
#define	EVADC_G7ARBPR	(EVADC_G7_ARBPR)

/** \brief  20B8, Boundary Select Register, Group */
#define EVADC_G7_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00220B8u)

/** Alias (User Manual Name) for EVADC_G7_BOUND.
* To use register names with standard convension, please use EVADC_G7_BOUND.
*/
#define	EVADC_G7BOUND	(EVADC_G7_BOUND)

/** \brief  2190, Channel Event Flag Clear Register, Group */
#define EVADC_G7_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0022190u)

/** Alias (User Manual Name) for EVADC_G7_CEFCLR.
* To use register names with standard convension, please use EVADC_G7_CEFCLR.
*/
#define	EVADC_G7CEFCLR	(EVADC_G7_CEFCLR)

/** \brief  2180, Channel Event Flag Register, Group */
#define EVADC_G7_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0022180u)

/** Alias (User Manual Name) for EVADC_G7_CEFLAG.
* To use register names with standard convension, please use EVADC_G7_CEFLAG.
*/
#define	EVADC_G7CEFLAG	(EVADC_G7_CEFLAG)

/** \brief  21A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G7_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00221A0u)

/** Alias (User Manual Name) for EVADC_G7_CEVNP0.
* To use register names with standard convension, please use EVADC_G7_CEVNP0.
*/
#define	EVADC_G7CEVNP0	(EVADC_G7_CEVNP0)

/** \brief  2200, Group, Channel Control Register */
#define EVADC_G7_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022200u)

/** Alias (User Manual Name) for EVADC_G7_CHCTR0.
* To use register names with standard convension, please use EVADC_G7_CHCTR0.
*/
#define	EVADC_G7CHCTR0	(EVADC_G7_CHCTR0)

/** \brief  2204, Group, Channel Control Register */
#define EVADC_G7_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022204u)

/** Alias (User Manual Name) for EVADC_G7_CHCTR1.
* To use register names with standard convension, please use EVADC_G7_CHCTR1.
*/
#define	EVADC_G7CHCTR1	(EVADC_G7_CHCTR1)

/** \brief  2208, Group, Channel Control Register */
#define EVADC_G7_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022208u)

/** Alias (User Manual Name) for EVADC_G7_CHCTR2.
* To use register names with standard convension, please use EVADC_G7_CHCTR2.
*/
#define	EVADC_G7CHCTR2	(EVADC_G7_CHCTR2)

/** \brief  220C, Group, Channel Control Register */
#define EVADC_G7_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002220Cu)

/** Alias (User Manual Name) for EVADC_G7_CHCTR3.
* To use register names with standard convension, please use EVADC_G7_CHCTR3.
*/
#define	EVADC_G7CHCTR3	(EVADC_G7_CHCTR3)

/** \brief  2210, Group, Channel Control Register */
#define EVADC_G7_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022210u)

/** Alias (User Manual Name) for EVADC_G7_CHCTR4.
* To use register names with standard convension, please use EVADC_G7_CHCTR4.
*/
#define	EVADC_G7CHCTR4	(EVADC_G7_CHCTR4)

/** \brief  2214, Group, Channel Control Register */
#define EVADC_G7_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022214u)

/** Alias (User Manual Name) for EVADC_G7_CHCTR5.
* To use register names with standard convension, please use EVADC_G7_CHCTR5.
*/
#define	EVADC_G7CHCTR5	(EVADC_G7_CHCTR5)

/** \brief  2218, Group, Channel Control Register */
#define EVADC_G7_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022218u)

/** Alias (User Manual Name) for EVADC_G7_CHCTR6.
* To use register names with standard convension, please use EVADC_G7_CHCTR6.
*/
#define	EVADC_G7CHCTR6	(EVADC_G7_CHCTR6)

/** \brief  221C, Group, Channel Control Register */
#define EVADC_G7_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002221Cu)

/** Alias (User Manual Name) for EVADC_G7_CHCTR7.
* To use register names with standard convension, please use EVADC_G7_CHCTR7.
*/
#define	EVADC_G7CHCTR7	(EVADC_G7_CHCTR7)

/** \brief  21F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G7_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00221F4u)

/** Alias (User Manual Name) for EVADC_G7_EMUXCS.
* To use register names with standard convension, please use EVADC_G7_EMUXCS.
*/
#define	EVADC_G7EMUXCS	(EVADC_G7_EMUXCS)

/** \brief  21F0, External Multiplexer Control Reg., Group */
#define EVADC_G7_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00221F0u)

/** Alias (User Manual Name) for EVADC_G7_EMUXCTR.
* To use register names with standard convension, please use EVADC_G7_EMUXCTR.
*/
#define	EVADC_G7EMUXCTR	(EVADC_G7_EMUXCTR)

/** \brief  20A0, Input Class Reg0ster i, Group */
#define EVADC_G7_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00220A0u)

/** Alias (User Manual Name) for EVADC_G7_ICLASS0.
* To use register names with standard convension, please use EVADC_G7_ICLASS0.
*/
#define	EVADC_G7ICLASS0	(EVADC_G7_ICLASS0)

/** \brief  20A4, Input Class Reg0ster i, Group */
#define EVADC_G7_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00220A4u)

