Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G7_ICLASS1.
* To use register names with standard convension, please use EVADC_G7_ICLASS1.
*/
#define	EVADC_G7ICLASS1	(EVADC_G7_ICLASS1)

/** \brief  210C, Queue 0 Register 0, Group 0 */
#define EVADC_G7_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002210Cu)

/** Alias (User Manual Name) for EVADC_G7_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G7_Q0_Q0R.
*/
#define	EVADC_G7Q0R0	(EVADC_G7_Q0_Q0R)

/** \brief  2100, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G7_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022100u)

/** Alias (User Manual Name) for EVADC_G7_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G7_Q0_QCTRL.
*/
#define	EVADC_G7QCTRL0	(EVADC_G7_Q0_QCTRL)

/** \brief  2110, Queue 0 Input Register, Group 0 */
#define EVADC_G7_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022110u)

/** Alias (User Manual Name) for EVADC_G7_Q0_QINR.
* To use register names with standard convension, please use EVADC_G7_Q0_QINR.
*/
#define	EVADC_G7QINR0	(EVADC_G7_Q0_QINR)

/** \brief  2104, Queue 0 Mode Register, Group 0 */
#define EVADC_G7_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022104u)

/** Alias (User Manual Name) for EVADC_G7_Q0_QMR.
* To use register names with standard convension, please use EVADC_G7_Q0_QMR.
*/
#define	EVADC_G7QMR0	(EVADC_G7_Q0_QMR)

/** \brief  2108, Queue 0 Status Register, Group 0 */
#define EVADC_G7_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022108u)

/** Alias (User Manual Name) for EVADC_G7_Q0_QSR.
* To use register names with standard convension, please use EVADC_G7_Q0_QSR.
*/
#define	EVADC_G7QSR0	(EVADC_G7_Q0_QSR)

/** \brief  2118, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G7_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022118u)

/** Alias (User Manual Name) for EVADC_G7_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G7_Q0_REQTM.
*/
#define	EVADC_G7REQTM0	(EVADC_G7_Q0_REQTM)

/** \brief  211C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G7_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002211Cu)

/** Alias (User Manual Name) for EVADC_G7_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G7_Q0_REQTS.
*/
#define	EVADC_G7REQTS0	(EVADC_G7_Q0_REQTS)

/** \brief  212C, Queue 0 Register 0, Group 0 */
#define EVADC_G7_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002212Cu)

/** Alias (User Manual Name) for EVADC_G7_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G7_Q1_Q0R.
*/
#define	EVADC_G7Q0R1	(EVADC_G7_Q1_Q0R)

/** \brief  2120, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G7_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022120u)

/** Alias (User Manual Name) for EVADC_G7_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G7_Q1_QCTRL.
*/
#define	EVADC_G7QCTRL1	(EVADC_G7_Q1_QCTRL)

/** \brief  2130, Queue 0 Input Register, Group 0 */
#define EVADC_G7_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022130u)

/** Alias (User Manual Name) for EVADC_G7_Q1_QINR.
* To use register names with standard convension, please use EVADC_G7_Q1_QINR.
*/
#define	EVADC_G7QINR1	(EVADC_G7_Q1_QINR)

/** \brief  2124, Queue 0 Mode Register, Group 0 */
#define EVADC_G7_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022124u)

/** Alias (User Manual Name) for EVADC_G7_Q1_QMR.
* To use register names with standard convension, please use EVADC_G7_Q1_QMR.
*/
#define	EVADC_G7QMR1	(EVADC_G7_Q1_QMR)

/** \brief  2128, Queue 0 Status Register, Group 0 */
#define EVADC_G7_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022128u)

/** Alias (User Manual Name) for EVADC_G7_Q1_QSR.
* To use register names with standard convension, please use EVADC_G7_Q1_QSR.
*/
#define	EVADC_G7QSR1	(EVADC_G7_Q1_QSR)

/** \brief  2138, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G7_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022138u)

/** Alias (User Manual Name) for EVADC_G7_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G7_Q1_REQTM.
*/
#define	EVADC_G7REQTM1	(EVADC_G7_Q1_REQTM)

/** \brief  213C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G7_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002213Cu)

/** Alias (User Manual Name) for EVADC_G7_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G7_Q1_REQTS.
*/
#define	EVADC_G7REQTS1	(EVADC_G7_Q1_REQTS)

/** \brief  214C, Queue 0 Register 0, Group 0 */
#define EVADC_G7_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002214Cu)

/** Alias (User Manual Name) for EVADC_G7_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G7_Q2_Q0R.
*/
#define	EVADC_G7Q0R2	(EVADC_G7_Q2_Q0R)

/** \brief  2140, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G7_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022140u)

/** Alias (User Manual Name) for EVADC_G7_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G7_Q2_QCTRL.
*/
#define	EVADC_G7QCTRL2	(EVADC_G7_Q2_QCTRL)

/** \brief  2150, Queue 0 Input Register, Group 0 */
#define EVADC_G7_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022150u)

/** Alias (User Manual Name) for EVADC_G7_Q2_QINR.
* To use register names with standard convension, please use EVADC_G7_Q2_QINR.
*/
#define	EVADC_G7QINR2	(EVADC_G7_Q2_QINR)

/** \brief  2144, Queue 0 Mode Register, Group 0 */
#define EVADC_G7_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022144u)

/** Alias (User Manual Name) for EVADC_G7_Q2_QMR.
* To use register names with standard convension, please use EVADC_G7_Q2_QMR.
*/
#define	EVADC_G7QMR2	(EVADC_G7_Q2_QMR)

/** \brief  2148, Queue 0 Status Register, Group 0 */
#define EVADC_G7_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022148u)

