Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G7_Q2_QSR.
* To use register names with standard convension, please use EVADC_G7_Q2_QSR.
*/
#define	EVADC_G7QSR2	(EVADC_G7_Q2_QSR)

/** \brief  2154, Queue 2 Status Register, Group 7 */
#define EVADC_G7_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0022154u)

/** Alias (User Manual Name) for EVADC_G7_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G7_Q0_QSR.
*/
#define	EVADC_G7TRCTR	(EVADC_G7_Q2_TRCTR)

/** \brief  2158, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G7_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022158u)

/** Alias (User Manual Name) for EVADC_G7_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G7_Q2_REQTM.
*/
#define	EVADC_G7REQTM2	(EVADC_G7_Q2_REQTM)

/** \brief  215C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G7_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002215Cu)

/** Alias (User Manual Name) for EVADC_G7_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G7_Q2_REQTS.
*/
#define	EVADC_G7REQTS2	(EVADC_G7_Q2_REQTS)

/** \brief  2280, Group Result Control Register */
#define EVADC_G7_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022280u)

/** Alias (User Manual Name) for EVADC_G7_RCR0.
* To use register names with standard convension, please use EVADC_G7_RCR0.
*/
#define	EVADC_G7RCR0	(EVADC_G7_RCR0)

/** \brief  2284, Group Result Control Register */
#define EVADC_G7_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022284u)

/** Alias (User Manual Name) for EVADC_G7_RCR1.
* To use register names with standard convension, please use EVADC_G7_RCR1.
*/
#define	EVADC_G7RCR1	(EVADC_G7_RCR1)

/** \brief  22A8, Group Result Control Register */
#define EVADC_G7_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222A8u)

/** Alias (User Manual Name) for EVADC_G7_RCR10.
* To use register names with standard convension, please use EVADC_G7_RCR10.
*/
#define	EVADC_G7RCR10	(EVADC_G7_RCR10)

/** \brief  22AC, Group Result Control Register */
#define EVADC_G7_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222ACu)

/** Alias (User Manual Name) for EVADC_G7_RCR11.
* To use register names with standard convension, please use EVADC_G7_RCR11.
*/
#define	EVADC_G7RCR11	(EVADC_G7_RCR11)

/** \brief  22B0, Group Result Control Register */
#define EVADC_G7_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222B0u)

/** Alias (User Manual Name) for EVADC_G7_RCR12.
* To use register names with standard convension, please use EVADC_G7_RCR12.
*/
#define	EVADC_G7RCR12	(EVADC_G7_RCR12)

/** \brief  22B4, Group Result Control Register */
#define EVADC_G7_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222B4u)

/** Alias (User Manual Name) for EVADC_G7_RCR13.
* To use register names with standard convension, please use EVADC_G7_RCR13.
*/
#define	EVADC_G7RCR13	(EVADC_G7_RCR13)

/** \brief  22B8, Group Result Control Register */
#define EVADC_G7_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222B8u)

/** Alias (User Manual Name) for EVADC_G7_RCR14.
* To use register names with standard convension, please use EVADC_G7_RCR14.
*/
#define	EVADC_G7RCR14	(EVADC_G7_RCR14)

/** \brief  22BC, Group Result Control Register */
#define EVADC_G7_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222BCu)

/** Alias (User Manual Name) for EVADC_G7_RCR15.
* To use register names with standard convension, please use EVADC_G7_RCR15.
*/
#define	EVADC_G7RCR15	(EVADC_G7_RCR15)

/** \brief  2288, Group Result Control Register */
#define EVADC_G7_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022288u)

/** Alias (User Manual Name) for EVADC_G7_RCR2.
* To use register names with standard convension, please use EVADC_G7_RCR2.
*/
#define	EVADC_G7RCR2	(EVADC_G7_RCR2)

/** \brief  228C, Group Result Control Register */
#define EVADC_G7_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002228Cu)

/** Alias (User Manual Name) for EVADC_G7_RCR3.
* To use register names with standard convension, please use EVADC_G7_RCR3.
*/
#define	EVADC_G7RCR3	(EVADC_G7_RCR3)

/** \brief  2290, Group Result Control Register */
#define EVADC_G7_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022290u)

/** Alias (User Manual Name) for EVADC_G7_RCR4.
* To use register names with standard convension, please use EVADC_G7_RCR4.
*/
#define	EVADC_G7RCR4	(EVADC_G7_RCR4)

/** \brief  2294, Group Result Control Register */
#define EVADC_G7_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022294u)

/** Alias (User Manual Name) for EVADC_G7_RCR5.
* To use register names with standard convension, please use EVADC_G7_RCR5.
*/
#define	EVADC_G7RCR5	(EVADC_G7_RCR5)

/** \brief  2298, Group Result Control Register */
#define EVADC_G7_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022298u)

/** Alias (User Manual Name) for EVADC_G7_RCR6.
* To use register names with standard convension, please use EVADC_G7_RCR6.
*/
#define	EVADC_G7RCR6	(EVADC_G7_RCR6)

/** \brief  229C, Group Result Control Register */
#define EVADC_G7_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002229Cu)

/** Alias (User Manual Name) for EVADC_G7_RCR7.
* To use register names with standard convension, please use EVADC_G7_RCR7.
*/
#define	EVADC_G7RCR7	(EVADC_G7_RCR7)

/** \brief  22A0, Group Result Control Register */
#define EVADC_G7_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222A0u)

/** Alias (User Manual Name) for EVADC_G7_RCR8.
* To use register names with standard convension, please use EVADC_G7_RCR8.
*/
#define	EVADC_G7RCR8	(EVADC_G7_RCR8)

/** \brief  22A4, Group Result Control Register */
#define EVADC_G7_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00222A4u)

/** Alias (User Manual Name) for EVADC_G7_RCR9.
* To use register names with standard convension, please use EVADC_G7_RCR9.
*/
#define	EVADC_G7RCR9	(EVADC_G7_RCR9)

/** \brief  2194, Result Event Flag Clear Register, Group */
#define EVADC_G7_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0022194u)

/** Alias (User Manual Name) for EVADC_G7_REFCLR.
* To use register names with standard convension, please use EVADC_G7_REFCLR.
*/
#define	EVADC_G7REFCLR	(EVADC_G7_REFCLR)

/** \brief  2184, Result Event Flag Register, Group */
#define EVADC_G7_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0022184u)

/** Alias (User Manual Name) for EVADC_G7_REFLAG.
* To use register names with standard convension, please use EVADC_G7_REFLAG.
*/
#define	EVADC_G7REFLAG	(EVADC_G7_REFLAG)

/** \brief  2300, Group Result Register */
#define EVADC_G7_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022300u)

