Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G7_RES0.
* To use register names with standard convension, please use EVADC_G7_RES0.
*/
#define	EVADC_G7RES0	(EVADC_G7_RES0)

/** \brief  2304, Group Result Register */
#define EVADC_G7_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022304u)

/** Alias (User Manual Name) for EVADC_G7_RES1.
* To use register names with standard convension, please use EVADC_G7_RES1.
*/
#define	EVADC_G7RES1	(EVADC_G7_RES1)

/** \brief  2328, Group Result Register */
#define EVADC_G7_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022328u)

/** Alias (User Manual Name) for EVADC_G7_RES10.
* To use register names with standard convension, please use EVADC_G7_RES10.
*/
#define	EVADC_G7RES10	(EVADC_G7_RES10)

/** \brief  232C, Group Result Register */
#define EVADC_G7_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002232Cu)

/** Alias (User Manual Name) for EVADC_G7_RES11.
* To use register names with standard convension, please use EVADC_G7_RES11.
*/
#define	EVADC_G7RES11	(EVADC_G7_RES11)

/** \brief  2330, Group Result Register */
#define EVADC_G7_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022330u)

/** Alias (User Manual Name) for EVADC_G7_RES12.
* To use register names with standard convension, please use EVADC_G7_RES12.
*/
#define	EVADC_G7RES12	(EVADC_G7_RES12)

/** \brief  2334, Group Result Register */
#define EVADC_G7_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022334u)

/** Alias (User Manual Name) for EVADC_G7_RES13.
* To use register names with standard convension, please use EVADC_G7_RES13.
*/
#define	EVADC_G7RES13	(EVADC_G7_RES13)

/** \brief  2338, Group Result Register */
#define EVADC_G7_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022338u)

/** Alias (User Manual Name) for EVADC_G7_RES14.
* To use register names with standard convension, please use EVADC_G7_RES14.
*/
#define	EVADC_G7RES14	(EVADC_G7_RES14)

/** \brief  233C, Group Result Register */
#define EVADC_G7_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002233Cu)

/** Alias (User Manual Name) for EVADC_G7_RES15.
* To use register names with standard convension, please use EVADC_G7_RES15.
*/
#define	EVADC_G7RES15	(EVADC_G7_RES15)

/** \brief  2308, Group Result Register */
#define EVADC_G7_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022308u)

/** Alias (User Manual Name) for EVADC_G7_RES2.
* To use register names with standard convension, please use EVADC_G7_RES2.
*/
#define	EVADC_G7RES2	(EVADC_G7_RES2)

/** \brief  230C, Group Result Register */
#define EVADC_G7_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002230Cu)

/** Alias (User Manual Name) for EVADC_G7_RES3.
* To use register names with standard convension, please use EVADC_G7_RES3.
*/
#define	EVADC_G7RES3	(EVADC_G7_RES3)

/** \brief  2310, Group Result Register */
#define EVADC_G7_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022310u)

/** Alias (User Manual Name) for EVADC_G7_RES4.
* To use register names with standard convension, please use EVADC_G7_RES4.
*/
#define	EVADC_G7RES4	(EVADC_G7_RES4)

/** \brief  2314, Group Result Register */
#define EVADC_G7_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022314u)

/** Alias (User Manual Name) for EVADC_G7_RES5.
* To use register names with standard convension, please use EVADC_G7_RES5.
*/
#define	EVADC_G7RES5	(EVADC_G7_RES5)

/** \brief  2318, Group Result Register */
#define EVADC_G7_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022318u)

/** Alias (User Manual Name) for EVADC_G7_RES6.
* To use register names with standard convension, please use EVADC_G7_RES6.
*/
#define	EVADC_G7RES6	(EVADC_G7_RES6)

/** \brief  231C, Group Result Register */
#define EVADC_G7_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF002231Cu)

/** Alias (User Manual Name) for EVADC_G7_RES7.
* To use register names with standard convension, please use EVADC_G7_RES7.
*/
#define	EVADC_G7RES7	(EVADC_G7_RES7)

/** \brief  2320, Group Result Register */
#define EVADC_G7_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022320u)

/** Alias (User Manual Name) for EVADC_G7_RES8.
* To use register names with standard convension, please use EVADC_G7_RES8.
*/
#define	EVADC_G7RES8	(EVADC_G7_RES8)

/** \brief  2324, Group Result Register */
#define EVADC_G7_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022324u)

/** Alias (User Manual Name) for EVADC_G7_RES9.
* To use register names with standard convension, please use EVADC_G7_RES9.
*/
#define	EVADC_G7RES9	(EVADC_G7_RES9)

/** \brief  2380, Group Result Reg., Debug */
#define EVADC_G7_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022380u)

/** Alias (User Manual Name) for EVADC_G7_RESD0.
* To use register names with standard convension, please use EVADC_G7_RESD0.
*/
#define	EVADC_G7RESD0	(EVADC_G7_RESD0)

/** \brief  2384, Group Result Reg., Debug */
#define EVADC_G7_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022384u)

/** Alias (User Manual Name) for EVADC_G7_RESD1.
* To use register names with standard convension, please use EVADC_G7_RESD1.
*/
#define	EVADC_G7RESD1	(EVADC_G7_RESD1)

/** \brief  23A8, Group Result Reg., Debug */
#define EVADC_G7_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223A8u)

/** Alias (User Manual Name) for EVADC_G7_RESD10.
* To use register names with standard convension, please use EVADC_G7_RESD10.
*/
#define	EVADC_G7RESD10	(EVADC_G7_RESD10)

/** \brief  23AC, Group Result Reg., Debug */
#define EVADC_G7_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223ACu)

/** Alias (User Manual Name) for EVADC_G7_RESD11.
* To use register names with standard convension, please use EVADC_G7_RESD11.
*/
#define	EVADC_G7RESD11	(EVADC_G7_RESD11)

/** \brief  23B0, Group Result Reg., Debug */
#define EVADC_G7_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223B0u)

/** Alias (User Manual Name) for EVADC_G7_RESD12.
* To use register names with standard convension, please use EVADC_G7_RESD12.
*/
#define	EVADC_G7RESD12	(EVADC_G7_RESD12)

/** \brief  23B4, Group Result Reg., Debug */
#define EVADC_G7_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223B4u)

