Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G7_RESD13.
* To use register names with standard convension, please use EVADC_G7_RESD13.
*/
#define	EVADC_G7RESD13	(EVADC_G7_RESD13)

/** \brief  23B8, Group Result Reg., Debug */
#define EVADC_G7_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223B8u)

/** Alias (User Manual Name) for EVADC_G7_RESD14.
* To use register names with standard convension, please use EVADC_G7_RESD14.
*/
#define	EVADC_G7RESD14	(EVADC_G7_RESD14)

/** \brief  23BC, Group Result Reg., Debug */
#define EVADC_G7_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223BCu)

/** Alias (User Manual Name) for EVADC_G7_RESD15.
* To use register names with standard convension, please use EVADC_G7_RESD15.
*/
#define	EVADC_G7RESD15	(EVADC_G7_RESD15)

/** \brief  2388, Group Result Reg., Debug */
#define EVADC_G7_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022388u)

/** Alias (User Manual Name) for EVADC_G7_RESD2.
* To use register names with standard convension, please use EVADC_G7_RESD2.
*/
#define	EVADC_G7RESD2	(EVADC_G7_RESD2)

/** \brief  238C, Group Result Reg., Debug */
#define EVADC_G7_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002238Cu)

/** Alias (User Manual Name) for EVADC_G7_RESD3.
* To use register names with standard convension, please use EVADC_G7_RESD3.
*/
#define	EVADC_G7RESD3	(EVADC_G7_RESD3)

/** \brief  2390, Group Result Reg., Debug */
#define EVADC_G7_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022390u)

/** Alias (User Manual Name) for EVADC_G7_RESD4.
* To use register names with standard convension, please use EVADC_G7_RESD4.
*/
#define	EVADC_G7RESD4	(EVADC_G7_RESD4)

/** \brief  2394, Group Result Reg., Debug */
#define EVADC_G7_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022394u)

/** Alias (User Manual Name) for EVADC_G7_RESD5.
* To use register names with standard convension, please use EVADC_G7_RESD5.
*/
#define	EVADC_G7RESD5	(EVADC_G7_RESD5)

/** \brief  2398, Group Result Reg., Debug */
#define EVADC_G7_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022398u)

/** Alias (User Manual Name) for EVADC_G7_RESD6.
* To use register names with standard convension, please use EVADC_G7_RESD6.
*/
#define	EVADC_G7RESD6	(EVADC_G7_RESD6)

/** \brief  239C, Group Result Reg., Debug */
#define EVADC_G7_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002239Cu)

/** Alias (User Manual Name) for EVADC_G7_RESD7.
* To use register names with standard convension, please use EVADC_G7_RESD7.
*/
#define	EVADC_G7RESD7	(EVADC_G7_RESD7)

/** \brief  23A0, Group Result Reg., Debug */
#define EVADC_G7_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223A0u)

/** Alias (User Manual Name) for EVADC_G7_RESD8.
* To use register names with standard convension, please use EVADC_G7_RESD8.
*/
#define	EVADC_G7RESD8	(EVADC_G7_RESD8)

/** \brief  23A4, Group Result Reg., Debug */
#define EVADC_G7_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00223A4u)

/** Alias (User Manual Name) for EVADC_G7_RESD9.
* To use register names with standard convension, please use EVADC_G7_RESD9.
*/
#define	EVADC_G7RESD9	(EVADC_G7_RESD9)

/** \brief  21B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G7_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00221B0u)

/** Alias (User Manual Name) for EVADC_G7_REVNP0.
* To use register names with standard convension, please use EVADC_G7_REVNP0.
*/
#define	EVADC_G7REVNP0	(EVADC_G7_REVNP0)

/** \brief  21B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G7_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00221B4u)

/** Alias (User Manual Name) for EVADC_G7_REVNP1.
* To use register names with standard convension, please use EVADC_G7_REVNP1.
*/
#define	EVADC_G7REVNP1	(EVADC_G7_REVNP1)

/** \brief  2198, Source Event Flag Clear Reg., Group */
#define EVADC_G7_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0022198u)

/** Alias (User Manual Name) for EVADC_G7_SEFCLR.
* To use register names with standard convension, please use EVADC_G7_SEFCLR.
*/
#define	EVADC_G7SEFCLR	(EVADC_G7_SEFCLR)

/** \brief  2188, Source Event Flag Register, Group */
#define EVADC_G7_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0022188u)

/** Alias (User Manual Name) for EVADC_G7_SEFLAG.
* To use register names with standard convension, please use EVADC_G7_SEFLAG.
*/
#define	EVADC_G7SEFLAG	(EVADC_G7_SEFLAG)

/** \brief  21C0, Source Event Node Pointer Reg., Group */
#define EVADC_G7_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00221C0u)

/** Alias (User Manual Name) for EVADC_G7_SEVNP.
* To use register names with standard convension, please use EVADC_G7_SEVNP.
*/
#define	EVADC_G7SEVNP	(EVADC_G7_SEVNP)

/** \brief  21C8, Service Request Software Activation Trigger, Group */
#define EVADC_G7_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00221C8u)

/** Alias (User Manual Name) for EVADC_G7_SRACT.
* To use register names with standard convension, please use EVADC_G7_SRACT.
*/
#define	EVADC_G7SRACT	(EVADC_G7_SRACT)

/** \brief  20C0, Synchronization Control Register, Group */
#define EVADC_G7_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00220C0u)

/** Alias (User Manual Name) for EVADC_G7_SYNCTR.
* To use register names with standard convension, please use EVADC_G7_SYNCTR.
*/
#define	EVADC_G7SYNCTR	(EVADC_G7_SYNCTR)

/** \brief  21F8, Valid Flag Register, Group */
#define EVADC_G7_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00221F8u)

/** Alias (User Manual Name) for EVADC_G7_VFR.
* To use register names with standard convension, please use EVADC_G7_VFR.
*/
#define	EVADC_G7VFR	(EVADC_G7_VFR)

/** \brief  24B0, Alias Register, Group */
#define EVADC_G8_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00224B0u)

/** Alias (User Manual Name) for EVADC_G8_ALIAS.
* To use register names with standard convension, please use EVADC_G8_ALIAS.
*/
#define	EVADC_G8ALIAS	(EVADC_G8_ALIAS)

/** \brief  2488, Analog Fct. Config. Register, Group */
#define EVADC_G8_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0022488u)

/** Alias (User Manual Name) for EVADC_G8_ANCFG.
* To use register names with standard convension, please use EVADC_G8_ANCFG.
*/
#define	EVADC_G8ANCFG	(EVADC_G8_ANCFG)

/** \brief  2480, Arbitration Config. Register, Group */
#define EVADC_G8_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0022480u)

/** Alias (User Manual Name) for EVADC_G8_ARBCFG.
* To use register names with standard convension, please use EVADC_G8_ARBCFG.
*/
#define	EVADC_G8ARBCFG	(EVADC_G8_ARBCFG)

