Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  2484, Arbitration Priority Register, Group */
#define EVADC_G8_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0022484u)

/** Alias (User Manual Name) for EVADC_G8_ARBPR.
* To use register names with standard convension, please use EVADC_G8_ARBPR.
*/
#define	EVADC_G8ARBPR	(EVADC_G8_ARBPR)

/** \brief  24B8, Boundary Select Register, Group */
#define EVADC_G8_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00224B8u)

/** Alias (User Manual Name) for EVADC_G8_BOUND.
* To use register names with standard convension, please use EVADC_G8_BOUND.
*/
#define	EVADC_G8BOUND	(EVADC_G8_BOUND)

/** \brief  2590, Channel Event Flag Clear Register, Group */
#define EVADC_G8_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0022590u)

/** Alias (User Manual Name) for EVADC_G8_CEFCLR.
* To use register names with standard convension, please use EVADC_G8_CEFCLR.
*/
#define	EVADC_G8CEFCLR	(EVADC_G8_CEFCLR)

/** \brief  2580, Channel Event Flag Register, Group */
#define EVADC_G8_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0022580u)

/** Alias (User Manual Name) for EVADC_G8_CEFLAG.
* To use register names with standard convension, please use EVADC_G8_CEFLAG.
*/
#define	EVADC_G8CEFLAG	(EVADC_G8_CEFLAG)

/** \brief  25A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G8_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00225A0u)

/** Alias (User Manual Name) for EVADC_G8_CEVNP0.
* To use register names with standard convension, please use EVADC_G8_CEVNP0.
*/
#define	EVADC_G8CEVNP0	(EVADC_G8_CEVNP0)

/** \brief  2600, Group, Channel Control Register */
#define EVADC_G8_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022600u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR0.
* To use register names with standard convension, please use EVADC_G8_CHCTR0.
*/
#define	EVADC_G8CHCTR0	(EVADC_G8_CHCTR0)

/** \brief  2604, Group, Channel Control Register */
#define EVADC_G8_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022604u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR1.
* To use register names with standard convension, please use EVADC_G8_CHCTR1.
*/
#define	EVADC_G8CHCTR1	(EVADC_G8_CHCTR1)

/** \brief  2628, Group, Channel Control Register */
#define EVADC_G8_CHCTR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022628u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR10.
* To use register names with standard convension, please use EVADC_G8_CHCTR10.
*/
#define	EVADC_G8CHCTR10	(EVADC_G8_CHCTR10)

/** \brief  262C, Group, Channel Control Register */
#define EVADC_G8_CHCTR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002262Cu)

/** Alias (User Manual Name) for EVADC_G8_CHCTR11.
* To use register names with standard convension, please use EVADC_G8_CHCTR11.
*/
#define	EVADC_G8CHCTR11	(EVADC_G8_CHCTR11)

/** \brief  2630, Group, Channel Control Register */
#define EVADC_G8_CHCTR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022630u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR12.
* To use register names with standard convension, please use EVADC_G8_CHCTR12.
*/
#define	EVADC_G8CHCTR12	(EVADC_G8_CHCTR12)

/** \brief  2634, Group, Channel Control Register */
#define EVADC_G8_CHCTR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022634u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR13.
* To use register names with standard convension, please use EVADC_G8_CHCTR13.
*/
#define	EVADC_G8CHCTR13	(EVADC_G8_CHCTR13)

/** \brief  2638, Group, Channel Control Register */
#define EVADC_G8_CHCTR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022638u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR14.
* To use register names with standard convension, please use EVADC_G8_CHCTR14.
*/
#define	EVADC_G8CHCTR14	(EVADC_G8_CHCTR14)

/** \brief  263C, Group, Channel Control Register */
#define EVADC_G8_CHCTR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002263Cu)

/** Alias (User Manual Name) for EVADC_G8_CHCTR15.
* To use register names with standard convension, please use EVADC_G8_CHCTR15.
*/
#define	EVADC_G8CHCTR15	(EVADC_G8_CHCTR15)

/** \brief  2608, Group, Channel Control Register */
#define EVADC_G8_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022608u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR2.
* To use register names with standard convension, please use EVADC_G8_CHCTR2.
*/
#define	EVADC_G8CHCTR2	(EVADC_G8_CHCTR2)

/** \brief  260C, Group, Channel Control Register */
#define EVADC_G8_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002260Cu)

/** Alias (User Manual Name) for EVADC_G8_CHCTR3.
* To use register names with standard convension, please use EVADC_G8_CHCTR3.
*/
#define	EVADC_G8CHCTR3	(EVADC_G8_CHCTR3)

/** \brief  2610, Group, Channel Control Register */
#define EVADC_G8_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022610u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR4.
* To use register names with standard convension, please use EVADC_G8_CHCTR4.
*/
#define	EVADC_G8CHCTR4	(EVADC_G8_CHCTR4)

/** \brief  2614, Group, Channel Control Register */
#define EVADC_G8_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022614u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR5.
* To use register names with standard convension, please use EVADC_G8_CHCTR5.
*/
#define	EVADC_G8CHCTR5	(EVADC_G8_CHCTR5)

/** \brief  2618, Group, Channel Control Register */
#define EVADC_G8_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022618u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR6.
* To use register names with standard convension, please use EVADC_G8_CHCTR6.
*/
#define	EVADC_G8CHCTR6	(EVADC_G8_CHCTR6)

/** \brief  261C, Group, Channel Control Register */
#define EVADC_G8_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF002261Cu)

/** Alias (User Manual Name) for EVADC_G8_CHCTR7.
* To use register names with standard convension, please use EVADC_G8_CHCTR7.
*/
#define	EVADC_G8CHCTR7	(EVADC_G8_CHCTR7)

/** \brief  2620, Group, Channel Control Register */
#define EVADC_G8_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022620u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR8.
* To use register names with standard convension, please use EVADC_G8_CHCTR8.
*/
#define	EVADC_G8CHCTR8	(EVADC_G8_CHCTR8)

/** \brief  2624, Group, Channel Control Register */
#define EVADC_G8_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022624u)

/** Alias (User Manual Name) for EVADC_G8_CHCTR9.
* To use register names with standard convension, please use EVADC_G8_CHCTR9.
*/
#define	EVADC_G8CHCTR9	(EVADC_G8_CHCTR9)

/** \brief  25F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G8_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00225F4u)

/** Alias (User Manual Name) for EVADC_G8_EMUXCS.
* To use register names with standard convension, please use EVADC_G8_EMUXCS.
*/
#define	EVADC_G8EMUXCS	(EVADC_G8_EMUXCS)

/** \brief  25F0, External Multiplexer Control Reg., Group */
#define EVADC_G8_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00225F0u)

/** Alias (User Manual Name) for EVADC_G8_EMUXCTR.
* To use register names with standard convension, please use EVADC_G8_EMUXCTR.
*/
#define	EVADC_G8EMUXCTR	(EVADC_G8_EMUXCTR)

/** \brief  24A0, Input Class Reg0ster i, Group */
#define EVADC_G8_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00224A0u)

