Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G8_ICLASS0.
* To use register names with standard convension, please use EVADC_G8_ICLASS0.
*/
#define	EVADC_G8ICLASS0	(EVADC_G8_ICLASS0)

/** \brief  24A4, Input Class Reg0ster i, Group */
#define EVADC_G8_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00224A4u)

/** Alias (User Manual Name) for EVADC_G8_ICLASS1.
* To use register names with standard convension, please use EVADC_G8_ICLASS1.
*/
#define	EVADC_G8ICLASS1	(EVADC_G8_ICLASS1)

/** \brief  250C, Queue 0 Register 0, Group 0 */
#define EVADC_G8_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002250Cu)

/** Alias (User Manual Name) for EVADC_G8_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G8_Q0_Q0R.
*/
#define	EVADC_G8Q0R0	(EVADC_G8_Q0_Q0R)

/** \brief  2500, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G8_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022500u)

/** Alias (User Manual Name) for EVADC_G8_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G8_Q0_QCTRL.
*/
#define	EVADC_G8QCTRL0	(EVADC_G8_Q0_QCTRL)

/** \brief  2510, Queue 0 Input Register, Group 0 */
#define EVADC_G8_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022510u)

/** Alias (User Manual Name) for EVADC_G8_Q0_QINR.
* To use register names with standard convension, please use EVADC_G8_Q0_QINR.
*/
#define	EVADC_G8QINR0	(EVADC_G8_Q0_QINR)

/** \brief  2504, Queue 0 Mode Register, Group 0 */
#define EVADC_G8_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022504u)

/** Alias (User Manual Name) for EVADC_G8_Q0_QMR.
* To use register names with standard convension, please use EVADC_G8_Q0_QMR.
*/
#define	EVADC_G8QMR0	(EVADC_G8_Q0_QMR)

/** \brief  2508, Queue 0 Status Register, Group 0 */
#define EVADC_G8_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022508u)

/** Alias (User Manual Name) for EVADC_G8_Q0_QSR.
* To use register names with standard convension, please use EVADC_G8_Q0_QSR.
*/
#define	EVADC_G8QSR0	(EVADC_G8_Q0_QSR)

/** \brief  2518, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G8_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022518u)

/** Alias (User Manual Name) for EVADC_G8_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G8_Q0_REQTM.
*/
#define	EVADC_G8REQTM0	(EVADC_G8_Q0_REQTM)

/** \brief  251C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G8_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002251Cu)

/** Alias (User Manual Name) for EVADC_G8_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G8_Q0_REQTS.
*/
#define	EVADC_G8REQTS0	(EVADC_G8_Q0_REQTS)

/** \brief  252C, Queue 0 Register 0, Group 0 */
#define EVADC_G8_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002252Cu)

/** Alias (User Manual Name) for EVADC_G8_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G8_Q1_Q0R.
*/
#define	EVADC_G8Q0R1	(EVADC_G8_Q1_Q0R)

/** \brief  2520, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G8_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022520u)

/** Alias (User Manual Name) for EVADC_G8_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G8_Q1_QCTRL.
*/
#define	EVADC_G8QCTRL1	(EVADC_G8_Q1_QCTRL)

/** \brief  2530, Queue 0 Input Register, Group 0 */
#define EVADC_G8_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022530u)

/** Alias (User Manual Name) for EVADC_G8_Q1_QINR.
* To use register names with standard convension, please use EVADC_G8_Q1_QINR.
*/
#define	EVADC_G8QINR1	(EVADC_G8_Q1_QINR)

/** \brief  2524, Queue 0 Mode Register, Group 0 */
#define EVADC_G8_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022524u)

/** Alias (User Manual Name) for EVADC_G8_Q1_QMR.
* To use register names with standard convension, please use EVADC_G8_Q1_QMR.
*/
#define	EVADC_G8QMR1	(EVADC_G8_Q1_QMR)

/** \brief  2528, Queue 0 Status Register, Group 0 */
#define EVADC_G8_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022528u)

/** Alias (User Manual Name) for EVADC_G8_Q1_QSR.
* To use register names with standard convension, please use EVADC_G8_Q1_QSR.
*/
#define	EVADC_G8QSR1	(EVADC_G8_Q1_QSR)

/** \brief  2538, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G8_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022538u)

/** Alias (User Manual Name) for EVADC_G8_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G8_Q1_REQTM.
*/
#define	EVADC_G8REQTM1	(EVADC_G8_Q1_REQTM)

/** \brief  253C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G8_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002253Cu)

/** Alias (User Manual Name) for EVADC_G8_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G8_Q1_REQTS.
*/
#define	EVADC_G8REQTS1	(EVADC_G8_Q1_REQTS)

/** \brief  254C, Queue 0 Register 0, Group 0 */
#define EVADC_G8_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002254Cu)

/** Alias (User Manual Name) for EVADC_G8_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G8_Q2_Q0R.
*/
#define	EVADC_G8Q0R2	(EVADC_G8_Q2_Q0R)

/** \brief  2540, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G8_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022540u)

/** Alias (User Manual Name) for EVADC_G8_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G8_Q2_QCTRL.
*/
#define	EVADC_G8QCTRL2	(EVADC_G8_Q2_QCTRL)

/** \brief  2550, Queue 0 Input Register, Group 0 */
#define EVADC_G8_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022550u)

/** Alias (User Manual Name) for EVADC_G8_Q2_QINR.
* To use register names with standard convension, please use EVADC_G8_Q2_QINR.
*/
#define	EVADC_G8QINR2	(EVADC_G8_Q2_QINR)

/** \brief  2544, Queue 0 Mode Register, Group 0 */
#define EVADC_G8_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022544u)

/** Alias (User Manual Name) for EVADC_G8_Q2_QMR.
* To use register names with standard convension, please use EVADC_G8_Q2_QMR.
*/
#define	EVADC_G8QMR2	(EVADC_G8_Q2_QMR)

/** \brief  2548, Queue 0 Status Register, Group 0 */
#define EVADC_G8_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022548u)

/** Alias (User Manual Name) for EVADC_G8_Q2_QSR.
* To use register names with standard convension, please use EVADC_G8_Q2_QSR.
*/
#define	EVADC_G8QSR2	(EVADC_G8_Q2_QSR)

