Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  2554, Queue 2 Status Register, Group 8 */
#define EVADC_G8_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0022554u)

/** Alias (User Manual Name) for EVADC_G8_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G8_Q0_QSR.
*/
#define	EVADC_G8TRCTR	(EVADC_G8_Q2_TRCTR)

/** \brief  2558, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G8_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022558u)

/** Alias (User Manual Name) for EVADC_G8_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G8_Q2_REQTM.
*/
#define	EVADC_G8REQTM2	(EVADC_G8_Q2_REQTM)

/** \brief  255C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G8_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002255Cu)

/** Alias (User Manual Name) for EVADC_G8_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G8_Q2_REQTS.
*/
#define	EVADC_G8REQTS2	(EVADC_G8_Q2_REQTS)

/** \brief  2680, Group Result Control Register */
#define EVADC_G8_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022680u)

/** Alias (User Manual Name) for EVADC_G8_RCR0.
* To use register names with standard convension, please use EVADC_G8_RCR0.
*/
#define	EVADC_G8RCR0	(EVADC_G8_RCR0)

/** \brief  2684, Group Result Control Register */
#define EVADC_G8_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022684u)

/** Alias (User Manual Name) for EVADC_G8_RCR1.
* To use register names with standard convension, please use EVADC_G8_RCR1.
*/
#define	EVADC_G8RCR1	(EVADC_G8_RCR1)

/** \brief  26A8, Group Result Control Register */
#define EVADC_G8_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226A8u)

/** Alias (User Manual Name) for EVADC_G8_RCR10.
* To use register names with standard convension, please use EVADC_G8_RCR10.
*/
#define	EVADC_G8RCR10	(EVADC_G8_RCR10)

/** \brief  26AC, Group Result Control Register */
#define EVADC_G8_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226ACu)

/** Alias (User Manual Name) for EVADC_G8_RCR11.
* To use register names with standard convension, please use EVADC_G8_RCR11.
*/
#define	EVADC_G8RCR11	(EVADC_G8_RCR11)

/** \brief  26B0, Group Result Control Register */
#define EVADC_G8_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226B0u)

/** Alias (User Manual Name) for EVADC_G8_RCR12.
* To use register names with standard convension, please use EVADC_G8_RCR12.
*/
#define	EVADC_G8RCR12	(EVADC_G8_RCR12)

/** \brief  26B4, Group Result Control Register */
#define EVADC_G8_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226B4u)

/** Alias (User Manual Name) for EVADC_G8_RCR13.
* To use register names with standard convension, please use EVADC_G8_RCR13.
*/
#define	EVADC_G8RCR13	(EVADC_G8_RCR13)

/** \brief  26B8, Group Result Control Register */
#define EVADC_G8_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226B8u)

/** Alias (User Manual Name) for EVADC_G8_RCR14.
* To use register names with standard convension, please use EVADC_G8_RCR14.
*/
#define	EVADC_G8RCR14	(EVADC_G8_RCR14)

/** \brief  26BC, Group Result Control Register */
#define EVADC_G8_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226BCu)

/** Alias (User Manual Name) for EVADC_G8_RCR15.
* To use register names with standard convension, please use EVADC_G8_RCR15.
*/
#define	EVADC_G8RCR15	(EVADC_G8_RCR15)

/** \brief  2688, Group Result Control Register */
#define EVADC_G8_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022688u)

/** Alias (User Manual Name) for EVADC_G8_RCR2.
* To use register names with standard convension, please use EVADC_G8_RCR2.
*/
#define	EVADC_G8RCR2	(EVADC_G8_RCR2)

/** \brief  268C, Group Result Control Register */
#define EVADC_G8_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002268Cu)

/** Alias (User Manual Name) for EVADC_G8_RCR3.
* To use register names with standard convension, please use EVADC_G8_RCR3.
*/
#define	EVADC_G8RCR3	(EVADC_G8_RCR3)

/** \brief  2690, Group Result Control Register */
#define EVADC_G8_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022690u)

/** Alias (User Manual Name) for EVADC_G8_RCR4.
* To use register names with standard convension, please use EVADC_G8_RCR4.
*/
#define	EVADC_G8RCR4	(EVADC_G8_RCR4)

/** \brief  2694, Group Result Control Register */
#define EVADC_G8_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022694u)

/** Alias (User Manual Name) for EVADC_G8_RCR5.
* To use register names with standard convension, please use EVADC_G8_RCR5.
*/
#define	EVADC_G8RCR5	(EVADC_G8_RCR5)

/** \brief  2698, Group Result Control Register */
#define EVADC_G8_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022698u)

/** Alias (User Manual Name) for EVADC_G8_RCR6.
* To use register names with standard convension, please use EVADC_G8_RCR6.
*/
#define	EVADC_G8RCR6	(EVADC_G8_RCR6)

/** \brief  269C, Group Result Control Register */
#define EVADC_G8_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF002269Cu)

/** Alias (User Manual Name) for EVADC_G8_RCR7.
* To use register names with standard convension, please use EVADC_G8_RCR7.
*/
#define	EVADC_G8RCR7	(EVADC_G8_RCR7)

/** \brief  26A0, Group Result Control Register */
#define EVADC_G8_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226A0u)

/** Alias (User Manual Name) for EVADC_G8_RCR8.
* To use register names with standard convension, please use EVADC_G8_RCR8.
*/
#define	EVADC_G8RCR8	(EVADC_G8_RCR8)

/** \brief  26A4, Group Result Control Register */
#define EVADC_G8_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF00226A4u)

/** Alias (User Manual Name) for EVADC_G8_RCR9.
* To use register names with standard convension, please use EVADC_G8_RCR9.
*/
#define	EVADC_G8RCR9	(EVADC_G8_RCR9)

/** \brief  2594, Result Event Flag Clear Register, Group */
#define EVADC_G8_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0022594u)

/** Alias (User Manual Name) for EVADC_G8_REFCLR.
* To use register names with standard convension, please use EVADC_G8_REFCLR.
*/
#define	EVADC_G8REFCLR	(EVADC_G8_REFCLR)

