Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G8_RESD12.
* To use register names with standard convension, please use EVADC_G8_RESD12.
*/
#define	EVADC_G8RESD12	(EVADC_G8_RESD12)

/** \brief  27B4, Group Result Reg., Debug */
#define EVADC_G8_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00227B4u)

/** Alias (User Manual Name) for EVADC_G8_RESD13.
* To use register names with standard convension, please use EVADC_G8_RESD13.
*/
#define	EVADC_G8RESD13	(EVADC_G8_RESD13)

/** \brief  27B8, Group Result Reg., Debug */
#define EVADC_G8_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00227B8u)

/** Alias (User Manual Name) for EVADC_G8_RESD14.
* To use register names with standard convension, please use EVADC_G8_RESD14.
*/
#define	EVADC_G8RESD14	(EVADC_G8_RESD14)

/** \brief  27BC, Group Result Reg., Debug */
#define EVADC_G8_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00227BCu)

/** Alias (User Manual Name) for EVADC_G8_RESD15.
* To use register names with standard convension, please use EVADC_G8_RESD15.
*/
#define	EVADC_G8RESD15	(EVADC_G8_RESD15)

/** \brief  2788, Group Result Reg., Debug */
#define EVADC_G8_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022788u)

/** Alias (User Manual Name) for EVADC_G8_RESD2.
* To use register names with standard convension, please use EVADC_G8_RESD2.
*/
#define	EVADC_G8RESD2	(EVADC_G8_RESD2)

/** \brief  278C, Group Result Reg., Debug */
#define EVADC_G8_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002278Cu)

/** Alias (User Manual Name) for EVADC_G8_RESD3.
* To use register names with standard convension, please use EVADC_G8_RESD3.
*/
#define	EVADC_G8RESD3	(EVADC_G8_RESD3)

/** \brief  2790, Group Result Reg., Debug */
#define EVADC_G8_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022790u)

/** Alias (User Manual Name) for EVADC_G8_RESD4.
* To use register names with standard convension, please use EVADC_G8_RESD4.
*/
#define	EVADC_G8RESD4	(EVADC_G8_RESD4)

/** \brief  2794, Group Result Reg., Debug */
#define EVADC_G8_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022794u)

/** Alias (User Manual Name) for EVADC_G8_RESD5.
* To use register names with standard convension, please use EVADC_G8_RESD5.
*/
#define	EVADC_G8RESD5	(EVADC_G8_RESD5)

/** \brief  2798, Group Result Reg., Debug */
#define EVADC_G8_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022798u)

/** Alias (User Manual Name) for EVADC_G8_RESD6.
* To use register names with standard convension, please use EVADC_G8_RESD6.
*/
#define	EVADC_G8RESD6	(EVADC_G8_RESD6)

/** \brief  279C, Group Result Reg., Debug */
#define EVADC_G8_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF002279Cu)

/** Alias (User Manual Name) for EVADC_G8_RESD7.
* To use register names with standard convension, please use EVADC_G8_RESD7.
*/
#define	EVADC_G8RESD7	(EVADC_G8_RESD7)

/** \brief  27A0, Group Result Reg., Debug */
#define EVADC_G8_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00227A0u)

/** Alias (User Manual Name) for EVADC_G8_RESD8.
* To use register names with standard convension, please use EVADC_G8_RESD8.
*/
#define	EVADC_G8RESD8	(EVADC_G8_RESD8)

/** \brief  27A4, Group Result Reg., Debug */
#define EVADC_G8_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF00227A4u)

/** Alias (User Manual Name) for EVADC_G8_RESD9.
* To use register names with standard convension, please use EVADC_G8_RESD9.
*/
#define	EVADC_G8RESD9	(EVADC_G8_RESD9)

/** \brief  25B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G8_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00225B0u)

/** Alias (User Manual Name) for EVADC_G8_REVNP0.
* To use register names with standard convension, please use EVADC_G8_REVNP0.
*/
#define	EVADC_G8REVNP0	(EVADC_G8_REVNP0)

/** \brief  25B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G8_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00225B4u)

/** Alias (User Manual Name) for EVADC_G8_REVNP1.
* To use register names with standard convension, please use EVADC_G8_REVNP1.
*/
#define	EVADC_G8REVNP1	(EVADC_G8_REVNP1)

/** \brief  2598, Source Event Flag Clear Reg., Group */
#define EVADC_G8_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0022598u)

/** Alias (User Manual Name) for EVADC_G8_SEFCLR.
* To use register names with standard convension, please use EVADC_G8_SEFCLR.
*/
#define	EVADC_G8SEFCLR	(EVADC_G8_SEFCLR)

/** \brief  2588, Source Event Flag Register, Group */
#define EVADC_G8_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0022588u)

/** Alias (User Manual Name) for EVADC_G8_SEFLAG.
* To use register names with standard convension, please use EVADC_G8_SEFLAG.
*/
#define	EVADC_G8SEFLAG	(EVADC_G8_SEFLAG)

/** \brief  25C0, Source Event Node Pointer Reg., Group */
#define EVADC_G8_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00225C0u)

/** Alias (User Manual Name) for EVADC_G8_SEVNP.
* To use register names with standard convension, please use EVADC_G8_SEVNP.
*/
#define	EVADC_G8SEVNP	(EVADC_G8_SEVNP)

/** \brief  25C8, Service Request Software Activation Trigger, Group */
#define EVADC_G8_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00225C8u)

/** Alias (User Manual Name) for EVADC_G8_SRACT.
* To use register names with standard convension, please use EVADC_G8_SRACT.
*/
#define	EVADC_G8SRACT	(EVADC_G8_SRACT)

/** \brief  24C0, Synchronization Control Register, Group */
#define EVADC_G8_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00224C0u)

/** Alias (User Manual Name) for EVADC_G8_SYNCTR.
* To use register names with standard convension, please use EVADC_G8_SYNCTR.
*/
#define	EVADC_G8SYNCTR	(EVADC_G8_SYNCTR)

/** \brief  25F8, Valid Flag Register, Group */
#define EVADC_G8_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00225F8u)

/** Alias (User Manual Name) for EVADC_G8_VFR.
* To use register names with standard convension, please use EVADC_G8_VFR.
*/
#define	EVADC_G8VFR	(EVADC_G8_VFR)

/** \brief  28B0, Alias Register, Group */
#define EVADC_G9_ALIAS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00228B0u)

