Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G9_ALIAS.
* To use register names with standard convension, please use EVADC_G9_ALIAS.
*/
#define	EVADC_G9ALIAS	(EVADC_G9_ALIAS)

/** \brief  2888, Analog Fct. Config. Register, Group */
#define EVADC_G9_ANCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0022888u)

/** Alias (User Manual Name) for EVADC_G9_ANCFG.
* To use register names with standard convension, please use EVADC_G9_ANCFG.
*/
#define	EVADC_G9ANCFG	(EVADC_G9_ANCFG)

/** \brief  2880, Arbitration Config. Register, Group */
#define EVADC_G9_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0022880u)

/** Alias (User Manual Name) for EVADC_G9_ARBCFG.
* To use register names with standard convension, please use EVADC_G9_ARBCFG.
*/
#define	EVADC_G9ARBCFG	(EVADC_G9_ARBCFG)

/** \brief  2884, Arbitration Priority Register, Group */
#define EVADC_G9_ARBPR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0022884u)

/** Alias (User Manual Name) for EVADC_G9_ARBPR.
* To use register names with standard convension, please use EVADC_G9_ARBPR.
*/
#define	EVADC_G9ARBPR	(EVADC_G9_ARBPR)

/** \brief  28B8, Boundary Select Register, Group */
#define EVADC_G9_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00228B8u)

/** Alias (User Manual Name) for EVADC_G9_BOUND.
* To use register names with standard convension, please use EVADC_G9_BOUND.
*/
#define	EVADC_G9BOUND	(EVADC_G9_BOUND)

/** \brief  2990, Channel Event Flag Clear Register, Group */
#define EVADC_G9_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0022990u)

/** Alias (User Manual Name) for EVADC_G9_CEFCLR.
* To use register names with standard convension, please use EVADC_G9_CEFCLR.
*/
#define	EVADC_G9CEFCLR	(EVADC_G9_CEFCLR)

/** \brief  2980, Channel Event Flag Register, Group */
#define EVADC_G9_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0022980u)

/** Alias (User Manual Name) for EVADC_G9_CEFLAG.
* To use register names with standard convension, please use EVADC_G9_CEFLAG.
*/
#define	EVADC_G9CEFLAG	(EVADC_G9_CEFLAG)

/** \brief  29A0, Channel Event Node Pointer Reg. 0, Group */
#define EVADC_G9_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00229A0u)

/** Alias (User Manual Name) for EVADC_G9_CEVNP0.
* To use register names with standard convension, please use EVADC_G9_CEVNP0.
*/
#define	EVADC_G9CEVNP0	(EVADC_G9_CEVNP0)

/** \brief  2A00, Group, Channel Control Register */
#define EVADC_G9_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A00u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR0.
* To use register names with standard convension, please use EVADC_G9_CHCTR0.
*/
#define	EVADC_G9CHCTR0	(EVADC_G9_CHCTR0)

/** \brief  2A04, Group, Channel Control Register */
#define EVADC_G9_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A04u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR1.
* To use register names with standard convension, please use EVADC_G9_CHCTR1.
*/
#define	EVADC_G9CHCTR1	(EVADC_G9_CHCTR1)

/** \brief  2A28, Group, Channel Control Register */
#define EVADC_G9_CHCTR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A28u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR10.
* To use register names with standard convension, please use EVADC_G9_CHCTR10.
*/
#define	EVADC_G9CHCTR10	(EVADC_G9_CHCTR10)

/** \brief  2A2C, Group, Channel Control Register */
#define EVADC_G9_CHCTR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A2Cu)

/** Alias (User Manual Name) for EVADC_G9_CHCTR11.
* To use register names with standard convension, please use EVADC_G9_CHCTR11.
*/
#define	EVADC_G9CHCTR11	(EVADC_G9_CHCTR11)

/** \brief  2A30, Group, Channel Control Register */
#define EVADC_G9_CHCTR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A30u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR12.
* To use register names with standard convension, please use EVADC_G9_CHCTR12.
*/
#define	EVADC_G9CHCTR12	(EVADC_G9_CHCTR12)

/** \brief  2A34, Group, Channel Control Register */
#define EVADC_G9_CHCTR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A34u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR13.
* To use register names with standard convension, please use EVADC_G9_CHCTR13.
*/
#define	EVADC_G9CHCTR13	(EVADC_G9_CHCTR13)

/** \brief  2A38, Group, Channel Control Register */
#define EVADC_G9_CHCTR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A38u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR14.
* To use register names with standard convension, please use EVADC_G9_CHCTR14.
*/
#define	EVADC_G9CHCTR14	(EVADC_G9_CHCTR14)

/** \brief  2A3C, Group, Channel Control Register */
#define EVADC_G9_CHCTR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A3Cu)

/** Alias (User Manual Name) for EVADC_G9_CHCTR15.
* To use register names with standard convension, please use EVADC_G9_CHCTR15.
*/
#define	EVADC_G9CHCTR15	(EVADC_G9_CHCTR15)

/** \brief  2A08, Group, Channel Control Register */
#define EVADC_G9_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A08u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR2.
* To use register names with standard convension, please use EVADC_G9_CHCTR2.
*/
#define	EVADC_G9CHCTR2	(EVADC_G9_CHCTR2)

/** \brief  2A0C, Group, Channel Control Register */
#define EVADC_G9_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A0Cu)

/** Alias (User Manual Name) for EVADC_G9_CHCTR3.
* To use register names with standard convension, please use EVADC_G9_CHCTR3.
*/
#define	EVADC_G9CHCTR3	(EVADC_G9_CHCTR3)

/** \brief  2A10, Group, Channel Control Register */
#define EVADC_G9_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A10u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR4.
* To use register names with standard convension, please use EVADC_G9_CHCTR4.
*/
#define	EVADC_G9CHCTR4	(EVADC_G9_CHCTR4)

/** \brief  2A14, Group, Channel Control Register */
#define EVADC_G9_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A14u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR5.
* To use register names with standard convension, please use EVADC_G9_CHCTR5.
*/
#define	EVADC_G9CHCTR5	(EVADC_G9_CHCTR5)

/** \brief  2A18, Group, Channel Control Register */
#define EVADC_G9_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A18u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR6.
* To use register names with standard convension, please use EVADC_G9_CHCTR6.
*/
#define	EVADC_G9CHCTR6	(EVADC_G9_CHCTR6)

/** \brief  2A1C, Group, Channel Control Register */
#define EVADC_G9_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A1Cu)

/** Alias (User Manual Name) for EVADC_G9_CHCTR7.
* To use register names with standard convension, please use EVADC_G9_CHCTR7.
*/
#define	EVADC_G9CHCTR7	(EVADC_G9_CHCTR7)

/** \brief  2A20, Group, Channel Control Register */
#define EVADC_G9_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A20u)

/** Alias (User Manual Name) for EVADC_G9_CHCTR8.
* To use register names with standard convension, please use EVADC_G9_CHCTR8.
*/
#define	EVADC_G9CHCTR8	(EVADC_G9_CHCTR8)

/** \brief  2A24, Group, Channel Control Register */
#define EVADC_G9_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_CHCTR*)0xF0022A24u)

