Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G9_CHCTR9.
* To use register names with standard convension, please use EVADC_G9_CHCTR9.
*/
#define	EVADC_G9CHCTR9	(EVADC_G9_CHCTR9)

/** \brief  29F4, Ext. Multiplexer Channel Select Reg., Group */
#define EVADC_G9_EMUXCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00229F4u)

/** Alias (User Manual Name) for EVADC_G9_EMUXCS.
* To use register names with standard convension, please use EVADC_G9_EMUXCS.
*/
#define	EVADC_G9EMUXCS	(EVADC_G9_EMUXCS)

/** \brief  29F0, External Multiplexer Control Reg., Group */
#define EVADC_G9_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00229F0u)

/** Alias (User Manual Name) for EVADC_G9_EMUXCTR.
* To use register names with standard convension, please use EVADC_G9_EMUXCTR.
*/
#define	EVADC_G9EMUXCTR	(EVADC_G9_EMUXCTR)

/** \brief  28A0, Input Class Reg0ster i, Group */
#define EVADC_G9_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00228A0u)

/** Alias (User Manual Name) for EVADC_G9_ICLASS0.
* To use register names with standard convension, please use EVADC_G9_ICLASS0.
*/
#define	EVADC_G9ICLASS0	(EVADC_G9_ICLASS0)

/** \brief  28A4, Input Class Reg0ster i, Group */
#define EVADC_G9_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00228A4u)

/** Alias (User Manual Name) for EVADC_G9_ICLASS1.
* To use register names with standard convension, please use EVADC_G9_ICLASS1.
*/
#define	EVADC_G9ICLASS1	(EVADC_G9_ICLASS1)

/** \brief  290C, Queue 0 Register 0, Group 0 */
#define EVADC_G9_Q0_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002290Cu)

/** Alias (User Manual Name) for EVADC_G9_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G9_Q0_Q0R.
*/
#define	EVADC_G9Q0R0	(EVADC_G9_Q0_Q0R)

/** \brief  2900, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G9_Q0_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022900u)

/** Alias (User Manual Name) for EVADC_G9_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G9_Q0_QCTRL.
*/
#define	EVADC_G9QCTRL0	(EVADC_G9_Q0_QCTRL)

/** \brief  2910, Queue 0 Input Register, Group 0 */
#define EVADC_G9_Q0_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022910u)

/** Alias (User Manual Name) for EVADC_G9_Q0_QINR.
* To use register names with standard convension, please use EVADC_G9_Q0_QINR.
*/
#define	EVADC_G9QINR0	(EVADC_G9_Q0_QINR)

/** \brief  2904, Queue 0 Mode Register, Group 0 */
#define EVADC_G9_Q0_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022904u)

/** Alias (User Manual Name) for EVADC_G9_Q0_QMR.
* To use register names with standard convension, please use EVADC_G9_Q0_QMR.
*/
#define	EVADC_G9QMR0	(EVADC_G9_Q0_QMR)

/** \brief  2908, Queue 0 Status Register, Group 0 */
#define EVADC_G9_Q0_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022908u)

/** Alias (User Manual Name) for EVADC_G9_Q0_QSR.
* To use register names with standard convension, please use EVADC_G9_Q0_QSR.
*/
#define	EVADC_G9QSR0	(EVADC_G9_Q0_QSR)

/** \brief  2918, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G9_Q0_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022918u)

/** Alias (User Manual Name) for EVADC_G9_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G9_Q0_REQTM.
*/
#define	EVADC_G9REQTM0	(EVADC_G9_Q0_REQTM)

/** \brief  291C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G9_Q0_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002291Cu)

/** Alias (User Manual Name) for EVADC_G9_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G9_Q0_REQTS.
*/
#define	EVADC_G9REQTS0	(EVADC_G9_Q0_REQTS)

/** \brief  292C, Queue 0 Register 0, Group 0 */
#define EVADC_G9_Q1_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002292Cu)

/** Alias (User Manual Name) for EVADC_G9_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G9_Q1_Q0R.
*/
#define	EVADC_G9Q0R1	(EVADC_G9_Q1_Q0R)

/** \brief  2920, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G9_Q1_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022920u)

/** Alias (User Manual Name) for EVADC_G9_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G9_Q1_QCTRL.
*/
#define	EVADC_G9QCTRL1	(EVADC_G9_Q1_QCTRL)

/** \brief  2930, Queue 0 Input Register, Group 0 */
#define EVADC_G9_Q1_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022930u)

/** Alias (User Manual Name) for EVADC_G9_Q1_QINR.
* To use register names with standard convension, please use EVADC_G9_Q1_QINR.
*/
#define	EVADC_G9QINR1	(EVADC_G9_Q1_QINR)

/** \brief  2924, Queue 0 Mode Register, Group 0 */
#define EVADC_G9_Q1_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022924u)

/** Alias (User Manual Name) for EVADC_G9_Q1_QMR.
* To use register names with standard convension, please use EVADC_G9_Q1_QMR.
*/
#define	EVADC_G9QMR1	(EVADC_G9_Q1_QMR)

/** \brief  2928, Queue 0 Status Register, Group 0 */
#define EVADC_G9_Q1_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022928u)

/** Alias (User Manual Name) for EVADC_G9_Q1_QSR.
* To use register names with standard convension, please use EVADC_G9_Q1_QSR.
*/
#define	EVADC_G9QSR1	(EVADC_G9_Q1_QSR)

/** \brief  2938, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G9_Q1_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022938u)

/** Alias (User Manual Name) for EVADC_G9_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G9_Q1_REQTM.
*/
#define	EVADC_G9REQTM1	(EVADC_G9_Q1_REQTM)

/** \brief  293C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G9_Q1_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002293Cu)

/** Alias (User Manual Name) for EVADC_G9_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G9_Q1_REQTS.
*/
#define	EVADC_G9REQTS1	(EVADC_G9_Q1_REQTS)

/** \brief  294C, Queue 0 Register 0, Group 0 */
#define EVADC_G9_Q2_Q0R /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002294Cu)

/** Alias (User Manual Name) for EVADC_G9_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G9_Q2_Q0R.
*/
#define	EVADC_G9Q0R2	(EVADC_G9_Q2_Q0R)

/** \brief  2940, Queue 0 Source Contr. Register, Group 0 */
#define EVADC_G9_Q2_QCTRL /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022940u)

/** Alias (User Manual Name) for EVADC_G9_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G9_Q2_QCTRL.
*/
#define	EVADC_G9QCTRL2	(EVADC_G9_Q2_QCTRL)

/** \brief  2950, Queue 0 Input Register, Group 0 */
#define EVADC_G9_Q2_QINR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022950u)

/** Alias (User Manual Name) for EVADC_G9_Q2_QINR.
* To use register names with standard convension, please use EVADC_G9_Q2_QINR.
*/
#define	EVADC_G9QINR2	(EVADC_G9_Q2_QINR)

/** \brief  2944, Queue 0 Mode Register, Group 0 */
#define EVADC_G9_Q2_QMR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022944u)

