Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G9_Q2_QMR.
* To use register names with standard convension, please use EVADC_G9_Q2_QMR.
*/
#define	EVADC_G9QMR2	(EVADC_G9_Q2_QMR)

/** \brief  2948, Queue 0 Status Register, Group 0 */
#define EVADC_G9_Q2_QSR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022948u)

/** Alias (User Manual Name) for EVADC_G9_Q2_QSR.
* To use register names with standard convension, please use EVADC_G9_Q2_QSR.
*/
#define	EVADC_G9QSR2	(EVADC_G9_Q2_QSR)

/** \brief  2954, Queue 2 Status Register, Group 7 */
#define EVADC_G9_Q2_TRCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q2_TRCTR*)0xF0022954u)

/** Alias (User Manual Name) for EVADC_G9_Q2_TRCTR.
* To use register names with standard convension, please use EVADC_G9_Q0_QSR.
*/
#define	EVADC_G9TRCTR	(EVADC_G9_Q2_TRCTR)

/** \brief  2958, Queue 0 Requ. Timer Mode Reg., Group 0 */
#define EVADC_G9_Q2_REQTM /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022958u)

/** Alias (User Manual Name) for EVADC_G9_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G9_Q2_REQTM.
*/
#define	EVADC_G9REQTM2	(EVADC_G9_Q2_REQTM)

/** \brief  295C, Queue 0 Requ. Timer Status Reg., Group 0 */
#define EVADC_G9_Q2_REQTS /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002295Cu)

/** Alias (User Manual Name) for EVADC_G9_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G9_Q2_REQTS.
*/
#define	EVADC_G9REQTS2	(EVADC_G9_Q2_REQTS)

/** \brief  2A80, Group Result Control Register */
#define EVADC_G9_RCR0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A80u)

/** Alias (User Manual Name) for EVADC_G9_RCR0.
* To use register names with standard convension, please use EVADC_G9_RCR0.
*/
#define	EVADC_G9RCR0	(EVADC_G9_RCR0)

/** \brief  2A84, Group Result Control Register */
#define EVADC_G9_RCR1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A84u)

/** Alias (User Manual Name) for EVADC_G9_RCR1.
* To use register names with standard convension, please use EVADC_G9_RCR1.
*/
#define	EVADC_G9RCR1	(EVADC_G9_RCR1)

/** \brief  2AA8, Group Result Control Register */
#define EVADC_G9_RCR10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022AA8u)

/** Alias (User Manual Name) for EVADC_G9_RCR10.
* To use register names with standard convension, please use EVADC_G9_RCR10.
*/
#define	EVADC_G9RCR10	(EVADC_G9_RCR10)

/** \brief  2AAC, Group Result Control Register */
#define EVADC_G9_RCR11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022AACu)

/** Alias (User Manual Name) for EVADC_G9_RCR11.
* To use register names with standard convension, please use EVADC_G9_RCR11.
*/
#define	EVADC_G9RCR11	(EVADC_G9_RCR11)

/** \brief  2AB0, Group Result Control Register */
#define EVADC_G9_RCR12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022AB0u)

/** Alias (User Manual Name) for EVADC_G9_RCR12.
* To use register names with standard convension, please use EVADC_G9_RCR12.
*/
#define	EVADC_G9RCR12	(EVADC_G9_RCR12)

/** \brief  2AB4, Group Result Control Register */
#define EVADC_G9_RCR13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022AB4u)

/** Alias (User Manual Name) for EVADC_G9_RCR13.
* To use register names with standard convension, please use EVADC_G9_RCR13.
*/
#define	EVADC_G9RCR13	(EVADC_G9_RCR13)

/** \brief  2AB8, Group Result Control Register */
#define EVADC_G9_RCR14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022AB8u)

/** Alias (User Manual Name) for EVADC_G9_RCR14.
* To use register names with standard convension, please use EVADC_G9_RCR14.
*/
#define	EVADC_G9RCR14	(EVADC_G9_RCR14)

/** \brief  2ABC, Group Result Control Register */
#define EVADC_G9_RCR15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022ABCu)

/** Alias (User Manual Name) for EVADC_G9_RCR15.
* To use register names with standard convension, please use EVADC_G9_RCR15.
*/
#define	EVADC_G9RCR15	(EVADC_G9_RCR15)

/** \brief  2A88, Group Result Control Register */
#define EVADC_G9_RCR2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A88u)

/** Alias (User Manual Name) for EVADC_G9_RCR2.
* To use register names with standard convension, please use EVADC_G9_RCR2.
*/
#define	EVADC_G9RCR2	(EVADC_G9_RCR2)

/** \brief  2A8C, Group Result Control Register */
#define EVADC_G9_RCR3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A8Cu)

/** Alias (User Manual Name) for EVADC_G9_RCR3.
* To use register names with standard convension, please use EVADC_G9_RCR3.
*/
#define	EVADC_G9RCR3	(EVADC_G9_RCR3)

/** \brief  2A90, Group Result Control Register */
#define EVADC_G9_RCR4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A90u)

/** Alias (User Manual Name) for EVADC_G9_RCR4.
* To use register names with standard convension, please use EVADC_G9_RCR4.
*/
#define	EVADC_G9RCR4	(EVADC_G9_RCR4)

/** \brief  2A94, Group Result Control Register */
#define EVADC_G9_RCR5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A94u)

/** Alias (User Manual Name) for EVADC_G9_RCR5.
* To use register names with standard convension, please use EVADC_G9_RCR5.
*/
#define	EVADC_G9RCR5	(EVADC_G9_RCR5)

/** \brief  2A98, Group Result Control Register */
#define EVADC_G9_RCR6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A98u)

/** Alias (User Manual Name) for EVADC_G9_RCR6.
* To use register names with standard convension, please use EVADC_G9_RCR6.
*/
#define	EVADC_G9RCR6	(EVADC_G9_RCR6)

/** \brief  2A9C, Group Result Control Register */
#define EVADC_G9_RCR7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022A9Cu)

/** Alias (User Manual Name) for EVADC_G9_RCR7.
* To use register names with standard convension, please use EVADC_G9_RCR7.
*/
#define	EVADC_G9RCR7	(EVADC_G9_RCR7)

/** \brief  2AA0, Group Result Control Register */
#define EVADC_G9_RCR8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022AA0u)

/** Alias (User Manual Name) for EVADC_G9_RCR8.
* To use register names with standard convension, please use EVADC_G9_RCR8.
*/
#define	EVADC_G9RCR8	(EVADC_G9_RCR8)

/** \brief  2AA4, Group Result Control Register */
#define EVADC_G9_RCR9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RCR*)0xF0022AA4u)

/** Alias (User Manual Name) for EVADC_G9_RCR9.
* To use register names with standard convension, please use EVADC_G9_RCR9.
*/
#define	EVADC_G9RCR9	(EVADC_G9_RCR9)

