Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  2994, Result Event Flag Clear Register, Group */
#define EVADC_G9_REFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0022994u)

/** Alias (User Manual Name) for EVADC_G9_REFCLR.
* To use register names with standard convension, please use EVADC_G9_REFCLR.
*/
#define	EVADC_G9REFCLR	(EVADC_G9_REFCLR)

/** \brief  2984, Result Event Flag Register, Group */
#define EVADC_G9_REFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0022984u)

/** Alias (User Manual Name) for EVADC_G9_REFLAG.
* To use register names with standard convension, please use EVADC_G9_REFLAG.
*/
#define	EVADC_G9REFLAG	(EVADC_G9_REFLAG)

/** \brief  2B00, Group Result Register */
#define EVADC_G9_RES0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B00u)

/** Alias (User Manual Name) for EVADC_G9_RES0.
* To use register names with standard convension, please use EVADC_G9_RES0.
*/
#define	EVADC_G9RES0	(EVADC_G9_RES0)

/** \brief  2B04, Group Result Register */
#define EVADC_G9_RES1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B04u)

/** Alias (User Manual Name) for EVADC_G9_RES1.
* To use register names with standard convension, please use EVADC_G9_RES1.
*/
#define	EVADC_G9RES1	(EVADC_G9_RES1)

/** \brief  2B28, Group Result Register */
#define EVADC_G9_RES10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B28u)

/** Alias (User Manual Name) for EVADC_G9_RES10.
* To use register names with standard convension, please use EVADC_G9_RES10.
*/
#define	EVADC_G9RES10	(EVADC_G9_RES10)

/** \brief  2B2C, Group Result Register */
#define EVADC_G9_RES11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B2Cu)

/** Alias (User Manual Name) for EVADC_G9_RES11.
* To use register names with standard convension, please use EVADC_G9_RES11.
*/
#define	EVADC_G9RES11	(EVADC_G9_RES11)

/** \brief  2B30, Group Result Register */
#define EVADC_G9_RES12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B30u)

/** Alias (User Manual Name) for EVADC_G9_RES12.
* To use register names with standard convension, please use EVADC_G9_RES12.
*/
#define	EVADC_G9RES12	(EVADC_G9_RES12)

/** \brief  2B34, Group Result Register */
#define EVADC_G9_RES13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B34u)

/** Alias (User Manual Name) for EVADC_G9_RES13.
* To use register names with standard convension, please use EVADC_G9_RES13.
*/
#define	EVADC_G9RES13	(EVADC_G9_RES13)

/** \brief  2B38, Group Result Register */
#define EVADC_G9_RES14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B38u)

/** Alias (User Manual Name) for EVADC_G9_RES14.
* To use register names with standard convension, please use EVADC_G9_RES14.
*/
#define	EVADC_G9RES14	(EVADC_G9_RES14)

/** \brief  2B3C, Group Result Register */
#define EVADC_G9_RES15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B3Cu)

/** Alias (User Manual Name) for EVADC_G9_RES15.
* To use register names with standard convension, please use EVADC_G9_RES15.
*/
#define	EVADC_G9RES15	(EVADC_G9_RES15)

/** \brief  2B08, Group Result Register */
#define EVADC_G9_RES2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B08u)

/** Alias (User Manual Name) for EVADC_G9_RES2.
* To use register names with standard convension, please use EVADC_G9_RES2.
*/
#define	EVADC_G9RES2	(EVADC_G9_RES2)

/** \brief  2B0C, Group Result Register */
#define EVADC_G9_RES3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B0Cu)

/** Alias (User Manual Name) for EVADC_G9_RES3.
* To use register names with standard convension, please use EVADC_G9_RES3.
*/
#define	EVADC_G9RES3	(EVADC_G9_RES3)

/** \brief  2B10, Group Result Register */
#define EVADC_G9_RES4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B10u)

/** Alias (User Manual Name) for EVADC_G9_RES4.
* To use register names with standard convension, please use EVADC_G9_RES4.
*/
#define	EVADC_G9RES4	(EVADC_G9_RES4)

/** \brief  2B14, Group Result Register */
#define EVADC_G9_RES5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B14u)

/** Alias (User Manual Name) for EVADC_G9_RES5.
* To use register names with standard convension, please use EVADC_G9_RES5.
*/
#define	EVADC_G9RES5	(EVADC_G9_RES5)

/** \brief  2B18, Group Result Register */
#define EVADC_G9_RES6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B18u)

/** Alias (User Manual Name) for EVADC_G9_RES6.
* To use register names with standard convension, please use EVADC_G9_RES6.
*/
#define	EVADC_G9RES6	(EVADC_G9_RES6)

/** \brief  2B1C, Group Result Register */
#define EVADC_G9_RES7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B1Cu)

/** Alias (User Manual Name) for EVADC_G9_RES7.
* To use register names with standard convension, please use EVADC_G9_RES7.
*/
#define	EVADC_G9RES7	(EVADC_G9_RES7)

/** \brief  2B20, Group Result Register */
#define EVADC_G9_RES8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B20u)

/** Alias (User Manual Name) for EVADC_G9_RES8.
* To use register names with standard convension, please use EVADC_G9_RES8.
*/
#define	EVADC_G9RES8	(EVADC_G9_RES8)

/** \brief  2B24, Group Result Register */
#define EVADC_G9_RES9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RES*)0xF0022B24u)

/** Alias (User Manual Name) for EVADC_G9_RES9.
* To use register names with standard convension, please use EVADC_G9_RES9.
*/
#define	EVADC_G9RES9	(EVADC_G9_RES9)

/** \brief  2B80, Group Result Reg., Debug */
#define EVADC_G9_RESD0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B80u)

/** Alias (User Manual Name) for EVADC_G9_RESD0.
* To use register names with standard convension, please use EVADC_G9_RESD0.
*/
#define	EVADC_G9RESD0	(EVADC_G9_RESD0)

/** \brief  2B84, Group Result Reg., Debug */
#define EVADC_G9_RESD1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B84u)

/** Alias (User Manual Name) for EVADC_G9_RESD1.
* To use register names with standard convension, please use EVADC_G9_RESD1.
*/
#define	EVADC_G9RESD1	(EVADC_G9_RESD1)

/** \brief  2BA8, Group Result Reg., Debug */
#define EVADC_G9_RESD10 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BA8u)

/** Alias (User Manual Name) for EVADC_G9_RESD10.
* To use register names with standard convension, please use EVADC_G9_RESD10.
*/
#define	EVADC_G9RESD10	(EVADC_G9_RESD10)

