Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** \brief  2BAC, Group Result Reg., Debug */
#define EVADC_G9_RESD11 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BACu)

/** Alias (User Manual Name) for EVADC_G9_RESD11.
* To use register names with standard convension, please use EVADC_G9_RESD11.
*/
#define	EVADC_G9RESD11	(EVADC_G9_RESD11)

/** \brief  2BB0, Group Result Reg., Debug */
#define EVADC_G9_RESD12 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BB0u)

/** Alias (User Manual Name) for EVADC_G9_RESD12.
* To use register names with standard convension, please use EVADC_G9_RESD12.
*/
#define	EVADC_G9RESD12	(EVADC_G9_RESD12)

/** \brief  2BB4, Group Result Reg., Debug */
#define EVADC_G9_RESD13 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BB4u)

/** Alias (User Manual Name) for EVADC_G9_RESD13.
* To use register names with standard convension, please use EVADC_G9_RESD13.
*/
#define	EVADC_G9RESD13	(EVADC_G9_RESD13)

/** \brief  2BB8, Group Result Reg., Debug */
#define EVADC_G9_RESD14 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BB8u)

/** Alias (User Manual Name) for EVADC_G9_RESD14.
* To use register names with standard convension, please use EVADC_G9_RESD14.
*/
#define	EVADC_G9RESD14	(EVADC_G9_RESD14)

/** \brief  2BBC, Group Result Reg., Debug */
#define EVADC_G9_RESD15 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BBCu)

/** Alias (User Manual Name) for EVADC_G9_RESD15.
* To use register names with standard convension, please use EVADC_G9_RESD15.
*/
#define	EVADC_G9RESD15	(EVADC_G9_RESD15)

/** \brief  2B88, Group Result Reg., Debug */
#define EVADC_G9_RESD2 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B88u)

/** Alias (User Manual Name) for EVADC_G9_RESD2.
* To use register names with standard convension, please use EVADC_G9_RESD2.
*/
#define	EVADC_G9RESD2	(EVADC_G9_RESD2)

/** \brief  2B8C, Group Result Reg., Debug */
#define EVADC_G9_RESD3 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B8Cu)

/** Alias (User Manual Name) for EVADC_G9_RESD3.
* To use register names with standard convension, please use EVADC_G9_RESD3.
*/
#define	EVADC_G9RESD3	(EVADC_G9_RESD3)

/** \brief  2B90, Group Result Reg., Debug */
#define EVADC_G9_RESD4 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B90u)

/** Alias (User Manual Name) for EVADC_G9_RESD4.
* To use register names with standard convension, please use EVADC_G9_RESD4.
*/
#define	EVADC_G9RESD4	(EVADC_G9_RESD4)

/** \brief  2B94, Group Result Reg., Debug */
#define EVADC_G9_RESD5 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B94u)

/** Alias (User Manual Name) for EVADC_G9_RESD5.
* To use register names with standard convension, please use EVADC_G9_RESD5.
*/
#define	EVADC_G9RESD5	(EVADC_G9_RESD5)

/** \brief  2B98, Group Result Reg., Debug */
#define EVADC_G9_RESD6 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B98u)

/** Alias (User Manual Name) for EVADC_G9_RESD6.
* To use register names with standard convension, please use EVADC_G9_RESD6.
*/
#define	EVADC_G9RESD6	(EVADC_G9_RESD6)

/** \brief  2B9C, Group Result Reg., Debug */
#define EVADC_G9_RESD7 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022B9Cu)

/** Alias (User Manual Name) for EVADC_G9_RESD7.
* To use register names with standard convension, please use EVADC_G9_RESD7.
*/
#define	EVADC_G9RESD7	(EVADC_G9_RESD7)

/** \brief  2BA0, Group Result Reg., Debug */
#define EVADC_G9_RESD8 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BA0u)

/** Alias (User Manual Name) for EVADC_G9_RESD8.
* To use register names with standard convension, please use EVADC_G9_RESD8.
*/
#define	EVADC_G9RESD8	(EVADC_G9_RESD8)

/** \brief  2BA4, Group Result Reg., Debug */
#define EVADC_G9_RESD9 /*lint --e(923)*/ (*(volatile Ifx_EVADC_RESD*)0xF0022BA4u)

/** Alias (User Manual Name) for EVADC_G9_RESD9.
* To use register names with standard convension, please use EVADC_G9_RESD9.
*/
#define	EVADC_G9RESD9	(EVADC_G9_RESD9)

/** \brief  29B0, Result Event Node Pointer Reg. 0, Group */
#define EVADC_G9_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00229B0u)

/** Alias (User Manual Name) for EVADC_G9_REVNP0.
* To use register names with standard convension, please use EVADC_G9_REVNP0.
*/
#define	EVADC_G9REVNP0	(EVADC_G9_REVNP0)

/** \brief  29B4, Result Event Node Pointer Reg. 1, Group */
#define EVADC_G9_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00229B4u)

/** Alias (User Manual Name) for EVADC_G9_REVNP1.
* To use register names with standard convension, please use EVADC_G9_REVNP1.
*/
#define	EVADC_G9REVNP1	(EVADC_G9_REVNP1)

/** \brief  2998, Source Event Flag Clear Reg., Group */
#define EVADC_G9_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0022998u)

/** Alias (User Manual Name) for EVADC_G9_SEFCLR.
* To use register names with standard convension, please use EVADC_G9_SEFCLR.
*/
#define	EVADC_G9SEFCLR	(EVADC_G9_SEFCLR)

/** \brief  2988, Source Event Flag Register, Group */
#define EVADC_G9_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0022988u)

/** Alias (User Manual Name) for EVADC_G9_SEFLAG.
* To use register names with standard convension, please use EVADC_G9_SEFLAG.
*/
#define	EVADC_G9SEFLAG	(EVADC_G9_SEFLAG)

/** \brief  29C0, Source Event Node Pointer Reg., Group */
#define EVADC_G9_SEVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00229C0u)

/** Alias (User Manual Name) for EVADC_G9_SEVNP.
* To use register names with standard convension, please use EVADC_G9_SEVNP.
*/
#define	EVADC_G9SEVNP	(EVADC_G9_SEVNP)

/** \brief  29C8, Service Request Software Activation Trigger, Group */
#define EVADC_G9_SRACT /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00229C8u)

/** Alias (User Manual Name) for EVADC_G9_SRACT.
* To use register names with standard convension, please use EVADC_G9_SRACT.
*/
#define	EVADC_G9SRACT	(EVADC_G9_SRACT)

/** \brief  28C0, Synchronization Control Register, Group */
#define EVADC_G9_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00228C0u)

/** Alias (User Manual Name) for EVADC_G9_SYNCTR.
* To use register names with standard convension, please use EVADC_G9_SYNCTR.
*/
#define	EVADC_G9SYNCTR	(EVADC_G9_SYNCTR)

/** \brief  29F8, Valid Flag Register, Group */
#define EVADC_G9_VFR /*lint --e(923)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00229F8u)

