Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_reg.h
/** Alias (User Manual Name) for EVADC_G9_VFR.
* To use register names with standard convension, please use EVADC_G9_VFR.
*/
#define	EVADC_G9VFR	(EVADC_G9_VFR)

/** \brief  B8, Global Boundary Select Register */
#define EVADC_GLOB_BOUND /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_BOUND*)0xF00200B8u)

/** Alias (User Manual Name) for EVADC_GLOB_BOUND.
* To use register names with standard convension, please use EVADC_GLOB_BOUND.
*/
#define	EVADC_GLOBBOUND	(EVADC_GLOB_BOUND)

/** \brief  E0, Global Event Flag Register */
#define EVADC_GLOB_EFLAG /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_EFLAG*)0xF00200E0u)

/** Alias (User Manual Name) for EVADC_GLOB_EFLAG.
* To use register names with standard convension, please use EVADC_GLOB_EFLAG.
*/
#define	EVADC_GLOBEFLAG	(EVADC_GLOB_EFLAG)

/** \brief  140, Global Event Node Pointer Register */
#define EVADC_GLOB_EVNP /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_EVNP*)0xF0020140u)

/** Alias (User Manual Name) for EVADC_GLOB_EVNP.
* To use register names with standard convension, please use EVADC_GLOB_EVNP.
*/
#define	EVADC_GLOBEVNP	(EVADC_GLOB_EVNP)

/** \brief  A0, Input Class Reg0ster i, Global */
#define EVADC_GLOB_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOBICLASS*)0xF00200A0u)

/** Alias (User Manual Name) for EVADC_GLOB_ICLASS0.
* To use register names with standard convension, please use EVADC_GLOB_ICLASS0.
*/
#define	EVADC_GLOBICLASS0	(EVADC_GLOB_ICLASS0)

/** \brief  A4, Input Class Reg0ster i, Global */
#define EVADC_GLOB_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOBICLASS*)0xF00200A4u)

/** Alias (User Manual Name) for EVADC_GLOB_ICLASS1.
* To use register names with standard convension, please use EVADC_GLOB_ICLASS1.
*/
#define	EVADC_GLOBICLASS1	(EVADC_GLOB_ICLASS1)

/** \brief  280, Global Result Control Register */
#define EVADC_GLOB_RCR /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_RCR*)0xF0020280u)

/** Alias (User Manual Name) for EVADC_GLOB_RCR.
* To use register names with standard convension, please use EVADC_GLOB_RCR.
*/
#define	EVADC_GLOBRCR	(EVADC_GLOB_RCR)

/** \brief  300, Global Result Register */
#define EVADC_GLOB_RES /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_RES*)0xF0020300u)

/** Alias (User Manual Name) for EVADC_GLOB_RES.
* To use register names with standard convension, please use EVADC_GLOB_RES.
*/
#define	EVADC_GLOBRES	(EVADC_GLOB_RES)

/** \brief  380, Global Result Register, Debug */
#define EVADC_GLOB_RESD /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_RESD*)0xF0020380u)

/** Alias (User Manual Name) for EVADC_GLOB_RESD.
* To use register names with standard convension, please use EVADC_GLOB_RESD.
*/
#define	EVADC_GLOBRESD	(EVADC_GLOB_RESD)

/** \brief  164, Global Test Enable Register */
#define EVADC_GLOB_TE /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_TE*)0xF0020164u)

/** Alias (User Manual Name) for EVADC_GLOB_TE.
* To use register names with standard convension, please use EVADC_GLOB_TE.
*/
#define	EVADC_GLOBTE	(EVADC_GLOB_TE)

/** \brief  160, Global Test Functions Register */
#define EVADC_GLOB_TF /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOB_TF*)0xF0020160u)

/** Alias (User Manual Name) for EVADC_GLOB_TF.
* To use register names with standard convension, please use EVADC_GLOB_TF.
*/
#define	EVADC_GLOBTF	(EVADC_GLOB_TF)

/** \brief  80, Global Configuration Register */
#define EVADC_GLOBCFG /*lint --e(923)*/ (*(volatile Ifx_EVADC_GLOBCFG*)0xF0020080u)

/** \brief  8, Module Identification Register */
#define EVADC_ID /*lint --e(923)*/ (*(volatile Ifx_EVADC_ID*)0xF0020008u)

/** \brief  34, Kernel Reset Register 0 */
#define EVADC_KRST0 /*lint --e(923)*/ (*(volatile Ifx_EVADC_KRST0*)0xF0020034u)

/** \brief  30, Kernel Reset Register 1 */
#define EVADC_KRST1 /*lint --e(923)*/ (*(volatile Ifx_EVADC_KRST1*)0xF0020030u)

/** \brief  2C, Kernel Reset Status Clear Register */
#define EVADC_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_EVADC_KRSTCLR*)0xF002002Cu)

/** \brief  28, OCDS Control and Status Register */
#define EVADC_OCS /*lint --e(923)*/ (*(volatile Ifx_EVADC_OCS*)0xF0020028u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEVADC_REG_H */
